{"symbol":"MMC","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:03.489Z","asOfDate":"2025-12-26","articles":[{"id":"19f5ab53-666a-3680-89de-9aab6e17227b","title":"Lowe's Christmas Day hours 2025","url":"https://finance.yahoo.com/m/19f5ab53-666a-3680-89de-9aab6e17227b/lowe%27s-christmas-day-hours.html","publisher":"TheStreet","publishedAt":"2025-12-25T16:00:00.000Z","relatedTickers":[],"mainIdea":"Lowe's Christmas Day hours 2025","summary":"TheStreet: Lowe's Christmas Day hours 2025. Lowe’s is a practical stop for more than just tools and supplies this holiday season. Maybe you’re picking up extra outdoor lights or extension cords for some very last-minute Christmas decorating. Or perhaps you want to grab a fresh wreath for your front door, a stack of firewood to keep guests ..."},{"id":"f95c4228-bf58-35c4-aad9-205209da5233","title":"The Bull Case For Marsh & McLennan (MMC) Could Change Following Q3 Beat And Sustainability Push – Learn Why","url":"https://finance.yahoo.com/news/bull-case-marsh-mclennan-mmc-130624899.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T13:06:24.000Z","relatedTickers":[],"mainIdea":"The Bull Case For Marsh & McLennan (MMC) Could Change Following Q3 Beat And Sustainability Push – Learn Why","summary":"Simply Wall St.: The Bull Case For Marsh & McLennan (MMC) Could Change Following Q3 Beat And Sustainability Push – Learn Why. In the past quarter, Marsh & McLennan Companies reported Q3 2025 results that matched Wall Street’s revenue expectations, with sales rising 11.5% year on year and non-GAAP earnings per share coming in 4.1% above analyst estimates. The company’s solid double-digit growth in revenue, adjusted operating income, and adjusted EPS, alongside its advisory support around new ISSB sustainability reporting standards, underlines how it is positioning its risk and consulting services for evolving..."},{"id":"490455e2-8962-3e0a-a81d-b2068cf21b1d","title":"2 Services Stocks with Exciting Potential and 1 We Question","url":"https://finance.yahoo.com/news/2-services-stocks-exciting-potential-043347811.html","publisher":"StockStory","publishedAt":"2025-12-25T04:33:47.000Z","relatedTickers":["EXLS","IRDM","^GSPC"],"mainIdea":"2 Services Stocks with Exciting Potential and 1 We Question","summary":"StockStory: 2 Services Stocks with Exciting Potential and 1 We Question. Business services providers play a critical role for enterprises, assisting them with everything from new hardware integrations to consulting and marketing. But cutbacks in corporate spending and the threat of new AI products have kept sentiment in check, and over the past six months, the industry’s 8.2% return has trailed the S&P 500 by 5.1 percentage points. Related tickers mentioned: EXLS, IRDM, ^GSPC."}]}
