{"symbol":"MMC","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:27.943Z","asOfDate":"2025-12-23","articles":[{"id":"521d2b94-2554-3609-90cc-e89413960cfc","title":"Franklin Covey to Report First Quarter Fiscal 2026 Results","url":"https://finance.yahoo.com/news/franklin-covey-report-first-quarter-211200595.html","publisher":"Business Wire","publishedAt":"2025-12-22T21:12:00.000Z","relatedTickers":["FC"],"mainIdea":"Franklin Covey to Report First Quarter Fiscal 2026 Results","summary":"Business Wire: Franklin Covey to Report First Quarter Fiscal 2026 Results. DRAPER, Utah, December 22, 2025--Franklin Covey Co. (NYSE: FC), a leader in organizational performance improvement, announced today that the conference call to review the Company’s first quarter 2026 financial results will take place on Wednesday, January 7, 2026, at 5:00 p.m. ET (3:00 p.m. MT). The Company’s financial results are expected to be released after the close of the market on Wednesday, January 7, 2026. Related tickers mentioned: FC."},{"id":"cb2bebfd-7173-396e-a2e2-172f3387aad5","title":"KREATE PARTICIPATES IN THE HOME DEPOT'S 2025 WINTER STORAGE EVENT","url":"https://finance.yahoo.com/news/kreate-participates-home-depots-2025-150000295.html","publisher":"PR Newswire","publishedAt":"2025-12-22T15:00:00.000Z","relatedTickers":[],"mainIdea":"KREATE PARTICIPATES IN THE HOME DEPOT'S 2025 WINTER STORAGE EVENT","summary":"PR Newswire: KREATE PARTICIPATES IN THE HOME DEPOT'S 2025 WINTER STORAGE EVENT. Kreate, a leading vertically integrated, innovation-based company, announced today the launch of three new storage products as part of The Home Depot's annual Winter Storage Event, giving customers smarter ways to organize their garage, tool and home storage solutions."},{"id":"7d37c549-4066-37cd-889f-a9a1b0fb7e7d","title":"BofA Commits $10 Million in Capital for Residents and Small Businesses Impacted by L.A. Wildfires","url":"https://finance.yahoo.com/news/bofa-commits-10-million-capital-140000425.html","publisher":"PR Newswire","publishedAt":"2025-12-22T14:00:00.000Z","relatedTickers":["BAC"],"mainIdea":"BofA Commits $10 Million in Capital for Residents and Small Businesses Impacted by L.A. Wildfires","summary":"PR Newswire: BofA Commits $10 Million in Capital for Residents and Small Businesses Impacted by L.A. Wildfires. As Los Angeles continues its efforts to rebuild, Bank of America is announcing $10 million in zero-interest loans to Community Development Financial Institutions (CDFI) for ongoing housing, nonprofit facilities, and small business assistance. The loans will be managed through three west coast CDFIs involved in the region's disaster recovery efforts following the devastating Eaton and Palisades fires. Related tickers mentioned: BAC."}]}
