{"symbol":"KKR","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:29:13.219Z","asOfDate":"2025-12-25","articles":[{"id":"fc4dc3f3-46b5-347c-abc8-9b3c5217f5eb","title":"Warren Buffett and Private Equity Both Love Insurance. The Similarities End There.","url":"https://finance.yahoo.com/m/fc4dc3f3-46b5-347c-abc8-9b3c5217f5eb/warren-buffett-and-private.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-25T10:30:00.000Z","relatedTickers":["APO","APO-PA","BRK-B","BRK.A"],"mainIdea":"Warren Buffett and Private Equity Both Love Insurance. The Similarities End There.","summary":"The Wall Street Journal: Warren Buffett and Private Equity Both Love Insurance. The Similarities End There.. Lots of people want to invest insurance money these days. Nobody does it quite like Warren Buffett. The seed capital Buffett’s Berkshire Hathaway uses to maintain its vast investing empire comes from insurance premiums, dollars that often sit unused for months or years before going to pay claims. Related tickers mentioned: APO, APO-PA, BRK-B, BRK.A."},{"id":"8baf5e65-fa44-3c30-b056-eeaa95a023d6","title":"KKR (KKR): Revisiting Valuation After a Strong Month and Ongoing Earnings Growth","url":"https://finance.yahoo.com/news/kkr-kkr-revisiting-valuation-strong-071147125.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T07:11:47.000Z","relatedTickers":["KKR-PD"],"mainIdea":"KKR (KKR): Revisiting Valuation After a Strong Month and Ongoing Earnings Growth","summary":"Simply Wall St.: KKR (KKR): Revisiting Valuation After a Strong Month and Ongoing Earnings Growth. KKR (KKR) has been quietly drifting after a strong month, and that sideways action is what makes the stock interesting here, especially given its mix of shrinking revenue and rising earnings. See our latest analysis for KKR. That recent 10.97 percent 1 month share price return has only partially offset a weaker year to date. However, the three year total shareholder return of 196.09 percent suggests the longer term momentum story is still very much intact. If KKR has you thinking about where... Related tickers mentioned: KKR-PD."},{"id":"77b0d585-8004-3e32-bd35-6d484acf7d9b","title":"The Boss Who Gave His Employees a $240 Million Gift","url":"https://finance.yahoo.com/m/77b0d585-8004-3e32-bd35-6d484acf7d9b/the-boss-who-gave-his.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-25T02:00:00.000Z","relatedTickers":[],"mainIdea":"The Boss Who Gave His Employees a $240 Million Gift","summary":"The Wall Street Journal: The Boss Who Gave His Employees a $240 Million Gift. In March, Lesia Key was summoned to meet her boss, Graham Walker, near the factory where they worked. Walker and his family started a company in Minden, La., called Fibrebond, which makes enclosures for electrical equipment. In June, his 540 full-time employees began receiving $240 million in bonuses."},{"id":"34d73cba-ebe5-38bc-9359-9033f10f8683","title":"Data Center Leases Are 'Swiss Cheese' — Why Billionaire Developer Steers Clear Of Data Centers","url":"https://finance.yahoo.com/news/data-center-leases-swiss-cheese-141606107.html","publisher":"Benzinga","publishedAt":"2025-12-24T14:16:06.000Z","relatedTickers":["BX","KKR-PD"],"mainIdea":"Data Center Leases Are 'Swiss Cheese' — Why Billionaire Developer Steers Clear Of Data Centers","summary":"Benzinga: Data Center Leases Are 'Swiss Cheese' — Why Billionaire Developer Steers Clear Of Data Centers. Data centers have become Wall Street darlings, with giants like Blackstone Inc. (NYSE:BX), KKR & Co.. (NYSE:KKR) and Bain Capital pouring billions into the infrastructure powering the AI revolution. But while most investors are chasing the \"hyperscale\" dream, Fernando De Leon, founder of Leon Capital Group, is sounding a loud alarm, according to CNBC. De Leon, who turned a $100,000 startup into a $10 billion commercial real estate empire, isn't just a skeptic — he's a student of market cycles. F Related tickers mentioned: BX, KKR-PD."}]}
