{"symbol":"EMR","provider":"yahoo-finance","fetchedAt":"2025-12-23T15:58:59.356Z","asOfDate":"2025-12-23","articles":[{"id":"76faa916-88ef-3c75-b1ec-ef3c9e8c8ccb","title":"Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?","url":"https://finance.yahoo.com/news/does-emerson-electric-automation-pivot-081526679.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:15:26.000Z","relatedTickers":[],"mainIdea":"Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?","summary":"Simply Wall St.: Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?. If you are wondering whether Emerson Electric at around $134.99 is still worth buying after its big run, you are not alone. This breakdown is designed to help you decide if the current price still makes sense. The stock has climbed about 0.7% over the last week, 5.3% over the past month and 10.5% year to date, adding to a longer run of 48.2% over 3 years and 89.0% over 5 years that has clearly shifted how the market is pricing its prospects. Part of this renewed interest has come as Emerson..."},{"id":"b0380ac4-45c7-3359-b2e4-616eb618d3d6","title":"Institutional investors have a lot riding on Emerald Resources NL (ASX:EMR) with 41% ownership","url":"https://finance.yahoo.com/news/institutional-investors-lot-riding-emerald-022736987.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T02:27:36.000Z","relatedTickers":["EOGSF"],"mainIdea":"Institutional investors have a lot riding on Emerald Resources NL (ASX:EMR) with 41% ownership","summary":"Simply Wall St.: Institutional investors have a lot riding on Emerald Resources NL (ASX:EMR) with 41% ownership. Key Insights Institutions' substantial holdings in Emerald Resources implies that they have significant influence over... Related tickers mentioned: EOGSF."},{"id":"1daf84cb-2880-3222-9931-17397a9ee63c","title":"Emerson Electric (EMR): Is the Automation Leader Quietly Undervalued After Its Recent Multi‑Year Share Price Climb?","url":"https://finance.yahoo.com/news/emerson-electric-emr-automation-leader-020717279.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T02:07:17.000Z","relatedTickers":[],"mainIdea":"Emerson Electric (EMR): Is the Automation Leader Quietly Undervalued After Its Recent Multi‑Year Share Price Climb?","summary":"Simply Wall St.: Emerson Electric (EMR): Is the Automation Leader Quietly Undervalued After Its Recent Multi‑Year Share Price Climb?. Emerson Electric (EMR) has quietly added to its steady track record this year, with the stock up about 9% over the past year and roughly 48% across the past 3 years. See our latest analysis for Emerson Electric. That mix of a recent pullback alongside an 8.8% year to date share price return and a near 48% three year total shareholder return suggests momentum is cooling slightly rather than reversing, as investors weigh steady growth against valuation. If Emerson’s measured climb has you..."},{"id":"dabd8d31-46be-3286-a0b6-e0f37c3703b9","title":"IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments","url":"https://finance.yahoo.com/news/intelepeer-agentic-ai-trend-report-181600339.html","publisher":"Business Wire","publishedAt":"2025-12-22T18:16:00.000Z","relatedTickers":[],"mainIdea":"IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments","summary":"Business Wire: IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments. DANIA BEACH, Fla., December 22, 2025--IntelePeer today released a new executive outlook report that offers actionable insights for healthcare organizations to consider in successfully implementing Agentic AI into their workflows in 2026. It suggests that secure, compliant Agentic AI automation solutions will become critical requirements to ensure profitability and resilience in the face of staffing shortages, rising costs, and patient expectations for digital engagement."}]}
