{"symbol":"EMR","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:58:14.717Z","asOfDate":"2025-12-22","articles":[{"id":"dabd8d31-46be-3286-a0b6-e0f37c3703b9","title":"IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments","url":"https://finance.yahoo.com/news/intelepeer-agentic-ai-trend-report-181600339.html","publisher":"Business Wire","publishedAt":"2025-12-22T18:16:00.000Z","relatedTickers":[],"mainIdea":"IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments","summary":"Business Wire: IntelePeer Agentic AI Trend Report Cites Trust, Day-One Value, Integration, and Analytics as Critical Success Factors in Healthcare Deployments. DANIA BEACH, Fla., December 22, 2025--IntelePeer today released a new executive outlook report that offers actionable insights for healthcare organizations to consider in successfully implementing Agentic AI into their workflows in 2026. It suggests that secure, compliant Agentic AI automation solutions will become critical requirements to ensure profitability and resilience in the face of staffing shortages, rising costs, and patient expectations for digital engagement."},{"id":"cb59246d-f3d9-31e8-9b12-b09d5ba86ad6","title":"FlyteHealth to Expand Direct Access to Obesity Management Medication for Employers","url":"https://finance.yahoo.com/news/flytehealth-expand-direct-access-obesity-160000588.html","publisher":"PR Newswire","publishedAt":"2025-12-22T16:00:00.000Z","relatedTickers":["LLY"],"mainIdea":"FlyteHealth to Expand Direct Access to Obesity Management Medication for Employers","summary":"PR Newswire: FlyteHealth to Expand Direct Access to Obesity Management Medication for Employers. FlyteHealth, a national leader in integrated cardio-kidney-metabolic care, today announced it will provide self-insured organizations with a new access pathway for obesity management medication from Eli Lilly and Company (Lilly) — supported by FlyteHealth Related tickers mentioned: LLY."},{"id":"b4db8aea-4e03-39cc-b8e4-a38d41b1eee4","title":"Amesite introduces AI-native EMR system, NurseMagic EMR","url":"https://finance.yahoo.com/m/b4db8aea-4e03-39cc-b8e4-a38d41b1eee4/amesite-introduces-ai-native.html","publisher":"Hospital Management","publishedAt":"2025-12-22T13:51:37.000Z","relatedTickers":["AMST"],"mainIdea":"Amesite introduces AI-native EMR system, NurseMagic EMR","summary":"Hospital Management: Amesite introduces AI-native EMR system, NurseMagic EMR. The system extends the NurseMagic platform from a point-of-care solution to an enterprise-level infrastructure. Related tickers mentioned: AMST."}]}
