{"symbol":"EMR","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:19.042Z","asOfDate":"2025-12-27","articles":[{"id":"1f433491-9d99-3126-bff0-487bb82a16f1","title":"Investors Heavily Search Emerson Electric Co. (EMR): Here is What You Need to Know","url":"https://finance.yahoo.com/news/investors-heavily-search-emerson-electric-140003125.html","publisher":"Zacks","publishedAt":"2025-12-26T14:00:03.000Z","relatedTickers":["^GSPC"],"mainIdea":"Investors Heavily Search Emerson Electric Co. (EMR): Here is What You Need to Know","summary":"Zacks: Investors Heavily Search Emerson Electric Co. (EMR): Here is What You Need to Know. Emerson Electric (EMR) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock. Related tickers mentioned: ^GSPC."},{"id":"bd1d1c4c-298c-3768-8906-6ccc2be13312","title":"Reflecting On Internet of Things Stocks’ Q3 Earnings: Trimble (NASDAQ:TRMB)","url":"https://finance.yahoo.com/news/reflecting-internet-things-stocks-q3-033133992.html","publisher":"StockStory","publishedAt":"2025-12-24T03:31:33.000Z","relatedTickers":["TRMB"],"mainIdea":"Reflecting On Internet of Things Stocks’ Q3 Earnings: Trimble (NASDAQ:TRMB)","summary":"StockStory: Reflecting On Internet of Things Stocks’ Q3 Earnings: Trimble (NASDAQ:TRMB). Wrapping up Q3 earnings, we look at the numbers and key takeaways for the internet of things stocks, including Trimble (NASDAQ:TRMB) and its peers. Related tickers mentioned: TRMB."},{"id":"76faa916-88ef-3c75-b1ec-ef3c9e8c8ccb","title":"Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?","url":"https://finance.yahoo.com/news/does-emerson-electric-automation-pivot-081526679.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:15:26.000Z","relatedTickers":[],"mainIdea":"Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?","summary":"Simply Wall St.: Does Emerson Electric’s Automation Pivot Justify Its Strong Multi Year Share Price Rally?. If you are wondering whether Emerson Electric at around $134.99 is still worth buying after its big run, you are not alone. This breakdown is designed to help you decide if the current price still makes sense. The stock has climbed about 0.7% over the last week, 5.3% over the past month and 10.5% year to date, adding to a longer run of 48.2% over 3 years and 89.0% over 5 years that has clearly shifted how the market is pricing its prospects. Part of this renewed interest has come as Emerson..."}]}
