{"symbol":"AAPL","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:18:08.943Z","asOfDate":"2025-12-26","articles":[{"id":"9a0a69ca-d932-3ba0-8c65-652b6c0ea4f2","title":"Chinese Billionaire Who Fathered 100 Children Eyes US-Born Heirs For Business Succession","url":"https://finance.yahoo.com/news/chinese-billionaire-fathered-100-children-100552639.html","publisher":"Benzinga","publishedAt":"2025-12-26T10:05:52.000Z","relatedTickers":[],"mainIdea":"Chinese Billionaire Who Fathered 100 Children Eyes US-Born Heirs For Business Succession","summary":"Benzinga: Chinese Billionaire Who Fathered 100 Children Eyes US-Born Heirs For Business Succession. Xu Bo, the billionaire founder and chairman of Guangzhou Duoyi Network, is said to be fathering a multitude of U.S.-born children to inherit his gaming empire. An investigation by the Wall Street Journal has revealed that Xu is seeking parental rights for at least four unborn children and has fathered approximately eight more through surrogacy. The report also indicates the possibility of many more. Earlier, Xu’s company had announced that the gaming magnate has over 100 children born through U."},{"id":"50ac1522-6300-3231-8dff-9591348fc5f6","title":"Company News for Dec 26, 2025","url":"https://finance.yahoo.com/news/company-news-dec-26-2025-080800912.html","publisher":"Zacks","publishedAt":"2025-12-26T08:08:00.000Z","relatedTickers":["DVAX","GROQ.PVT","INTC","NKE","NVDA","SNY"],"mainIdea":"Company News for Dec 26, 2025","summary":"Zacks: Company News for Dec 26, 2025. Companies In The News Are: NVDA, NKE, AAPL, DVAX, SNY, INTC. Related tickers mentioned: DVAX, GROQ.PVT, INTC, NKE, NVDA, SNY."},{"id":"5a837181-2d0c-3bd8-934c-f785e762bfb9","title":"These ‘Quality’ Stocks Are Trading at a 40% Discount to the Market. Act Now.","url":"https://finance.yahoo.com/m/5a837181-2d0c-3bd8-934c-f785e762bfb9/these-%E2%80%98quality%E2%80%99-stocks-are.html","publisher":"Barrons.com","publishedAt":"2025-12-26T06:00:00.000Z","relatedTickers":["UBS","^GSPC"],"mainIdea":"These ‘Quality’ Stocks Are Trading at a 40% Discount to the Market. Act Now.","summary":"Barrons.com: These ‘Quality’ Stocks Are Trading at a 40% Discount to the Market. Act Now.. It predicts 10% more upside for the U.S. market in 2026, but says that investors should now bet on high quality: “The sharp rally in low quality appears unsustainable amid elevated uncertainty and extreme crowding.” For investors, high-quality companies bring to mind financial resilience—just the thing today to offset concerns over runaway artificial-intelligence spending, or a recent rash of flaky business models, like companies that raise cash to hoard crypto. If UBS is right that quality stocks are statistically due for a bounce, all the better. Related tickers mentioned: UBS, ^GSPC."},{"id":"5a7752c7-c087-34ba-9427-151162a18b79","title":"The Paycheck Raid: Trump Restarts Student Loan Seizures","url":"https://finance.yahoo.com/news/paycheck-raid-trump-restarts-student-033105377.html","publisher":"Benzinga","publishedAt":"2025-12-26T03:31:05.000Z","relatedTickers":[],"mainIdea":"The Paycheck Raid: Trump Restarts Student Loan Seizures","summary":"Benzinga: The Paycheck Raid: Trump Restarts Student Loan Seizures. Beginning the first week of January, the era of student loan leniency officially ends. The Trump administration will resume administrative wage garnishment for defaulted federal student loan borrowers, marking the first time these “paycheck raids” have occurred since the pandemic-era pause began nearly six years ago. Wage Garnishment Starting on Jan. 7, 2026, the Department of Education will dispatch the first wave of notices to roughly 1,000 defaulted borrowers. The Trump administration plans t"},{"id":"31545b8b-f6cb-344d-988f-f2557fa4579a","title":"Disney Vs. Netflix: Christmas Streaming Wars And What It Means For The Stocks","url":"https://finance.yahoo.com/news/disney-vs-netflix-christmas-streaming-023107946.html","publisher":"Benzinga","publishedAt":"2025-12-26T02:31:07.000Z","relatedTickers":["DIS","NFLX"],"mainIdea":"Disney Vs. Netflix: Christmas Streaming Wars And What It Means For The Stocks","summary":"Benzinga: Disney Vs. Netflix: Christmas Streaming Wars And What It Means For The Stocks. Families settling in for Christmas movie marathons this week are giving Wall Street another reason to watch Walt Disney Co (NYSE:DIS) and Netflix Inc (NASDAQ:NFLX). Here’s what investors need to know. What To Know: Walt Disney shares traded around $114 on Christmas Eve, up 3% year-to-date, as investors leaned into a holiday slate led by classics on Disney+ and Hulu. The bounce comes after a choppy fall season in which Disney's November quarter showed progress in streaming, but flat overall reven Related tickers mentioned: DIS, NFLX."}]}
