{"symbol":"CME","provider":"yahoo-finance","fetchedAt":"2025-12-23T15:57:37.423Z","asOfDate":"2025-12-23","articles":[{"id":"a4b51a13-d98e-38af-a739-c4863606cdc2","title":"BC-Lumber Futures","url":"https://finance.yahoo.com/news/bc-lumber-futures-153014540.html","publisher":"Associated Press Finance","publishedAt":"2025-12-23T15:30:14.000Z","relatedTickers":["LBR=F"],"mainIdea":"BC-Lumber Futures","summary":"Associated Press Finance: BC-Lumber Futures. Prices as of 10:30:00 AM Tuesday, December 23. Lumber (CME) Related tickers mentioned: LBR=F."},{"id":"59b3d366-f87b-32a5-8a32-65fc0f24bd6c","title":"The U.S. Economy Grew by 4.3% in the Third Quarter, Its Fastest Rate in Years","url":"https://finance.yahoo.com/m/59b3d366-f87b-32a5-8a32-65fc0f24bd6c/the-u.s.-economy-grew-by-4.3%25.html","publisher":"Barrons.com","publishedAt":"2025-12-23T14:24:00.000Z","relatedTickers":[],"mainIdea":"The U.S. Economy Grew by 4.3% in the Third Quarter, Its Fastest Rate in Years","summary":"Barrons.com: The U.S. Economy Grew by 4.3% in the Third Quarter, Its Fastest Rate in Years. Inflation-adjusted gross domestic product expanded at an annualized rate of 4.3% from July through September, the Bureau of Economic Analysis said in its initial estimate on Tuesday. The report, delayed by the recent government shutdown, topped expectations of 3% from economists surveyed by FactSet. The economy’s growth picked up significantly from the 3.8% growth rate recorded in the second quarter."},{"id":"3e0e2010-dd9e-3b32-bb8e-7e51572bde80","title":"January Rate-Cut Odds Slip After GDP Comes in Hot","url":"https://finance.yahoo.com/m/3e0e2010-dd9e-3b32-bb8e-7e51572bde80/january-rate-cut-odds-slip.html","publisher":"Barrons.com","publishedAt":"2025-12-23T13:50:34.000Z","relatedTickers":[],"mainIdea":"January Rate-Cut Odds Slip After GDP Comes in Hot","summary":"Barrons.com: January Rate-Cut Odds Slip After GDP Comes in Hot. Traders trimmed bets on another interest-rate cut in January in the wake of Tuesday’s stronger-than-expected update on third-quarter GDP growth. Odds of a quarter-point cut when the Federal Open Market Committee meets in late January fell to 15.5% on Tuesday, according to the CME FedWatch Tool. Traders see a 22% chance of just one quarter-point cut in 2026, and a 31.9% chance of a half point in cuts."},{"id":"16d2a495-aa91-30a0-b5f8-31ecb6c73234","title":"How DraftKings’ CFTC-Regulated Predictions Platform Accessing Non-Sportsbook States Has Changed Its Investment Story (DKNG)","url":"https://finance.yahoo.com/news/draftkings-cftc-regulated-predictions-platform-010834448.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T01:08:34.000Z","relatedTickers":["DKNG"],"mainIdea":"How DraftKings’ CFTC-Regulated Predictions Platform Accessing Non-Sportsbook States Has Changed Its Investment Story (DKNG)","summary":"Simply Wall St.: How DraftKings’ CFTC-Regulated Predictions Platform Accessing Non-Sportsbook States Has Changed Its Investment Story (DKNG). DraftKings recently launched DraftKings Predictions, a standalone CFTC-regulated app and web platform that lets eligible U.S. customers trade event contracts on sports, finance, and other real-world outcomes across 38 states, including large markets like California, Florida, Georgia, and Texas. By moving into federally regulated prediction markets and connecting to exchanges like CME Group, DraftKings is extending its reach beyond traditional sportsbooks and into states where online sports... Related tickers mentioned: DKNG."},{"id":"42074167-08b1-3d22-b2ed-d33bce96a730","title":"BC-Nikkei 225 Futures","url":"https://finance.yahoo.com/news/bc-nikkei-225-futures-233014200.html","publisher":"Associated Press Finance","publishedAt":"2025-12-22T23:30:14.000Z","relatedTickers":["^N225"],"mainIdea":"BC-Nikkei 225 Futures","summary":"Associated Press Finance: BC-Nikkei 225 Futures. Prices as of 7:30:00 PM Monday, December 22. Nikkei 225 (Yen) (CME) Related tickers mentioned: ^N225."},{"id":"9c092b1d-763f-3449-97dc-e779a1583598","title":"Hogs Pop Higher to Begin the Holiday Week","url":"https://finance.yahoo.com/m/9c092b1d-763f-3449-97dc-e779a1583598/hogs-pop-higher-to-begin-the.html","publisher":"Barchart","publishedAt":"2025-12-22T23:24:16.000Z","relatedTickers":[],"mainIdea":"Hogs Pop Higher to Begin the Holiday Week","summary":"Barchart: Hogs Pop Higher to Begin the Holiday Week. Lean hog futures were up 65 to 85 cents across most contracts on Monday. USDA’s national base hog price was reported at $67.16 on Monday afternoon, down 29 cents from the day prior. The CME Lean Hog Index was down 15 cents on December 18 at $83.73. Export Sales data..."}]}
