{"symbol":"RTX","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:37.926Z","asOfDate":"2025-12-23","articles":[{"id":"278f6731-37b8-3ad7-a5b9-887e478080f6","title":"Stocks to Watch Tuesday Recap: Novo Nordisk, Huntington Ingalls, ServiceNow","url":"https://finance.yahoo.com/m/278f6731-37b8-3ad7-a5b9-887e478080f6/stocks-to-watch-tuesday.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-23T22:11:21.000Z","relatedTickers":["DNNGY","DOGEF","HII","LMT","NOC","NONOF","NOW","NVO"],"mainIdea":"Stocks to Watch Tuesday Recap: Novo Nordisk, Huntington Ingalls, ServiceNow","summary":"The Wall Street Journal: Stocks to Watch Tuesday Recap: Novo Nordisk, Huntington Ingalls, ServiceNow. ↗️ Novo Nordisk (NVO): The Danish drugmaker will start selling a pill version of its Wegovy weight-loss medicine in January, after securing approval from U.S. regulators. Novo Nordisk's stock jumped and its U. Related tickers mentioned: DNNGY, DOGEF, HII, LMT, NOC, NONOF, NOW, NVO."},{"id":"5587c46e-c4a4-3ef9-9385-6146540ad20f","title":"RTX awarded $841.68M Army contract","url":"https://finance.yahoo.com/news/rtx-awarded-841-68m-army-221011262.html","publisher":"TipRanks","publishedAt":"2025-12-23T22:10:11.000Z","relatedTickers":[],"mainIdea":"RTX awarded $841.68M Army contract","summary":"TipRanks: RTX awarded $841.68M Army contract. RTX (RTX) was awarded an $841.68M fixed-price-incentive contract for fire units to include new production hardware, software, services inherent to production, spares and documentation. The modification brings the total cumulative face value of the contract to $1.72B. Work will be performed in Andover, Massachusetts, with an estimated completion date of June 30, 2031. Fiscal 2026 Foreign Military Sales funds in the amount of $841.68M were obligated at the time of the award. Army Contracting Comma"},{"id":"349c5ec7-a8e5-3769-baf1-4a4c9e283545","title":"Trump calls out defense contractors, gold & silver extend gains","url":"https://finance.yahoo.com/video/trump-calls-defense-contractors-gold-181911320.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-23T18:19:11.000Z","relatedTickers":["HII","LMT","NOC"],"mainIdea":"Trump calls out defense contractors, gold & silver extend gains","summary":"Yahoo Finance Video: Trump calls out defense contractors, gold & silver extend gains. Yahoo Finance's J.R. Whalen tracks Tuesday's top moving stocks and biggest market stories in this Market Minute, including Huntington Ingalls Industries (HII); defense contractors like Northrop Grumman (NOC), RTX (RTX), and Lockheed Martin (LMT); and gold (GC=F) and silver (SI=F) rising. Stay up to date on the latest market action, minute-by-minute, with&nbsp;Yahoo Finance's Market Minute. Related tickers mentioned: HII, LMT, NOC."},{"id":"103340f3-4170-3489-bef5-5a04d6710670","title":"Zacks.com featured highlights include NVIDIA, Ralph Lauren, Expedia and Cencora","url":"https://finance.yahoo.com/news/zacks-com-featured-highlights-nvidia-143500894.html","publisher":"Zacks","publishedAt":"2025-12-23T14:35:00.000Z","relatedTickers":["COR","EXPE","NVDA","RL"],"mainIdea":"Zacks.com featured highlights include NVIDIA, Ralph Lauren, Expedia and Cencora","summary":"Zacks: Zacks.com featured highlights include NVIDIA, Ralph Lauren, Expedia and Cencora. NVIDIA leads a group of stocks near 52-week highs, as Zacks highlights momentum-driven upside potential alongside Ralph Lauren, Expedia and Cencora. Related tickers mentioned: COR, EXPE, NVDA, RL."},{"id":"308b8b6a-5be3-3822-a3bd-02fae91bc8c2","title":"Mobvoi and Olares Announce Partnership to Redefine AI Productivity with the World's First \"Hybrid-Cloud\" Note-Taking Earbuds","url":"https://finance.yahoo.com/news/mobvoi-olares-announce-partnership-redefine-140000509.html","publisher":"PR Newswire","publishedAt":"2025-12-23T14:00:00.000Z","relatedTickers":["NVDA"],"mainIdea":"Mobvoi and Olares Announce Partnership to Redefine AI Productivity with the World's First \"Hybrid-Cloud\" Note-Taking Earbuds","summary":"PR Newswire: Mobvoi and Olares Announce Partnership to Redefine AI Productivity with the World's First \"Hybrid-Cloud\" Note-Taking Earbuds. Mobvoi, a global leader in AI interaction and hardware, and Olares, the innovator behind the Personal AI Cloud, today announced a partnership designed to redefine the modern workflow. Byintegrating Mobvoi's TicNote Pods with the computational power of Olares One, the two companies are introducing a flexible ecosystem that offers users an unprecedented choice between subscription-based cloud services and private, local processing. Related tickers mentioned: NVDA."},{"id":"b7098cd1-155a-3f22-b054-68768f046836","title":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","url":"https://finance.yahoo.com/m/b7098cd1-155a-3f22-b054-68768f046836/trump-targets-defense-firms.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-23T00:25:00.000Z","relatedTickers":[],"mainIdea":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","summary":"The Wall Street Journal: Trump Targets Defense Firms on Weapons Speed, Stock Buybacks. President Trump said Monday he wants to pressure America’s largest defense contractors to speed up weapons production by investing in new facilities and ending the practice of repurchasing stocks. “They want to buy back their stock—I don’t want them to buy back their stock,” Trump said, adding that he would make his case to top defense executives in Florida next week. Speaking at his Mar-a-Lago club in Palm Beach on Monday after announcing a new class of Navy battleships that will bear his name, Trump also criticized the high pay of executives at defense firms."},{"id":"6f0e7848-2ae2-33dd-b7f5-e8e73255c5ff","title":"RTX (RTX) Outpaces Stock Market Gains: What You Should Know","url":"https://finance.yahoo.com/news/rtx-rtx-outpaces-stock-market-225003873.html","publisher":"Zacks","publishedAt":"2025-12-22T22:50:03.000Z","relatedTickers":["^DJI","^GSPC","^IXIC"],"mainIdea":"RTX (RTX) Outpaces Stock Market Gains: What You Should Know","summary":"Zacks: RTX (RTX) Outpaces Stock Market Gains: What You Should Know. RTX (RTX) reached $185.68 at the closing of the latest trading day, reflecting a +2.02% change compared to its last close. Related tickers mentioned: ^DJI, ^GSPC, ^IXIC."},{"id":"9ce343f3-61fd-3c89-82cf-fe998c110d3e","title":"Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'","url":"https://finance.yahoo.com/m/9ce343f3-61fd-3c89-82cf-fe998c110d3e/stock-of-the-day-in-buy-zone.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-22T19:59:24.000Z","relatedTickers":["GE"],"mainIdea":"Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'","summary":"Investor's Business Daily: Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'. The company is sitting on a $251 billion backlog as military spending grows and commercial aviation provides another solid path to continued growth. Related tickers mentioned: GE."}]}
