{"symbol":"RTX","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:33.646Z","asOfDate":"2025-12-26","articles":[{"id":"2ee3b89b-978e-3272-94ad-b8cf553d7339","title":"Why RTX (RTX) Is Up 5.2% After Spain’s Record US$1.7 Billion Patriot System Order – And What’s Next","url":"https://finance.yahoo.com/news/why-rtx-rtx-5-2-110530854.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T11:05:30.000Z","relatedTickers":[],"mainIdea":"Why RTX (RTX) Is Up 5.2% After Spain’s Record US$1.7 Billion Patriot System Order – And What’s Next","summary":"Simply Wall St.: Why RTX (RTX) Is Up 5.2% After Spain’s Record US$1.7 Billion Patriot System Order – And What’s Next. Earlier this week, Raytheon, an RTX business, secured a US$1.70 billion foreign military sales contract to supply Spain with four Patriot air and missile defense systems, including radars, launchers, command-and-control stations and training equipment. This is Spain’s largest Patriot order to date, reinforcing RTX’s position as a key supplier of integrated air and missile defense capabilities to U.S. allies. Next, we’ll examine how Spain’s record Patriot order could influence RTX’s defense..."},{"id":"fd491991-e686-3601-a1eb-9babc28e7d28","title":"Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership","url":"https://finance.yahoo.com/news/leak-hints-first-intel-nvidia-174745114.html","publisher":"GuruFocus.com","publishedAt":"2025-12-24T17:47:45.000Z","relatedTickers":["AMD","INTC","NVDA","TSM"],"mainIdea":"Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership","summary":"GuruFocus.com: Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership. Intel (INTC, Financials) and Nvidia (NVDA, Financials) may be preparing to ship their first jointly developed chip, according to leaked details about a laptop processor called Serpent Lake. The leak, shared by YouTube channel RedGamingTec, suggests the chip will combine Intel CPUs with Nvidia RTX graphics in a single design. Serpent Lake is expected to pair Intel's upcoming Titan Lake CPU architecture with Nvidia's RTX Rubin graphics, manufactured on TSMC's 3-nanometer process. Related tickers mentioned: AMD, INTC, NVDA, TSM."},{"id":"4e7d5cf9-036f-3c64-bb5e-697b905e5e08","title":"Why RTX (RTX) is a Top Growth Stock for the Long-Term","url":"https://finance.yahoo.com/news/why-rtx-rtx-top-growth-144504596.html","publisher":"Zacks","publishedAt":"2025-12-24T14:45:04.000Z","relatedTickers":[],"mainIdea":"Why RTX (RTX) is a Top Growth Stock for the Long-Term","summary":"Zacks: Why RTX (RTX) is a Top Growth Stock for the Long-Term. Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}]}
