{"symbol":"RTX","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:29.003Z","asOfDate":"2025-12-27","articles":[{"id":"dd38bf97-f633-398d-851e-a061c892a091","title":"Defense Stocks Are Booming — These Are the 2 Hottest Contractors to Buy for 2026","url":"https://finance.yahoo.com/m/dd38bf97-f633-398d-851e-a061c892a091/defense-stocks-are-booming-%E2%80%94.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-27T17:20:51.000Z","relatedTickers":["KTOS"],"mainIdea":"Defense Stocks Are Booming — These Are the 2 Hottest Contractors to Buy for 2026","summary":"24/7 Wall St.: Defense Stocks Are Booming — These Are the 2 Hottest Contractors to Buy for 2026. Defense contracts have risen sharply in recent years as global security challenges intensify. The ongoing war in Ukraine and escalating tensions in the Middle East have prompted European nations and other allies to replenish depleted munitions and expand their military capabilities. NATO members have committed to higher spending targets, with many countries boosting budgets to ... Defense Stocks Are Booming — These Are the 2 Hottest Contractors to Buy for 2026 Related tickers mentioned: KTOS."},{"id":"b2e35e20-bfe9-388b-8420-f5c7f7b7ffe3","title":"Need for speed: Chinese researchers unveil new technique for near-instant AI video creation","url":"https://finance.yahoo.com/m/b2e35e20-bfe9-388b-8420-f5c7f7b7ffe3/need-for-speed%3A-chinese.html","publisher":"South China Morning Post","publishedAt":"2025-12-27T09:30:00.000Z","relatedTickers":[],"mainIdea":"Need for speed: Chinese researchers unveil new technique for near-instant AI video creation","summary":"South China Morning Post: Need for speed: Chinese researchers unveil new technique for near-instant AI video creation. A new technique called TurboDiffusion claims to be able to accelerate artificial intelligence video-generation speeds by up to 200 times at scale, without compromising overall image quality, according to a recently published paper. The technique reduced the time needed to generate a five-second, standard-definition video clip from more than three minutes to just 1.9 seconds - a nearly 100 times acceleration - when it was tested on a consumer-grade system with Nvidia's RTX 5090 graphics processin"},{"id":"ae48aec1-a3f3-3731-91e4-90e973e8f8b3","title":"Technical Assessment: Bullish in the Intermediate-Term","url":"https://finance.yahoo.com/m/ae48aec1-a3f3-3731-91e4-90e973e8f8b3/technical-assessment%3A-bullish.html","publisher":"Argus Research","publishedAt":"2025-12-26T12:26:15.000Z","relatedTickers":["MDB","^GSPC"],"mainIdea":"Technical Assessment: Bullish in the Intermediate-Term","summary":"Argus Research: Technical Assessment: Bullish in the Intermediate-Term. On Wednesday, we talked about the fact that several major indices have bucked the trend of the S&P 500 and NYSE by failing to reach all-time highs (ATHs). The shortcoming is the result of the deeper pullback by technology stocks during the pullback into the November 20 closing low. In general, tech has rebounded slightly more than the S&P 500 over the past five weeks -- but the trillion-dollar market-cap club hasn't helped the indices for months. That's understandable, as most of those giants appear to be consolidating gains since the April lows. All bullish trends, no matter how powerful, need to recharge their batteries or refuel their tanks on occasion. The sector that has taken over since the November 20 low is Financial (XLF), spiking 9.4% versus the S&P 500's 6% gain and Information Technology's (XLK) 7.7% advance. More importantly, XLF broke out to ATHs in convincing fashion on December 11, peaked on December 15, traced out a bull flag back to initial support from its 10-day exponential average, and popped to new highs early this week. Volume has been strong during advancing days, a sign of institutional accumulation. Of note, there are some convincing claims on Wall Street that Financial stocks could (should) be the one of the major beneficiaries of the AI boom. Recent XLF sector strength has been broad, a bullish sign. Over the past month, the major banks have led, rising almost 12%. By market cap, JPM is up 10%, BAC 9%, WFC 13%, HSBC 15%, RY 14%, C 22%, and SAN 17%. Not far behind, asset managers have ripped higher by 10%, while reinsurance, consumer finance, full-line insurance, and investment services have all rallied about 9%. (Mark Arbeter, CMT) Related tickers mentioned: MDB, ^GSPC."}]}
