{"symbol":"RTX","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:54.976Z","asOfDate":"2025-12-23","articles":[{"id":"b7098cd1-155a-3f22-b054-68768f046836","title":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","url":"https://finance.yahoo.com/m/b7098cd1-155a-3f22-b054-68768f046836/trump-targets-defense-firms.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-23T00:25:00.000Z","relatedTickers":[],"mainIdea":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","summary":"The Wall Street Journal: Trump Targets Defense Firms on Weapons Speed, Stock Buybacks. President Trump said Monday he wants to pressure America’s largest defense contractors to speed up weapons production by investing in new facilities and ending the practice of repurchasing stocks. “They want to buy back their stock—I don’t want them to buy back their stock,” Trump said, adding that he would make his case to top defense executives in Florida next week. Speaking at his Mar-a-Lago club in Palm Beach on Monday after announcing a new class of Navy battleships that will bear his name, Trump also criticized the high pay of executives at defense firms."},{"id":"6f0e7848-2ae2-33dd-b7f5-e8e73255c5ff","title":"RTX (RTX) Outpaces Stock Market Gains: What You Should Know","url":"https://finance.yahoo.com/news/rtx-rtx-outpaces-stock-market-225003873.html","publisher":"Zacks","publishedAt":"2025-12-22T22:50:03.000Z","relatedTickers":["^DJI","^GSPC","^IXIC"],"mainIdea":"RTX (RTX) Outpaces Stock Market Gains: What You Should Know","summary":"Zacks: RTX (RTX) Outpaces Stock Market Gains: What You Should Know. RTX (RTX) reached $185.68 at the closing of the latest trading day, reflecting a +2.02% change compared to its last close. Related tickers mentioned: ^DJI, ^GSPC, ^IXIC."},{"id":"9ce343f3-61fd-3c89-82cf-fe998c110d3e","title":"Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'","url":"https://finance.yahoo.com/m/9ce343f3-61fd-3c89-82cf-fe998c110d3e/stock-of-the-day-in-buy-zone.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-22T19:59:24.000Z","relatedTickers":["GE"],"mainIdea":"Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'","summary":"Investor's Business Daily: Stock Of The Day In Buy Zone With Business 'Firing On All Cylinders'. The company is sitting on a $251 billion backlog as military spending grows and commercial aviation provides another solid path to continued growth. Related tickers mentioned: GE."}]}
