{"symbol":"CMA","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:28.184Z","asOfDate":"2025-12-27","articles":[{"id":"4db43511-c33d-35f3-aaad-88bb7f5701e0","title":"Gleim Exam Prep Donates 60,000 Meals Through Feeding Families Campaign","url":"https://finance.yahoo.com/news/gleim-exam-prep-donates-60-183800405.html","publisher":"GlobeNewswire","publishedAt":"2025-12-26T18:38:00.000Z","relatedTickers":[],"mainIdea":"Gleim Exam Prep Donates 60,000 Meals Through Feeding Families Campaign","summary":"GlobeNewswire: Gleim Exam Prep Donates 60,000 Meals Through Feeding Families Campaign. Gleim continues its partnership with Bread of the Mighty Food Bank to support hunger relief. Teaming up to Fight Hunger Lorie M. Gleim, CEO Gleim Exam Prep and Patrick Dodds, Executive Director Bread of the Might Food Bank. 589lbs of Food Gleim employees contributed by donating hundreds of pounds of food. Gainesville, Fl., Dec. 26, 2025 (GLOBE NEWSWIRE) -- Gleim Exam Prep, the leading provider of accounting and aviation self-study materials, proudly announces its donation of 60,671 meals to Brea"},{"id":"43d71121-0017-3bd4-8835-6c6a6241b123","title":"Why 2026 Is Poised to Be Another Rocky Year for Global Trade","url":"https://finance.yahoo.com/news/why-2026-poised-another-rocky-100001535.html","publisher":"Bloomberg","publishedAt":"2025-12-24T10:00:01.000Z","relatedTickers":[],"mainIdea":"Why 2026 Is Poised to Be Another Rocky Year for Global Trade","summary":"Bloomberg: Why 2026 Is Poised to Be Another Rocky Year for Global Trade. Merchandise trade across the world held up relatively well through 2025, even as US President Donald Trump started erecting a tariff wall around the world’s largest economy. Data cited this week by shipping industry veteran John McCown show global container volumes grew 2.1% in October from a year earlier."},{"id":"8c45ca3b-d062-3236-b45b-bf30b8ccccd5","title":"Sportradar (SRAD) Q4 2024 Earnings Call Transcript","url":"https://finance.yahoo.com/m/8c45ca3b-d062-3236-b45b-bf30b8ccccd5/sportradar-%28srad%29-q4-2024.html","publisher":"Motley Fool","publishedAt":"2025-12-23T16:39:10.000Z","relatedTickers":["SRAD"],"mainIdea":"Sportradar (SRAD) Q4 2024 Earnings Call Transcript","summary":"Motley Fool: Sportradar (SRAD) Q4 2024 Earnings Call Transcript. Sports Content, Technology & Services also delivered strong results this past quarter with revenues of €60 million, increasing €11 million or 23% year-on-year, led by Marketing & Media Services growth of 22% and due primarily to the continued growth of our ads business as we saw a variety of sportsbooks investing in marketing campaigns during the fourth quarter. Similar to the full year, we had broad-based growth geographically during Q4, with the U.S. business increasing 41% and the rest of the world increasing 16% as we continue to outpace the sustained market growth across the globe. Related tickers mentioned: SRAD."}]}
