{"symbol":"CMA","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:58:21.970Z","asOfDate":"2025-12-23","articles":[{"id":"8c45ca3b-d062-3236-b45b-bf30b8ccccd5","title":"Sportradar (SRAD) Q4 2024 Earnings Call Transcript","url":"https://finance.yahoo.com/m/8c45ca3b-d062-3236-b45b-bf30b8ccccd5/sportradar-%28srad%29-q4-2024.html","publisher":"Motley Fool","publishedAt":"2025-12-23T16:39:10.000Z","relatedTickers":["SRAD"],"mainIdea":"Sportradar (SRAD) Q4 2024 Earnings Call Transcript","summary":"Motley Fool: Sportradar (SRAD) Q4 2024 Earnings Call Transcript. Sports Content, Technology & Services also delivered strong results this past quarter with revenues of €60 million, increasing €11 million or 23% year-on-year, led by Marketing & Media Services growth of 22% and due primarily to the continued growth of our ads business as we saw a variety of sportsbooks investing in marketing campaigns during the fourth quarter. Similar to the full year, we had broad-based growth geographically during Q4, with the U.S. business increasing 41% and the rest of the world increasing 16% as we continue to outpace the sustained market growth across the globe. Related tickers mentioned: SRAD."},{"id":"46a43405-3d21-32d4-b73b-670e0be653d0","title":"5 ways to get your business finances ready for the new year","url":"https://finance.yahoo.com/m/46a43405-3d21-32d4-b73b-670e0be653d0/5-ways-to-get-your-business.html","publisher":"Stacker","publishedAt":"2025-12-23T16:30:08.000Z","relatedTickers":[],"mainIdea":"5 ways to get your business finances ready for the new year","summary":"Stacker: 5 ways to get your business finances ready for the new year. Comerica reports 5 ways to prepare your business finances for the new year: review finances, update payroll, assess credit, strengthen security, and set goals."},{"id":"7d604b18-5c0a-3cb1-a971-8dce0503496a","title":"5 ways to get your business finances ready for the new year","url":"https://finance.yahoo.com/m/7d604b18-5c0a-3cb1-a971-8dce0503496a/5-ways-to-get-your-business.html","publisher":"Stacker","publishedAt":"2025-12-23T16:30:08.000Z","relatedTickers":[],"mainIdea":"5 ways to get your business finances ready for the new year","summary":"Stacker: 5 ways to get your business finances ready for the new year. Comerica reports 5 ways to prepare your business finances for the new year: review finances, update payroll, assess credit, strengthen security, and set goals."},{"id":"e0ceaf82-ac30-3dac-9fbe-8db6da83266c","title":"Wells Fargo alum tapped as Zions Bank’s next CEO","url":"https://finance.yahoo.com/m/e0ceaf82-ac30-3dac-9fbe-8db6da83266c/wells-fargo-alum-tapped-as.html","publisher":"Banking Dive","publishedAt":"2025-12-23T12:29:49.000Z","relatedTickers":[],"mainIdea":"Wells Fargo alum tapped as Zions Bank’s next CEO","summary":"Banking Dive: Wells Fargo alum tapped as Zions Bank’s next CEO. Nate Callister, the Salt Lake City-based lender’s executive director of commercial banking, will lead the bank after Paul Burdiss retires Dec. 31."},{"id":"2694e136-c3da-3ef5-a8e5-64f4eda6d320","title":"Ghana Sea and Coastal Water Transport Industry Report 2025: Annual Cargo Handled by Ghana's Tema and Takoradi Ports Has Continued to Increase with the Modernisation of Port Infrastructure","url":"https://finance.yahoo.com/news/ghana-sea-coastal-water-transport-114700124.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T11:47:00.000Z","relatedTickers":[],"mainIdea":"Ghana Sea and Coastal Water Transport Industry Report 2025: Annual Cargo Handled by Ghana's Tema and Takoradi Ports Has Continued to Increase with the Modernisation of Port Infrastructure","summary":"GlobeNewswire: Ghana Sea and Coastal Water Transport Industry Report 2025: Annual Cargo Handled by Ghana's Tema and Takoradi Ports Has Continued to Increase with the Modernisation of Port Infrastructure. The comprehensive report on Ghana's sea, coastal, and inland water transport examines major ports, cargo handling, and future development plans. Key challenges include inadequate infrastructure, high port fees, and safety concerns on Lake Volta. Opportunities arise from the new Keta port and digitalisation advancements. Despite regional competition, the expansion of Tema and Takoradi ports promotes Ghana as a trade hub. Noteworthy players include Volta Lake Transport Company and major subsidiari"},{"id":"08e335f2-04c6-33bf-baf2-70cd785323e1","title":"China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset","url":"https://finance.yahoo.com/news/china-weather-superpower-bid-takes-220000350.html","publisher":"Bloomberg","publishedAt":"2025-12-22T22:00:00.000Z","relatedTickers":[],"mainIdea":"China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset","summary":"Bloomberg: China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset. Europe’s ERA5 is considered the benchmark of climate data, providing details on a range of variables such as rainfall, temperature and wind, spanning more than eight decades. It has been the backbone of the AI revolution in weather forecasting so far, and some of the leading AI models in China, including from Huawei Technologies Co., are trained using the product. China also sees meteorological data as a key pillar of its weather ambitions and recently intensified efforts to develop and share “high-value data.”"},{"id":"77cfa389-4ce7-3cc2-9d07-5475f4494519","title":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","url":"https://finance.yahoo.com/m/77cfa389-4ce7-3cc2-9d07-5475f4494519/maersk%E2%80%99s-red-sea-test.html","publisher":"Sourcing Journal","publishedAt":"2025-12-22T21:14:19.000Z","relatedTickers":["AMKAF"],"mainIdea":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","summary":"Sourcing Journal: Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’. The carrier insists it is not committing to a timeline, but the voyage hints at gradual change after two years of Cape of Good Hope diversions. Related tickers mentioned: AMKAF."},{"id":"a2ae2839-bc74-3044-91ed-d3c3c11d21ed","title":"Zions Bancorporation Announces Leadership Changes at Zions Bank","url":"https://finance.yahoo.com/news/zions-bancorporation-announces-leadership-changes-211000382.html","publisher":"PR Newswire","publishedAt":"2025-12-22T21:10:00.000Z","relatedTickers":["ZION"],"mainIdea":"Zions Bancorporation Announces Leadership Changes at Zions Bank","summary":"PR Newswire: Zions Bancorporation Announces Leadership Changes at Zions Bank. Zions Bancorporation, N.A. today announced the upcoming retirement of Paul Burdiss, President and Chief Executive Officer of the Company's Zions Bank division, operating in Utah, Idaho and Wyoming, on December 31, 2025. Mr. Burdiss joined Zions Bancorporation in 2015 as its Executive Vice President and Chief Financial Officer, serving in that role until he assumed his current position with Zions Bank. During his more than 35-year career in the financial services industry, he also held positions Related tickers mentioned: ZION."}]}
