{"symbol":"CMA","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:09.189Z","asOfDate":"2025-12-22","articles":[{"id":"77cfa389-4ce7-3cc2-9d07-5475f4494519","title":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","url":"https://finance.yahoo.com/m/77cfa389-4ce7-3cc2-9d07-5475f4494519/maersk%E2%80%99s-red-sea-test.html","publisher":"Sourcing Journal","publishedAt":"2025-12-22T21:14:19.000Z","relatedTickers":["AMKAF"],"mainIdea":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","summary":"Sourcing Journal: Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’. The carrier insists it is not committing to a timeline, but the voyage hints at gradual change after two years of Cape of Good Hope diversions. Related tickers mentioned: AMKAF."},{"id":"a2ae2839-bc74-3044-91ed-d3c3c11d21ed","title":"Zions Bancorporation Announces Leadership Changes at Zions Bank","url":"https://finance.yahoo.com/news/zions-bancorporation-announces-leadership-changes-211000382.html","publisher":"PR Newswire","publishedAt":"2025-12-22T21:10:00.000Z","relatedTickers":["ZION"],"mainIdea":"Zions Bancorporation Announces Leadership Changes at Zions Bank","summary":"PR Newswire: Zions Bancorporation Announces Leadership Changes at Zions Bank. Zions Bancorporation, N.A. today announced the upcoming retirement of Paul Burdiss, President and Chief Executive Officer of the Company Related tickers mentioned: ZION."},{"id":"15912580-c83e-31f9-94f7-10c332ea047e","title":"Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus","url":"https://finance.yahoo.com/news/sky-harbour-group-announces-expansion-130400647.html","publisher":"Business Wire","publishedAt":"2025-12-22T13:04:00.000Z","relatedTickers":["SKYH"],"mainIdea":"Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus","summary":"Business Wire: Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus. WEST HARRISON, N.Y., December 22, 2025--Sky Harbour Group Corporation (NYSE: SKYH, SKYH WS) (\"SHG\" or the \"Company\") today announced that the Port Authority of New York and New Jersey (PANYNJ) has authorized the execution of a lease amendment to expand Sky Harbour’s development site at New York Stewart International Airport (SWF) from 16 acres to 26 acres. The expansion is expected to increase rentable hangar square footage by approximately 150,000 square feet and create a more efficient site la Related tickers mentioned: SKYH."}]}
