{"symbol":"CMA","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:54.312Z","asOfDate":"2025-12-23","articles":[{"id":"08e335f2-04c6-33bf-baf2-70cd785323e1","title":"China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset","url":"https://finance.yahoo.com/news/china-weather-superpower-bid-takes-220000350.html","publisher":"Bloomberg","publishedAt":"2025-12-22T22:00:00.000Z","relatedTickers":[],"mainIdea":"China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset","summary":"Bloomberg: China’s Weather Superpower Bid Takes Aim at Top AI Model Dataset. Europe’s ERA5 is considered the benchmark of climate data, providing details on a range of variables such as rainfall, temperature and wind, spanning more than eight decades. It has been the backbone of the AI revolution in weather forecasting so far, and some of the leading AI models in China, including from Huawei Technologies Co., are trained using the product. China also sees meteorological data as a key pillar of its weather ambitions and recently intensified efforts to develop and share “high-value data.”"},{"id":"77cfa389-4ce7-3cc2-9d07-5475f4494519","title":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","url":"https://finance.yahoo.com/m/77cfa389-4ce7-3cc2-9d07-5475f4494519/maersk%E2%80%99s-red-sea-test.html","publisher":"Sourcing Journal","publishedAt":"2025-12-22T21:14:19.000Z","relatedTickers":["AMKAF"],"mainIdea":"Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’","summary":"Sourcing Journal: Maersk’s Red Sea Test Potentially Sparks ‘A Gradual Normalization’. The carrier insists it is not committing to a timeline, but the voyage hints at gradual change after two years of Cape of Good Hope diversions. Related tickers mentioned: AMKAF."},{"id":"a2ae2839-bc74-3044-91ed-d3c3c11d21ed","title":"Zions Bancorporation Announces Leadership Changes at Zions Bank","url":"https://finance.yahoo.com/news/zions-bancorporation-announces-leadership-changes-211000382.html","publisher":"PR Newswire","publishedAt":"2025-12-22T21:10:00.000Z","relatedTickers":["ZION"],"mainIdea":"Zions Bancorporation Announces Leadership Changes at Zions Bank","summary":"PR Newswire: Zions Bancorporation Announces Leadership Changes at Zions Bank. Zions Bancorporation, N.A. today announced the upcoming retirement of Paul Burdiss, President and Chief Executive Officer of the Company's Zions Bank division, operating in Utah, Idaho and Wyoming, on December 31, 2025. Mr. Burdiss joined Zions Bancorporation in 2015 as its Executive Vice President and Chief Financial Officer, serving in that role until he assumed his current position with Zions Bank. During his more than 35-year career in the financial services industry, he also held positions Related tickers mentioned: ZION."}]}
