{"symbol":"UPS","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:52.286Z","asOfDate":"2025-12-24","articles":[{"id":"e746860e-b9ac-39d6-9d4c-b2bd0cee727a","title":"Best Overlooked Films of 2025","url":"https://finance.yahoo.com/m/e746860e-b9ac-39d6-9d4c-b2bd0cee727a/best-overlooked-films-of-2025.html","publisher":"Variety","publishedAt":"2025-12-24T17:30:00.000Z","relatedTickers":[],"mainIdea":"Best Overlooked Films of 2025","summary":"Variety: Best Overlooked Films of 2025. Every year, the awards gods decree that a certain group of films are the most noteworthy. Many of the same titles end up appearing on every list of critics association awards, guild nominations and Oscar projections. This means that dozens of other titles end up basically getting lost along the way, thanks to an all-too-brief …"},{"id":"d70f9024-9179-37f0-8631-31969d7b622c","title":"I retired early 5 years ago and this is the #1 biggest downside of my decision","url":"https://finance.yahoo.com/m/d70f9024-9179-37f0-8631-31969d7b622c/i-retired-early-5-years-ago.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-24T17:07:33.000Z","relatedTickers":[],"mainIdea":"I retired early 5 years ago and this is the #1 biggest downside of my decision","summary":"24/7 Wall St.: I retired early 5 years ago and this is the #1 biggest downside of my decision. Sometimes, our retirements fail to live up to the sky-high expectations we’ve set throughout a lengthy career. Undoubtedly, one’s golden years are supposed to be a time dedicated to traveling the world, having memorable experiences with friends and family, and taking out those items on the bucket list one by one. Still, the retirement lifestyle ... I retired early 5 years ago and this is the #1 biggest downside of my decision"},{"id":"58fadc2f-a16d-36d1-8ddf-bd47a028c4ba","title":"What's open on Christmas Eve in Southern California? Disneyland to Costco","url":"https://finance.yahoo.com/m/58fadc2f-a16d-36d1-8ddf-bd47a028c4ba/what%27s-open-on-christmas-eve.html","publisher":"USA TODAY","publishedAt":"2025-12-24T16:58:49.000Z","relatedTickers":[],"mainIdea":"What's open on Christmas Eve in Southern California? Disneyland to Costco","summary":"USA TODAY: What's open on Christmas Eve in Southern California? Disneyland to Costco. See until when you can score pastries from Porto's Bakery or shop at Ralph's. Here's our list of what's open, from banks to UPS and Walmart."},{"id":"fd7bc3fc-6b50-364c-bcc3-a8ba636ba161","title":"What The AYON Launch Means For Apyx Medical’s Evolving Story And Valuation","url":"https://finance.yahoo.com/news/ayon-launch-means-apyx-medical-051011260.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T05:10:11.000Z","relatedTickers":["APYX"],"mainIdea":"What The AYON Launch Means For Apyx Medical’s Evolving Story And Valuation","summary":"Simply Wall St.: What The AYON Launch Means For Apyx Medical’s Evolving Story And Valuation. Apyx Medical's latest narrative update keeps the fair value estimate steady at $6.00 per share, but fine tunes the underlying assumptions as analysts reassess risk and growth around the AYON platform. A slightly higher discount rate and marginally lower revenue growth outlook reflect a more measured stance on execution and competitive dynamics, even as confidence in AYON's long term potential remains intact. Stay tuned to learn how you can monitor these evolving assumptions and keep up with... Related tickers mentioned: APYX."},{"id":"1c8fae0f-2bd7-38eb-84aa-df2220b02e78","title":"What's open and closed on Christmas Eve 2025? Here's what to know","url":"https://finance.yahoo.com/m/1c8fae0f-2bd7-38eb-84aa-df2220b02e78/what%27s-open-and-closed-on.html","publisher":"USA TODAY","publishedAt":"2025-12-24T05:01:32.000Z","relatedTickers":[],"mainIdea":"What's open and closed on Christmas Eve 2025? Here's what to know","summary":"USA TODAY: What's open and closed on Christmas Eve 2025? Here's what to know. Here's an overview on what restaurants, grocery stores and retail stores will be open on Christmas Eve this year."},{"id":"2e6ebbd3-0303-37cd-8ef3-5c0923b3c48e","title":"Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.","url":"https://finance.yahoo.com/m/2e6ebbd3-0303-37cd-8ef3-5c0923b3c48e/is-the-stock-market-open.html","publisher":"Barrons.com","publishedAt":"2025-12-24T05:01:00.000Z","relatedTickers":["^IXIC"],"mainIdea":"Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.","summary":"Barrons.com: Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.. Here’s what investors should know about trading hours on Christmas Eve and Christmas Day. Is the Stock Market Open or Closed on Christmas Eve? President Donald Trump signed an executive order last week closing all executive departments and federal agencies on both Christmas Eve and Dec. 26 this year. Related tickers mentioned: ^IXIC."}]}
