{"symbol":"^VIX","provider":"yahoo-finance","fetchedAt":"2025-12-24T02:20:17.536Z","asOfDate":"2025-12-23","articles":[{"id":"b59da15e-e236-3012-ac35-bbe79bd3abe7","title":"The 120 Most Powerful Hollywood Studios and Executives, Ranked","url":"https://finance.yahoo.com/m/b59da15e-e236-3012-ac35-bbe79bd3abe7/the-120-most-powerful.html","publisher":"Variety","publishedAt":"2025-12-23T18:00:00.000Z","relatedTickers":[],"mainIdea":"The 120 Most Powerful Hollywood Studios and Executives, Ranked","summary":"Variety: The 120 Most Powerful Hollywood Studios and Executives, Ranked."},{"id":"e71f213e-344a-35a9-971e-f8b9c84a1741","title":"Technical strategist explains how S&P 500 could hit 7,300 in early 2026","url":"https://finance.yahoo.com/news/technical-strategist-explains-p-500-120724845.html","publisher":"Investing.com","publishedAt":"2025-12-23T12:07:24.000Z","relatedTickers":["^GSPC"],"mainIdea":"Technical strategist explains how S&P 500 could hit 7,300 in early 2026","summary":"Investing.com: Technical strategist explains how S&P 500 could hit 7,300 in early 2026. Investing.com -- The S&P 500 may be setting up for a breakout that carries the index toward 7,300 early next year, according to Wolfe Research technical strategists, who say recent market action is aligning with a bullish roadmap. Related tickers mentioned: ^GSPC."},{"id":"111691bd-3502-34a5-9828-e4e1a55b14ad","title":"Stock Market News for Dec 23, 2025","url":"https://finance.yahoo.com/news/stock-market-news-dec-23-103000908.html","publisher":"Zacks","publishedAt":"2025-12-23T10:30:00.000Z","relatedTickers":["GOOG","GOOGL","NVDA","XLK","XLU","^DJI","^GSPC","^IXIC"],"mainIdea":"Stock Market News for Dec 23, 2025","summary":"Zacks: Stock Market News for Dec 23, 2025. U.S. stock markets closed higher on Monday to start the Christmas week. Related tickers mentioned: GOOG, GOOGL, NVDA, XLK, XLU, ^DJI, ^GSPC, ^IXIC."},{"id":"310e67b1-2b98-3e89-919e-d5cbb04decb2","title":"Volatility Index Sinks to 12-Month Low","url":"https://finance.yahoo.com/m/310e67b1-2b98-3e89-919e-d5cbb04decb2/volatility-index-sinks-to.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-22T21:55:31.000Z","relatedTickers":[],"mainIdea":"Volatility Index Sinks to 12-Month Low","summary":"The Wall Street Journal: Volatility Index Sinks to 12-Month Low. The Cboe Volatility Index, also known as Wall Street’s fear gauge, fell 5.6% Monday to a 12-month low. The benchmark ended the day at 14.08, its lowest closing value since Dec. 13, 2024, according to Dow Jones Market Data."},{"id":"f134b17e-5f47-37f7-ad5c-4eba7b4b5cd7","title":"Stocks Advance Toward Records in Broad Rally","url":"https://finance.yahoo.com/m/f134b17e-5f47-37f7-ad5c-4eba7b4b5cd7/stocks-advance-toward-records.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-22T21:50:00.000Z","relatedTickers":["ADP","^DJI","^GSPC","^IXIC"],"mainIdea":"Stocks Advance Toward Records in Broad Rally","summary":"The Wall Street Journal: Stocks Advance Toward Records in Broad Rally. Stocks advanced broadly to start the holiday-shortened week, sending the S&P 500 to the brink of a record. Every sector except consumer staples closed higher, with financials, energy and materials leading the way. The S&P 500 added 0.6% to close within 0.3% of a record. Related tickers mentioned: ADP, ^DJI, ^GSPC, ^IXIC."},{"id":"8ed633a8-96cb-3c94-b604-e392885c43cd","title":"Market Digest: CCL, DIS, IP, PFE","url":"https://finance.yahoo.com/m/8ed633a8-96cb-3c94-b604-e392885c43cd/market-digest%3A-ccl%2C-dis%2C-ip%2C.html","publisher":"Argus Research","publishedAt":"2025-12-22T12:08:50.000Z","relatedTickers":["CCL","CUK","CUKPF","DIS","IP","PFE","WSFX.BO","^DJI","^GSPC","^IXIC"],"mainIdea":"Market Digest: CCL, DIS, IP, PFE","summary":"Argus Research: Market Digest: CCL, DIS, IP, PFE. Happy Holidays Wall Street is ready to put a wrap on trading for 2025, with this week shortened by the Christmas holiday, three days of '2025 trading' next week, and '2026 trading' starting with a likely very quiet session on Friday, January 2. Last week, the Dow Jones Industrial Average fell 1%, while the S&P 500 and the Nasdaq were flat. For the year to date, the Dow is up 13%, the S&P 500 has gained 16%, and the Nasdaq has popped 20%. On the economic calendar, there is one report of note this week. GDP for the third quarter has been delayed due to the government shutdown and finally will be reported on Tuesday. Turning to other data, the Atlanta Fed GDPNow measure forecasts 3.5% growth in the third quarter. That is a tick lower than last week's forecast. The Cleveland Fed Inflation Nowcast calls for a 2.6% rate in December, also lower than last week. Mortgage rates ticked down last week, with the average 30-year fixed-rate mortgage now at 6.21%, according to FreddieMac. Gas prices were down four cents and are now at an average of $2.90 per gallon for regular gas. Looking ahead, the next Federal Open Market Committee meeting is on January 28. After the latest jobs and CPI reports from last week, the odds for a 25-basis rate cut at this meeting are at 22%, according to the CME FedWatch rate tool. Taking a deeper dive into performance, U.S. stocks are lagging global stocks. A leading industrialized global stock market index, the ETF EFA, has surged 27% year to date, while the leading emerging market ETF EEM has gained 28%. U.S. growth stocks, with a year-to-date gain of 17% (ETF IWF), have taken the lead over value stocks (ETF IWD), which have booked an advance of 14%. In other asset classes for the year to date, AGG bonds are up 3%, gold is up 68%, crude oil is down 20%, and Bitcoin has fallen 6%. The U.S. dollar is down 9%, tracking DXY. The VIX Volatility Index settled Friday at about 15, down from a high of 26 in late November. Looking at leading and lagging sectors so far in 2025, Communication Services, (+31%) and Information Technology (+23%) are the top performers. The Industrials sector (+19%) is also ahead of the broader market, while Financials (+13%), Utilities (+12%) and Healthcare (+11%) are not too far behind. Defensive sectors like Materials (+7%), Consumer Discretionary (+6%), Energy (+6%), Consumer Staples (+3%), and Real Estate (+1%) are at the bottom of the performance list. Related tickers mentioned: CCL, CUK, CUKPF, DIS, IP, PFE, WSFX.BO, ^DJI, ^GSPC, ^IXIC."}]}
