{"symbol":"RIVN","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:04:06.582Z","asOfDate":"2025-12-23","articles":[{"id":"b336c905-ae2a-3d6d-b3e7-24d5442c7f16","title":"Rivian (RIVN) Valuation Revisited as R2 SUV, Autonomy and Custom Silicon Fuel Renewed Investor Optimism","url":"https://finance.yahoo.com/news/rivian-rivn-valuation-revisited-r2-151211247.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T15:12:11.000Z","relatedTickers":[],"mainIdea":"Rivian (RIVN) Valuation Revisited as R2 SUV, Autonomy and Custom Silicon Fuel Renewed Investor Optimism","summary":"Simply Wall St.: Rivian (RIVN) Valuation Revisited as R2 SUV, Autonomy and Custom Silicon Fuel Renewed Investor Optimism. Rivian Automotive (RIVN) shares have been riding a wave of optimism as investors focus on the upcoming R2 midsize SUV and the company’s push into custom silicon, autonomy, and broader AI driven software. See our latest analysis for Rivian Automotive. That excitement is showing up in the numbers, with a roughly 46 percent 30 day share price return and a 64 percent year to date share price return pushing Rivian to about $21.75, while its 1 year total shareholder return of around 58 percent..."},{"id":"f127cc35-1f2d-39ff-8d1c-81aa8e5bb1c7","title":"TSLA & RIVN Hit Fresh Highs: Which Stock Should You Pick for 2026?","url":"https://finance.yahoo.com/news/tsla-rivn-hit-fresh-highs-141900769.html","publisher":"Zacks","publishedAt":"2025-12-23T14:19:00.000Z","relatedTickers":["TSLA"],"mainIdea":"TSLA & RIVN Hit Fresh Highs: Which Stock Should You Pick for 2026?","summary":"Zacks: TSLA & RIVN Hit Fresh Highs: Which Stock Should You Pick for 2026?. TSLA and Rivian hit fresh highs as AI, robotaxis and autonomy fuel rallies. Let's see which stock offers the better risk-reward heading into 2026. Related tickers mentioned: TSLA."},{"id":"b7b35a15-fa1f-3a85-a104-173199d2f059","title":"The EV Stock That's Better Than Tesla","url":"https://finance.yahoo.com/m/b7b35a15-fa1f-3a85-a104-173199d2f059/the-ev-stock-that%27s-better.html","publisher":"Motley Fool","publishedAt":"2025-12-23T13:20:00.000Z","relatedTickers":["TSLA"],"mainIdea":"The EV Stock That's Better Than Tesla","summary":"Motley Fool: The EV Stock That's Better Than Tesla. Rivian's launch of its next-generation fleet in 2026 will determine if the company has what it takes to be a top EV company. Related tickers mentioned: TSLA."},{"id":"e9d897ab-1780-3c98-85b0-ceafb2189563","title":"PYPL, DJT, MU And More: 5 Stocks Investors Couldn't Stop Buzzing About This Week","url":"https://finance.yahoo.com/news/pypl-djt-mu-more-5-123052095.html","publisher":"Benzinga","publishedAt":"2025-12-23T12:30:52.000Z","relatedTickers":["MU","NKE","PYPL"],"mainIdea":"PYPL, DJT, MU And More: 5 Stocks Investors Couldn't Stop Buzzing About This Week","summary":"Benzinga: PYPL, DJT, MU And More: 5 Stocks Investors Couldn't Stop Buzzing About This Week. Retail investors talked up five hot stocks this week (Dec. 15 to Dec. 19) on X and Reddit's r/WallStreetBets, driven by earnings, retail hype, AI buzz, and corporate news flow. The stocks, PayPal Holdings Inc. (NASDAQ:PYPL), Trump Media & Technology Group Corp. (NASDAQ:DJT), Micron Technology Inc. (NASDAQ:MU), Rivian Automotive Inc. (NASDAQ:RIVN), and Nike Inc. (NYSE:NKE), spanning finance, crypto, semiconductors, AI, automotive, and sports, reflected diverse retail interests. Don't Miss: If the Related tickers mentioned: MU, NKE, PYPL."},{"id":"00a6fbae-19f3-320e-b183-6b5913aa4070","title":"Jim Cramer Shares Bearish Sentiment Toward Lucid Group","url":"https://finance.yahoo.com/news/jim-cramer-shares-bearish-sentiment-051619848.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T05:16:19.000Z","relatedTickers":["LCID"],"mainIdea":"Jim Cramer Shares Bearish Sentiment Toward Lucid Group","summary":"Insider Monkey: Jim Cramer Shares Bearish Sentiment Toward Lucid Group. Lucid Group, Inc. (NASDAQ:LCID) is one of the stocks Jim Cramer answered questions about. When a caller asked about the stock, Cramer was quick to comment, “I’ll give you my answer: [sell, sell, sell].” Lucid Group, Inc. (NASDAQ:LCID) develops and produces electric vehicles, powertrains, battery systems, and proprietary in-house software. When a caller asked whether […] Related tickers mentioned: LCID."},{"id":"d82f0ad7-7d32-3c67-82f2-16bedcb7b64b","title":"Nat-Gas Prices Fall on Warmer US Weather","url":"https://finance.yahoo.com/m/d82f0ad7-7d32-3c67-82f2-16bedcb7b64b/nat-gas-prices-fall-on-warmer.html","publisher":"Barchart","publishedAt":"2025-12-22T20:47:06.000Z","relatedTickers":["NG=F"],"mainIdea":"Nat-Gas Prices Fall on Warmer US Weather","summary":"Barchart: Nat-Gas Prices Fall on Warmer US Weather. January Nymex natural gas (NGF26 ) on Monday closed down -0.019 (-0.48%). Jan nat-gas prices fell on Monday amid warmer US weather, which will dampen heating demand for nat gas. Commodity Weather is forecasting above-normal temperatures for much of the US, with a possibility of colder weather in the Midwest,... Related tickers mentioned: NG=F."},{"id":"e0b9da98-ea56-33cf-b42d-c5e7b3fa4a3c","title":"Crude Oil Prices Higher on Oil Tanker Disruptions","url":"https://finance.yahoo.com/m/e0b9da98-ea56-33cf-b42d-c5e7b3fa4a3c/crude-oil-prices-higher-on.html","publisher":"Barchart","publishedAt":"2025-12-22T20:30:13.000Z","relatedTickers":["BKR","CL=F","RB=F"],"mainIdea":"Crude Oil Prices Higher on Oil Tanker Disruptions","summary":"Barchart: Crude Oil Prices Higher on Oil Tanker Disruptions. January WTI crude oil (CLF26) on Monday closed up +0.51 (+0.91%), and January RBOB gasoline (RBF26) closed up +0.0340 (+1.99%). Crude oil on Monday rallied on geopolitical risks in Venezuela and Ukraine-Russia. Other bullish factors included the weaker dollar and the stronger stock market. Crude prices had carry-over support from... Related tickers mentioned: BKR, CL=F, RB=F."}]}
