{"symbol":"RIVN","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:17.810Z","asOfDate":"2025-12-24","articles":[{"id":"c9d56c43-f0e2-3ab7-a0ee-a19950ee8cb5","title":"This Contrarian Play Could Be Your Best Investment of 2026","url":"https://finance.yahoo.com/m/c9d56c43-f0e2-3ab7-a0ee-a19950ee8cb5/this-contrarian-play-could-be.html","publisher":"Motley Fool","publishedAt":"2025-12-24T17:05:00.000Z","relatedTickers":[],"mainIdea":"This Contrarian Play Could Be Your Best Investment of 2026","summary":"Motley Fool: This Contrarian Play Could Be Your Best Investment of 2026. Rivian appears to be an attractive contrarian pick for 2026, given its strong financials, robust balance sheet, and mass market catalyst."},{"id":"b831c2f0-ff23-3f34-be23-529561101869","title":"Rivian Stock: The EV Recovery Play to Watch","url":"https://finance.yahoo.com/m/b831c2f0-ff23-3f34-be23-529561101869/rivian-stock%3A-the-ev-recovery.html","publisher":"Motley Fool","publishedAt":"2025-12-24T13:58:00.000Z","relatedTickers":[],"mainIdea":"Rivian Stock: The EV Recovery Play to Watch","summary":"Motley Fool: Rivian Stock: The EV Recovery Play to Watch. Rivian's stock has soared over the last four weeks, but its true test will be the release of its upcoming SUV."},{"id":"1eae5df0-168e-3859-9c38-3d849cfa83e6","title":"Rivian Automotive (NASDAQ: RIVN) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24)","url":"https://finance.yahoo.com/m/1eae5df0-168e-3859-9c38-3d849cfa83e6/rivian-automotive-%28nasdaq%3A.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-24T13:15:06.000Z","relatedTickers":["^GSPC"],"mainIdea":"Rivian Automotive (NASDAQ: RIVN) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24)","summary":"24/7 Wall St.: Rivian Automotive (NASDAQ: RIVN) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24). Rivian stock had been trending upward recently despite facing challenges. Here is a look at where the stock could be in a year. Related tickers mentioned: ^GSPC."},{"id":"9c229d25-3b5d-3d4e-84c2-a1e73ed44a77","title":"Wedbush Lifts Rivian (RIVN) Price Target Ahead of R2 Launch","url":"https://finance.yahoo.com/news/wedbush-lifts-rivian-rivn-price-075639507.html","publisher":"Insider Monkey","publishedAt":"2025-12-24T07:56:39.000Z","relatedTickers":[],"mainIdea":"Wedbush Lifts Rivian (RIVN) Price Target Ahead of R2 Launch","summary":"Insider Monkey: Wedbush Lifts Rivian (RIVN) Price Target Ahead of R2 Launch. Rivian Automotive, Inc. (NASDAQ:RIVN) is one of the AI Stocks Making Waves on Wall Street. On December 19, Wedbush reiterated the stock as “Outperform” and raised its price target to $25.00 (from $16.00). The firm is optimistic on Rivian ahead of the R2 launch in 1H26, autonomy progress, and cost discipline despite tariff headwinds. “We […]"},{"id":"77539e7d-fabc-377e-a3ef-4083871e500f","title":"Why Rivian Automotive (RIVN) Is Up 16.3% After Unveiling Its Autonomy Chip And Subscription Strategy","url":"https://finance.yahoo.com/news/why-rivian-automotive-rivn-16-210843239.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T21:08:43.000Z","relatedTickers":[],"mainIdea":"Why Rivian Automotive (RIVN) Is Up 16.3% After Unveiling Its Autonomy Chip And Subscription Strategy","summary":"Simply Wall St.: Why Rivian Automotive (RIVN) Is Up 16.3% After Unveiling Its Autonomy Chip And Subscription Strategy. In December 2025, Rivian held its first Autonomy & AI Day, unveiling an in-house 5nm autonomy processor, a new AI-driven software architecture, and future integration of LiDAR and paid driver-assistance features, while also confirming plans for these systems to debut on its upcoming R2 midsize SUV platform from late 2026. A separate December announcement that board member Rose Marcario will step down in early 2026 while remaining chair of the Rivian Foundation highlights Rivian’s tighter..."},{"id":"ca6e7b66-583a-3e52-9ae9-fdb80bd39236","title":"Nat-Gas Prices Soar on Incoming Cold Weather","url":"https://finance.yahoo.com/m/ca6e7b66-583a-3e52-9ae9-fdb80bd39236/nat-gas-prices-soar-on.html","publisher":"Barchart","publishedAt":"2025-12-23T20:55:37.000Z","relatedTickers":["NG=F"],"mainIdea":"Nat-Gas Prices Soar on Incoming Cold Weather","summary":"Barchart: Nat-Gas Prices Soar on Incoming Cold Weather. January Nymex natural gas (NGF26) on Tuesday closed up +0.443 (+11.17%). Jan nat-gas prices on Tuesday soared on heavy short-covering pressure after the plunge seen in mid-December. Tuesday's rally was sparked by colder forecasts for the East Coast. Xweather forecasted that a storm system will bring cold temperatures through the... Related tickers mentioned: NG=F."}]}
