{"symbol":"DAL","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:09.868Z","asOfDate":"2025-12-22","articles":[{"id":"57b8b725-159f-33d3-94dc-926978855cb4","title":"The Zacks Analyst Blog Highlights Kraft Heinz, Delta Air Lines, FedEx, United Natural Foods and LATAM Airlines","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-kraft-145200273.html","publisher":"Zacks","publishedAt":"2025-12-22T14:52:00.000Z","relatedTickers":["FDX","KHC","LTM","UNFI"],"mainIdea":"The Zacks Analyst Blog Highlights Kraft Heinz, Delta Air Lines, FedEx, United Natural Foods and LATAM Airlines","summary":"Zacks: The Zacks Analyst Blog Highlights Kraft Heinz, Delta Air Lines, FedEx, United Natural Foods and LATAM Airlines. Easing inflation is setting the stage for margin recovery across consumer staples, logistics and airlines heading into 2026. Related tickers mentioned: FDX, KHC, LTM, UNFI."},{"id":"15912580-c83e-31f9-94f7-10c332ea047e","title":"Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus","url":"https://finance.yahoo.com/news/sky-harbour-group-announces-expansion-130400647.html","publisher":"Business Wire","publishedAt":"2025-12-22T13:04:00.000Z","relatedTickers":["SKYH"],"mainIdea":"Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus","summary":"Business Wire: Sky Harbour Group Announces an Expansion to its Future New York Stewart International Airport Hangar Campus. WEST HARRISON, N.Y., December 22, 2025--Sky Harbour Group Corporation (NYSE: SKYH, SKYH WS) (\"SHG\" or the \"Company\") today announced that the Port Authority of New York and New Jersey (PANYNJ) has authorized the execution of a lease amendment to expand Sky Harbour’s development site at New York Stewart International Airport (SWF) from 16 acres to 26 acres. The expansion is expected to increase rentable hangar square footage by approximately 150,000 square feet and create a more efficient site la Related tickers mentioned: SKYH."},{"id":"2dc599a5-4197-36fb-8ce5-849680be2ea5","title":"The SpaceX Explosion That Put Flights in Danger","url":"https://finance.yahoo.com/m/2dc599a5-4197-36fb-8ce5-849680be2ea5/the-spacex-explosion-that-put.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-21T14:17:00.000Z","relatedTickers":["JBLU"],"mainIdea":"The SpaceX Explosion That Put Flights in Danger","summary":"The Wall Street Journal: The SpaceX Explosion That Put Flights in Danger. FAA documents reviewed by The Wall Street Journal show an explosion of SpaceX’s Starship on Jan. 16 posed a greater danger to planes in the air over the Caribbean than was publicly known. Related tickers mentioned: JBLU."}]}
