{"symbol":"DAL","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:30.008Z","asOfDate":"2025-12-27","articles":[{"id":"beb5e779-43f5-316d-9c62-18e73bc98d9f","title":"Airline Delays and Cancellations Linger After New York-Area Snowstorm","url":"https://finance.yahoo.com/m/beb5e779-43f5-316d-9c62-18e73bc98d9f/airline-delays-and.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-27T16:02:00.000Z","relatedTickers":["JBLU"],"mainIdea":"Airline Delays and Cancellations Linger After New York-Area Snowstorm","summary":"The Wall Street Journal: Airline Delays and Cancellations Linger After New York-Area Snowstorm. More than 400 flights to or from New York-area airports were canceled Saturday, disrupting the postholiday travel surge. Related tickers mentioned: JBLU."},{"id":"f3451938-5c15-3bfb-a129-398162a64a43","title":"Airlines Cancel More Than 1,800 US Flights Due to Adverse Weather","url":"https://finance.yahoo.com/news/airlines-cancel-more-1-800-212145341.html","publisher":"MT Newswires","publishedAt":"2025-12-26T21:21:45.000Z","relatedTickers":["JBLU"],"mainIdea":"Airlines Cancel More Than 1,800 US Flights Due to Adverse Weather","summary":"MT Newswires: Airlines Cancel More Than 1,800 US Flights Due to Adverse Weather. Airlines canceled more than 1,800 flights in the US of Friday due to adverse winter weather, disrupt Related tickers mentioned: JBLU."},{"id":"729598a2-c76f-30ac-be92-e7d28d038a3d","title":"Flights Canceled, Roads Closed as Storms Snarl US Travel","url":"https://finance.yahoo.com/news/flights-canceled-roads-closed-storms-183622165.html","publisher":"Bloomberg","publishedAt":"2025-12-26T20:57:10.000Z","relatedTickers":["JBLU"],"mainIdea":"Flights Canceled, Roads Closed as Storms Snarl US Travel","summary":"Bloomberg: Flights Canceled, Roads Closed as Storms Snarl US Travel. More than 1,600 flights across the US had been canceled as of Friday afternoon, according to the FlightAware website. JetBlue Airways Corp. was the carrier with the most cancellations on Friday, with more than 200, according to FlightAware. New York City’s three major airports – LaGuardia, JFK, and Newark — were hit hard by the disruptions, with as much as 9 inches (23 centimeters) of snow forecast for the areas. Related tickers mentioned: JBLU."}]}
