{"symbol":"UNH","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:51:36.135Z","asOfDate":"2025-12-23","articles":[{"id":"3f47f126-fe64-30c0-bed1-0210fec1a18f","title":"How UnitedHealth Became the Worst Dow Stock of 2025","url":"https://finance.yahoo.com/news/unitedhealth-became-worst-dow-stock-202530015.html","publisher":"Schaeffer's Investment Research","publishedAt":"2025-12-23T20:25:30.000Z","relatedTickers":["^DJI"],"mainIdea":"How UnitedHealth Became the Worst Dow Stock of 2025","summary":"Schaeffer's Investment Research: How UnitedHealth Became the Worst Dow Stock of 2025. The insurance giant was the worst performer on the Dow this year Related tickers mentioned: ^DJI."},{"id":"2128f6ef-c574-35d9-82f8-1a416514c92f","title":"eHealth's Guidance Update: Here's What a Strong AEP Signals","url":"https://finance.yahoo.com/news/ehealths-guidance-heres-strong-aep-140800066.html","publisher":"Zacks","publishedAt":"2025-12-23T14:08:00.000Z","relatedTickers":["CNC","EHTH"],"mainIdea":"eHealth's Guidance Update: Here's What a Strong AEP Signals","summary":"Zacks: eHealth's Guidance Update: Here's What a Strong AEP Signals. EHTH raises its 2025 outlook after a steady AEP, lifting revenue and EBITDA forecasts as Medicare performance and efficiency improve. Related tickers mentioned: CNC, EHTH."},{"id":"40dda6cb-b893-3dbe-a4fb-d068a1f29a3e","title":"ServiceNow to buy Armis for $7.75 billion as AI-fueled cyber risks surge","url":"https://finance.yahoo.com/news/servicenow-buy-cybersecurity-startup-armis-140430631.html","publisher":"Reuters","publishedAt":"2025-12-23T14:04:30.000Z","relatedTickers":["GOOG","MSFT","NOW"],"mainIdea":"ServiceNow to buy Armis for $7.75 billion as AI-fueled cyber risks surge","summary":"Reuters: ServiceNow to buy Armis for $7.75 billion as AI-fueled cyber risks surge. ServiceNow on Tuesday agreed to buy cybersecurity startup Armis for $7.75 billion, in the ​enterprise software maker's biggest-ever deal, as it bolsters its services ‌to help counter rising cyberattacks driven by AI adoption. Through the deal, the company aims to ‌integrate Alphabet-backed Armis' security features such as device scanning and threat detection, a crucial advantage amid sophisticated cyberattacks that have hit companies ranging from Microsoft to UnitedHealth Group. However, ServiceNow's shares fell about 3%, as investors worried over the ⁠company's recent splurge on ‌acquisitions. Related tickers mentioned: GOOG, MSFT, NOW."},{"id":"69a3fc90-5c9a-3f39-ba20-b0a55ac4346e","title":"Dogs of the Dow Enhanced Income Strategy with Covered Calls","url":"https://finance.yahoo.com/m/69a3fc90-5c9a-3f39-ba20-b0a55ac4346e/dogs-of-the-dow-enhanced.html","publisher":"Barchart","publishedAt":"2025-12-23T12:00:02.000Z","relatedTickers":["^DJI"],"mainIdea":"Dogs of the Dow Enhanced Income Strategy with Covered Calls","summary":"Barchart: Dogs of the Dow Enhanced Income Strategy with Covered Calls. The Dogs of the Dow has long been a simple, rules-based approach to equity investing, built around owning the highest-yielding stocks in the Dow Jones Industrial Average. Each year, investors rotate into the 10 Dow components with the highest dividend yields, based on the assumption that these stocks are temporarily out of favor and may rebound over time. Related tickers mentioned: ^DJI."},{"id":"7a6a2b2e-99b5-3c11-9019-c9dc6f426d1b","title":"Should You Invest in the iShares U.S. Healthcare Providers ETF (IHF)?","url":"https://finance.yahoo.com/news/invest-ishares-u-healthcare-providers-112003320.html","publisher":"Zacks","publishedAt":"2025-12-23T11:20:03.000Z","relatedTickers":["BLK","IHF"],"mainIdea":"Should You Invest in the iShares U.S. Healthcare Providers ETF (IHF)?","summary":"Zacks: Should You Invest in the iShares U.S. Healthcare Providers ETF (IHF)?. Sector ETF report for IHF Related tickers mentioned: BLK, IHF."},{"id":"2bf675a6-b737-3235-9c26-642b6916be6c","title":"12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back","url":"https://finance.yahoo.com/m/2bf675a6-b737-3235-9c26-642b6916be6c/12-stocks-that-dropped-after.html","publisher":"Barrons.com","publishedAt":"2025-12-22T18:55:00.000Z","relatedTickers":["CARR","CMCSA","CMCSV","MSTR","STRC","STRD","STRF","STRK"],"mainIdea":"12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back","summary":"Barrons.com: 12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back. The sale of underperforming assets to lessen stockholders’ tax burden can render some stocks undervalued. An Evercore screen can help you find names that can bounce back. Related tickers mentioned: CARR, CMCSA, CMCSV, MSTR, STRC, STRD, STRF, STRK."},{"id":"7072afdb-87b3-3d17-91c6-a4365fbf7f74","title":"BrainsWay Reports Expansion of Adolescent Depression Coverage Applicable to Deep TMS™","url":"https://finance.yahoo.com/news/brainsway-reports-expansion-adolescent-depression-123000653.html","publisher":"GlobeNewswire","publishedAt":"2025-12-22T12:30:00.000Z","relatedTickers":["BRSYF","BWAY"],"mainIdea":"BrainsWay Reports Expansion of Adolescent Depression Coverage Applicable to Deep TMS™","summary":"GlobeNewswire: BrainsWay Reports Expansion of Adolescent Depression Coverage Applicable to Deep TMS™. Optum Behavioral Health, a Health Services Company with Over 48 Million Covered Lives, Joins Growing List of Insurers Now Covering Deep TMS Depression Therapy for Adolescents Aged 15 and OlderBURLINGTON, Mass. and JERUSALEM, Dec. 22, 2025 (GLOBE NEWSWIRE) -- BrainsWay Ltd. (NASDAQ & TASE: BWAY) (“BrainsWay” or the “Company”), a global leader in advanced noninvasive brain stimulation technologies, today announced that Optum Behavioral Health, a leading health services company with over 48 million Related tickers mentioned: BRSYF, BWAY."},{"id":"fd3ed498-0d2d-36df-9545-a777c8a6e026","title":"Weekly Stock List","url":"https://finance.yahoo.com/m/fd3ed498-0d2d-36df-9545-a777c8a6e026/weekly-stock-list.html","publisher":"Argus Research","publishedAt":"2025-12-22T12:18:29.000Z","relatedTickers":["APTV","CAH","CVS","DRI","EXPE","FDX","GD","JBL","KDP","MCHP","MCHPP","MDT","MRNA","PH","PLTR","PYPL","RCL","RTX","TPR"],"mainIdea":"Weekly Stock List","summary":"Argus Research: Weekly Stock List. Third-quarter earnings season is over, and a hefty number of companies across sectors raised guidance. In fact, so many took that action that we are running this list for a second time in recent months. We view management's ability to raise guidance as a catalyst for market-beating returns in the quarters ahead, and note that raising guidance during uncertain economic times, when vision is murky, is especially difficult. The following is a partial list of companies in the Argus Fundamental Universe of Coverage at which management increased its outlook during the recent reporting season. The notable sector imbalance in our list is partially due to when sectors report in the earnings cycle. For example, Financials report early and, as such, were heavily represented in the first list we produced in late October. \"Management Signals\" is one of our Investment Themes as we close out 2025, and we continue to like this theme as it crosses numerous industries and generates a robust list of potential portfolio candidates. Related tickers mentioned: APTV, CAH, CVS, DRI, EXPE, FDX, GD, JBL, KDP, MCHP, MCHPP, MDT, MRNA, PH, PLTR, PYPL, RCL, RTX, TPR."}]}
