{"symbol":"NOC","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:50.431Z","asOfDate":"2025-12-23","articles":[{"id":"2df14432-becb-3e95-84a0-d44a731eff4f","title":"Analyst Report: The Boeing Company","url":"https://finance.yahoo.com/m/2df14432-becb-3e95-84a0-d44a731eff4f/analyst-report%3A-the-boeing.html","publisher":"Morningstar Research","publishedAt":"2025-12-23T00:58:48.000Z","relatedTickers":["BA","EADSF","LMT"],"mainIdea":"Analyst Report: The Boeing Company","summary":"Morningstar Research: Analyst Report: The Boeing Company. Boeing is a major aerospace and defense firm operating in three segments: commercial airplanes; defense, space, and security; and global services. Boeing's commercial airplanes segment competes with Airbus in the production of aircraft that can carry more than 130 passengers. Boeing's defense, space, and security segment competes with defense contractors such as Lockheed Martin and Northrop Grumman to create military aircraft, satellites, and weaponry. Global services provides aftermarket support to airlines. Related tickers mentioned: BA, EADSF, LMT."},{"id":"d62c73d6-9202-394c-bd2e-4a23bc12a203","title":"Trump to Host Defense Firms to Urge Less Spending on Buybacks","url":"https://finance.yahoo.com/news/trump-host-defense-firms-urge-224100971.html","publisher":"Bloomberg","publishedAt":"2025-12-22T22:41:00.000Z","relatedTickers":["LMT"],"mainIdea":"Trump to Host Defense Firms to Urge Less Spending on Buybacks","summary":"Bloomberg: Trump to Host Defense Firms to Urge Less Spending on Buybacks. “We make the best equipment in the world but they don’t make them fast enough,” Trump said. “We don’t want to have executives making $50 million a year issuing big dividends to everybody and also doing buybacks and also saying we don’t have the money to build a plant.” The plan for the meeting comes after people familiar with the matter said Trump could sign a new executive order clamping down on buybacks and dividends by top defense companies. Related tickers mentioned: LMT."},{"id":"457d99ea-8db0-3712-a5ec-61b84398cc52","title":"Rocket Lab Price Target Hiked, Launches To Expand Next Year","url":"https://finance.yahoo.com/m/457d99ea-8db0-3712-a5ec-61b84398cc52/rocket-lab-price-target.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-22T21:56:32.000Z","relatedTickers":["LMT","RKLB"],"mainIdea":"Rocket Lab Price Target Hiked, Launches To Expand Next Year","summary":"Investor's Business Daily: Rocket Lab Price Target Hiked, Launches To Expand Next Year. Stifel raises its price target on RKLB stock after defense satellite award. Rocket Lab completes 21st Electron launch of 2025. Related tickers mentioned: LMT, RKLB."}]}
