{"symbol":"TSLA","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:27:31.367Z","asOfDate":"2025-12-25","articles":[{"id":"2a84a1c7-0ba8-3d4a-bc82-2f26f3ccd2d1","title":"Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'","url":"https://finance.yahoo.com/m/2a84a1c7-0ba8-3d4a-bc82-2f26f3ccd2d1/trump-says-he%27s-hosting-the.html","publisher":"Benzinga","publishedAt":"2025-12-25T22:30:13.000Z","relatedTickers":[],"mainIdea":"Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'","summary":"Benzinga: Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'. On Tuesday, President Donald Trump confirmed he is serving as “Master of Ceremony” for this year's Kennedy Center Honors ahead of the televised broadcast. Trump Jokes About Life After The White House Trump made the remarks in a post on Truth Social ahead of the televised broadcast of the Kennedy Center Honors, which he hosted earlier this month and is set to air Tuesday night on Paramount Skydance Corp's (NASDAQ:PSKY) CBS and Paramount+. At the urging of the board and what he described as widesp"},{"id":"7ba28950-1ade-313b-9293-5bcf38f0673a","title":"Scott Bessent Says Private Economy 'Booming' Under Trump: 'This Is The Exact Opposite Of What Happened Under Biden'","url":"https://finance.yahoo.com/news/scott-bessent-says-private-economy-213106072.html","publisher":"Benzinga","publishedAt":"2025-12-25T21:31:06.000Z","relatedTickers":[],"mainIdea":"Scott Bessent Says Private Economy 'Booming' Under Trump: 'This Is The Exact Opposite Of What Happened Under Biden'","summary":"Benzinga: Scott Bessent Says Private Economy 'Booming' Under Trump: 'This Is The Exact Opposite Of What Happened Under Biden'. Treasury Secretary Scott Bessent said the U.S. private economy is accelerating sharply under President Donald Trump, pointing to a strong expansion in real economic output that excludes government activity. Private Economy ‘Booming Under Trump On Tuesday, in a post on X, Bessent said, “the private economy is booming under” Trump, while noting that GDP growth excluding government activity “is up 4.7% at an annualized rate over the last two quarters.” Bessent described this as being the “the exact"},{"id":"84a10aec-5e57-3010-bd1d-88199514dae6","title":"5 Beloved Stocks on Wall Street I'd Sell Right Now","url":"https://finance.yahoo.com/m/84a10aec-5e57-3010-bd1d-88199514dae6/5-beloved-stocks-on-wall.html","publisher":"Motley Fool","publishedAt":"2025-12-25T09:11:00.000Z","relatedTickers":["^DJI"],"mainIdea":"5 Beloved Stocks on Wall Street I'd Sell Right Now","summary":"Motley Fool: 5 Beloved Stocks on Wall Street I'd Sell Right Now. Some of the most popular stocks on Wall Street may have a challenging path forward in the new year. Related tickers mentioned: ^DJI."},{"id":"12aeb837-7823-350f-8402-867d447a3dfa","title":"Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike","url":"https://finance.yahoo.com/news/deutsche-bank-analysis-q4-2025-081334228.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:13:34.000Z","relatedTickers":["TFC"],"mainIdea":"Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike","summary":"Insider Monkey: Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike. Tesla Inc. (NASDAQ:TSLA) is one of the best high volume stocks to buy right now. On December 19, Deutsche Bank raised the firm’s price target on Tesla to $500 from $470 with a Buy rating on the shares. This upward adjustment was driven by the firm’s latest analysis of Tesla’s Q4 2025 delivery performance. On […] Related tickers mentioned: TFC."},{"id":"bb9d1abe-9ed0-3528-a225-3c5824a7df4c","title":"12 Days of Christmas? 12 Stocks That Are Gifts for 2026.","url":"https://finance.yahoo.com/m/bb9d1abe-9ed0-3528-a225-3c5824a7df4c/12-days-of-christmas%3F-12.html","publisher":"Barrons.com","publishedAt":"2025-12-25T07:00:00.000Z","relatedTickers":["ALK","AMZN","MSFT","NVDA"],"mainIdea":"12 Days of Christmas? 12 Stocks That Are Gifts for 2026.","summary":"Barrons.com: 12 Days of Christmas? 12 Stocks That Are Gifts for 2026.. Barron’s looked at the group of stocks and used Wall Street ratings and price targets by sector to find presents for any type of investor. Nvidia Amazon, and Microsoft shares are loved by the Street, with a Buy rating from more than 90% of the analysts covering them. The average Buy-rating ratio for stocks in the Russell 1000 is currently about 58%. Related tickers mentioned: ALK, AMZN, MSFT, NVDA."}]}
