{"symbol":"TSLA","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:10.555Z","asOfDate":"2025-12-22","articles":[{"id":"a3e8a40a-b898-30e8-bca5-b5af8251509a","title":"Tesla Stock Poised for Even More Record Highs","url":"https://finance.yahoo.com/news/tesla-stock-poised-even-more-203500080.html","publisher":"Schaeffer's Investment Research","publishedAt":"2025-12-22T20:35:00.000Z","relatedTickers":["GOOG"],"mainIdea":"Tesla Stock Poised for Even More Record Highs","summary":"Schaeffer's Investment Research: Tesla Stock Poised for Even More Record Highs. TSLA tends to outperform in December Related tickers mentioned: GOOG."},{"id":"dabb3666-8340-3e4b-bf0c-d77f91b818b1","title":"Why Tesla (TSLA) Stock Is Trading Up Today","url":"https://finance.yahoo.com/news/why-tesla-tsla-stock-trading-200129327.html","publisher":"StockStory","publishedAt":"2025-12-22T20:01:29.000Z","relatedTickers":[],"mainIdea":"Why Tesla (TSLA) Stock Is Trading Up Today","summary":"StockStory: Why Tesla (TSLA) Stock Is Trading Up Today. Shares of electric vehicle pioneer Tesla (NASDAQ:TSLA) jumped 2.8% in the afternoon session after a Delaware Supreme Court ruling restored CEO Elon Musk"},{"id":"ef6bcbf7-be6b-35cb-995e-783de55a78b2","title":"Bill Ackman Proposes Elon Musk's SpaceX IPO Through SPARC Structure, Offering Tesla Shareholders Priority Access","url":"https://finance.yahoo.com/news/bill-ackman-proposes-elon-musks-193012345.html","publisher":"Benzinga","publishedAt":"2025-12-22T19:30:12.000Z","relatedTickers":["XAAI.PVT"],"mainIdea":"Bill Ackman Proposes Elon Musk's SpaceX IPO Through SPARC Structure, Offering Tesla Shareholders Priority Access","summary":"Benzinga: Bill Ackman Proposes Elon Musk's SpaceX IPO Through SPARC Structure, Offering Tesla Shareholders Priority Access. Billionaire investor Bill Ackman on Saturday proposed merging SpaceX with Pershing Square SPARC Holdings, a special purpose acquisition rights vehicle created by his firm, Pershing Square Capital Management, that would give Tesla Inc. (NASDAQ:TSLA) shareholders priority access to invest in SpaceX. In a post on X, Ackman said the structure would distribute special purpose acquisition rights, or SPARs, to Tesla shareholders, allowing them to invest directly in SpaceX or receive cash for their righ Related tickers mentioned: XAAI.PVT."}]}
