{"symbol":"MS","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:07.560Z","asOfDate":"2025-12-27","articles":[{"id":"a08ea18d-a401-32fb-a404-eb299b3e32d6","title":"Morgan Stanley (NYSE:MS) is a favorite amongst institutional investors who own 62%","url":"https://finance.yahoo.com/news/morgan-stanley-nyse-ms-favorite-120017102.html","publisher":"Simply Wall St.","publishedAt":"2025-12-27T12:00:17.000Z","relatedTickers":["MS-PQ"],"mainIdea":"Morgan Stanley (NYSE:MS) is a favorite amongst institutional investors who own 62%","summary":"Simply Wall St.: Morgan Stanley (NYSE:MS) is a favorite amongst institutional investors who own 62%. Key Insights Institutions' substantial holdings in Morgan Stanley implies that they have significant influence over the... Related tickers mentioned: MS-PQ."},{"id":"19b07fc3-2537-3887-8315-3921871cdea7","title":"Tariff Costs Passed to Consumers Through Price Hikes in Third Quarter, Morgan Stanley Says","url":"https://finance.yahoo.com/news/tariff-costs-passed-consumers-price-161908963.html","publisher":"MT Newswires","publishedAt":"2025-12-26T16:19:08.000Z","relatedTickers":[],"mainIdea":"Tariff Costs Passed to Consumers Through Price Hikes in Third Quarter, Morgan Stanley Says","summary":"MT Newswires: Tariff Costs Passed to Consumers Through Price Hikes in Third Quarter, Morgan Stanley Says. US companies passed tariff costs to consumers in the third quarter by raising output prices, avoidin"},{"id":"5824fa0a-b4ed-37d6-9039-958ce8f0e8ea","title":"Private credit risks: What to make of Oracle's debt, AI trade","url":"https://finance.yahoo.com/video/private-credit-risks-oracles-debt-113052437.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-26T11:30:52.000Z","relatedTickers":["BAC","C","GS","JPM","MS-PQ","ORCL","WFC","XLF"],"mainIdea":"Private credit risks: What to make of Oracle's debt, AI trade","summary":"Yahoo Finance Video: Private credit risks: What to make of Oracle's debt, AI trade. TPW Advisory founder Jay Pelosky and Whalen Global Advisors founder and chairman Chris Whalen come on Market Catalysts to discuss the credit risks materializing in the AI trade and Magnificent Seven tech names, most notably Oracle's (ORCL) growing debt amid concerns of an AI bubble risk. Also catch Jay Pelosky and Chris Whalen share their insights into the banking sector heading into 2026, the next phase in the commodities super cycle, and forecasts on non-US equities. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, C, GS, JPM, MS-PQ, ORCL, WFC, XLF."}]}
