{"symbol":"MS","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:08:07.057Z","asOfDate":"2025-12-23","articles":[{"id":"ae37b87e-f378-3630-bfdd-eaa52f5fc8cd","title":"This popular stock is +108% YTD. Morgan Stanley says more gains to come in 2026","url":"https://finance.yahoo.com/news/popular-stock-108-ytd-morgan-140511975.html","publisher":"Investing.com","publishedAt":"2025-12-23T14:05:11.000Z","relatedTickers":["SSNLF"],"mainIdea":"This popular stock is +108% YTD. Morgan Stanley says more gains to come in 2026","summary":"Investing.com: This popular stock is +108% YTD. Morgan Stanley says more gains to come in 2026. Investing.com -- A blockbuster year for one stock may have further to run, according to Morgan Stanley, which argued the company is “setting up for a very strong 2026” even after a 108% year-to-date rally. Related tickers mentioned: SSNLF."},{"id":"0d6777eb-9fbb-3d07-a4a1-d2f1ee83fda4","title":"GS or MS: Which IB Stock Should You Buy on Solid 2026 Prospects?","url":"https://finance.yahoo.com/news/gs-ms-ib-stock-buy-134900166.html","publisher":"Zacks","publishedAt":"2025-12-23T13:49:00.000Z","relatedTickers":["GS","MS-PQ"],"mainIdea":"GS or MS: Which IB Stock Should You Buy on Solid 2026 Prospects?","summary":"Zacks: GS or MS: Which IB Stock Should You Buy on Solid 2026 Prospects?. Improving M&A activity and supportive macro trends are aiding IB prospects for GS and MS. Let's see which Wall Street heavyweight is more attractive. Related tickers mentioned: GS, MS-PQ."},{"id":"324cfef6-9c42-31af-900d-45f020840753","title":"Is job growth really negative right now? Morgan Stanley answers","url":"https://finance.yahoo.com/news/job-growth-really-negative-now-124645885.html","publisher":"Investing.com","publishedAt":"2025-12-23T12:46:45.000Z","relatedTickers":["MS-PQ"],"mainIdea":"Is job growth really negative right now? Morgan Stanley answers","summary":"Investing.com: Is job growth really negative right now? Morgan Stanley answers. Investing.com -- Morgan Stanley told investors in a note that recent comments from Federal Reserve officials about the possibility of negative U.S. job growth may be overstating the degree of labour-market weakness, even as hiring cools and unemployment edges higher. Related tickers mentioned: MS-PQ."},{"id":"554acb10-c464-38e9-8c1a-76405b6a0948","title":"Technical Assessment: Bullish in the Intermediate-Term","url":"https://finance.yahoo.com/m/554acb10-c464-38e9-8c1a-76405b6a0948/technical-assessment%3A-bullish.html","publisher":"Argus Research","publishedAt":"2025-12-23T12:19:46.000Z","relatedTickers":["MGM","MS-PQ","^GSPC"],"mainIdea":"Technical Assessment: Bullish in the Intermediate-Term","summary":"Argus Research: Technical Assessment: Bullish in the Intermediate-Term. Stocks continued their (now three-day) upward trajectory off the December 17 low -- and for the old-timers among us, we may have traced out a typical mid-December low. That seasonal low is also known as \"The Only Free Lunch on Wall Street,\" as named by Yale Hirsch, the founder of the Stock Trader's Almanac. There are many other adages that pop up at this time of year: The January Barometer; The Santa Claus Rally; The First Five Days; If Santa Claus should fail to call, bears may come to Broad and Wall; and on and on and on. Today, we discuss The Santa Claus Rally (SCR), as it theoretically begins on Wednesday. It includes the final five days of December and the first two days of January. Going back to 1950, the S&P 500 has been up 77% of the time during this period, with an average gain of 1.26%. While we did see small losses in the past two years, we have never seen three consecutive down years. The worst recent period was in 1999, with the S&P 500 dropping 4%; the best SCR was near the end of the financial crisis in 2008, when the index rose 7.5%. The strongest consecutive period was the four years from 1972 to 1975, when the index rose 3.1%, 6.7%, 7.2%, and 4.3%, respectively. Based on the size of the last bullish reversal pattern for the S&P 500 (from February to June 2025), an initial measured move targets 7,165. The first Fibonacci (FIBO) extension target range would be 7,480 to 7,887. If the index breaks out to all-time highs and completes the current continuous inverse head-and-shoulders formation, an initial target would be 7,300, with the first FIBO extension range running from 7,400 to 7,540. (Mark Arbeter, CMT) Related tickers mentioned: MGM, MS-PQ, ^GSPC."},{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","C","GS","JPM","MS-PQ","WFC","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve's current interest rate environment. Also catch Yahoo Finance Senior Banking Reporter David Hollerith and Hennion & Walsh CIO Kevin Mahn discuss the 2026 outlook for regional banks. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, C, GS, JPM, MS-PQ, WFC, XLF."},{"id":"9236e83b-5216-3eb0-ab40-0692b8250797","title":"Morgan Stanley drops tech stocks to buy list for 2026","url":"https://finance.yahoo.com/m/9236e83b-5216-3eb0-ab40-0692b8250797/morgan-stanley-drops-tech.html","publisher":"TheStreet","publishedAt":"2025-12-22T17:33:00.000Z","relatedTickers":["^GSPC"],"mainIdea":"Morgan Stanley drops tech stocks to buy list for 2026","summary":"TheStreet: Morgan Stanley drops tech stocks to buy list for 2026. Wall Street is becoming increasingly selective about where it expects the next stock market gains to come from. As we look ahead to 2026, Morgan Stanley makes it clear that AI chips remain the most critical part of the tech space, but with a caveat. The firm warns investors to avoid expecting ... Related tickers mentioned: ^GSPC."},{"id":"1373b80a-7ea6-3154-a88f-57018dd69496","title":"Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations","url":"https://finance.yahoo.com/news/morgan-stanley-lifts-apple-inc-133955780.html","publisher":"Insider Monkey","publishedAt":"2025-12-22T13:39:55.000Z","relatedTickers":["AAPL"],"mainIdea":"Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations","summary":"Insider Monkey: Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations. Apple Inc. (NASDAQ:AAPL) is one of the best forever stocks to buy according to hedge funds. On December 17, Morgan Stanley reiterated its Overweight rating on Apple Inc. (NASDAQ: AAPL) and increased the price target to $315 from $305. The investment bank hiked the price target to reflect a 32X expected fiscal 2027 earnings per […] Related tickers mentioned: AAPL."}]}
