{"symbol":"MS","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:15.887Z","asOfDate":"2025-12-22","articles":[{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","C","GS","JPM","MS-PQ","WFC","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve Related tickers mentioned: BAC, C, GS, JPM, MS-PQ, WFC, XLF."},{"id":"9236e83b-5216-3eb0-ab40-0692b8250797","title":"Morgan Stanley drops tech stocks to buy list for 2026","url":"https://finance.yahoo.com/m/9236e83b-5216-3eb0-ab40-0692b8250797/morgan-stanley-drops-tech.html","publisher":"TheStreet","publishedAt":"2025-12-22T17:33:00.000Z","relatedTickers":["^GSPC"],"mainIdea":"Morgan Stanley drops tech stocks to buy list for 2026","summary":"TheStreet: Morgan Stanley drops tech stocks to buy list for 2026. Wall Street is becoming increasingly selective about where it expects the next stock market gains to come from. As we look ahead to 2026, Morgan Stanley makes it clear that AI chips remain the most critical part of the tech space, but with a caveat. The firm warns investors to avoid expecting ... Related tickers mentioned: ^GSPC."},{"id":"1373b80a-7ea6-3154-a88f-57018dd69496","title":"Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations","url":"https://finance.yahoo.com/news/morgan-stanley-lifts-apple-inc-133955780.html","publisher":"Insider Monkey","publishedAt":"2025-12-22T13:39:55.000Z","relatedTickers":["AAPL"],"mainIdea":"Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations","summary":"Insider Monkey: Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations. Apple Inc. (NASDAQ:AAPL) is one of the best forever stocks to buy according to hedge funds. On December 17, Morgan Stanley reiterated its Overweight rating on Apple Inc. (NASDAQ: AAPL) and increased the price target to $315 from $305. The investment bank hiked the price target to reflect a 32X expected fiscal 2027 earnings per […] Related tickers mentioned: AAPL."}]}
