{"symbol":"GILD","provider":"yahoo-finance","fetchedAt":"2025-12-23T15:59:03.422Z","asOfDate":"2025-12-23","articles":[{"id":"25bbe09c-4971-39d2-84c5-75f7fa56c4de","title":"Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner","url":"https://finance.yahoo.com/m/25bbe09c-4971-39d2-84c5-75f7fa56c4de/mandy-patinkin-and-aram.html","publisher":"CBS News Videos","publishedAt":"2025-12-23T14:54:14.000Z","relatedTickers":[],"mainIdea":"Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner","summary":"CBS News Videos: Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner. Actor Mandy Patinkin and writer and director Aram Rappaport are behind the new murder mystery series, \"The Artist,\" which is a work of historical fiction set in the Gilded Age. They speak to \"CBS Mornings\" about the series and how it got started. Patinkin also reflects on the life of Hollywood icon Rob Reiner."},{"id":"bb02e589-c05e-30be-bd13-eddf9070f525","title":"Trump Unveils Warship Named After Himself in Shipbuilding Push","url":"https://finance.yahoo.com/news/trump-unveils-warship-named-himself-221403687.html","publisher":"Bloomberg","publishedAt":"2025-12-22T23:21:08.000Z","relatedTickers":["FNCNF"],"mainIdea":"Trump Unveils Warship Named After Himself in Shipbuilding Push","summary":"Bloomberg: Trump Unveils Warship Named After Himself in Shipbuilding Push. A poster displayed at the event at Trump’s gilded Mar-a-Lago estate featured an artist’s rendering of a sleek-looking warship dubbed the USS Defiant, cutting through choppy waters with a laser beam shooting from its deck and smoke billowing from a target in the background. Next to the ship was a picture of Trump raising his fist in the air in a near copy of the defiant pose he struck minutes after surviving an assassination attempt in 2024. “Some of them have gotten old and tired and obsolete, and we’re going to go the exact opposite direction,” Trump said. Related tickers mentioned: FNCNF."},{"id":"ab3025c7-c0f6-315e-bbfb-fe74a6a5193a","title":"Gilead Sciences to Present at Upcoming Investor Conference","url":"https://finance.yahoo.com/news/gilead-sciences-present-upcoming-investor-210500713.html","publisher":"Business Wire","publishedAt":"2025-12-22T21:05:00.000Z","relatedTickers":[],"mainIdea":"Gilead Sciences to Present at Upcoming Investor Conference","summary":"Business Wire: Gilead Sciences to Present at Upcoming Investor Conference. FOSTER CITY, Calif., December 22, 2025--Gilead Sciences, Inc. (Nasdaq: GILD) announced today that its executives will be speaking at the following investor conference:"},{"id":"7828ab7e-549d-37f4-b0f5-f06022f529b1","title":"Analyst Report: Gilead Sciences, Inc.","url":"https://finance.yahoo.com/m/7828ab7e-549d-37f4-b0f5-f06022f529b1/analyst-report%3A-gilead.html","publisher":"Morningstar Research","publishedAt":"2025-12-22T16:39:43.000Z","relatedTickers":[],"mainIdea":"Analyst Report: Gilead Sciences, Inc.","summary":"Morningstar Research: Analyst Report: Gilead Sciences, Inc.. Gilead Sciences develops and markets therapies to treat and prevent life-threatening infectious diseases, with the core of its portfolio focused on HIV and hepatitis B and C. Gilead's acquisition of Pharmasset brought rights to hepatitis C drug Sovaldi, which is also part of newer combination regimens that remain standards of care. Gilead is also growing its presence in the oncology market via acquisitions, led by CAR-T cell therapy Yescarta/Tecartus (from Kite) and breast and bladder cancer therapy Trodelvy (from Immunomedics)."}]}
