{"symbol":"GILD","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:23:22.860Z","asOfDate":"2025-12-24","articles":[{"id":"cf91a71e-1be2-3b84-af9b-478049495b87","title":"Sector Update: Health Care Stocks Rise Wednesday Afternoon","url":"https://finance.yahoo.com/news/sector-health-care-stocks-rise-170838080.html","publisher":"MT Newswires","publishedAt":"2025-12-24T17:08:38.000Z","relatedTickers":["DVAX","OMER","SNY","XLV"],"mainIdea":"Sector Update: Health Care Stocks Rise Wednesday Afternoon","summary":"MT Newswires: Sector Update: Health Care Stocks Rise Wednesday Afternoon. Health care stocks were rising in recent early Wednesday afternoon trading, with the NYSE Health Car Related tickers mentioned: DVAX, OMER, SNY, XLV."},{"id":"b03b4c13-c615-3e7e-9a47-0f0c54153992","title":"Quantum computing is the stock market’s next big tech play — and these stocks are still cheap","url":"https://finance.yahoo.com/m/b03b4c13-c615-3e7e-9a47-0f0c54153992/quantum-computing-is-the.html","publisher":"MarketWatch","publishedAt":"2025-12-24T16:03:00.000Z","relatedTickers":["GOOG"],"mainIdea":"Quantum computing is the stock market’s next big tech play — and these stocks are still cheap","summary":"MarketWatch: Quantum computing is the stock market’s next big tech play — and these stocks are still cheap. Quantum stocks are where AI was five years ago — and the science actually works. Related tickers mentioned: GOOG."},{"id":"fa57fd9f-7516-3fae-8853-1a28894b3837","title":"Update: Gilead Sciences to Acquire Repare Therapeutics' Investigational Cancer Treatment; Repare Shares Rise","url":"https://finance.yahoo.com/news/gilead-sciences-acquire-repare-therapeutics-144935854.html","publisher":"MT Newswires","publishedAt":"2025-12-24T14:49:35.000Z","relatedTickers":[],"mainIdea":"Update: Gilead Sciences to Acquire Repare Therapeutics' Investigational Cancer Treatment; Repare Shares Rise","summary":"MT Newswires: Update: Gilead Sciences to Acquire Repare Therapeutics' Investigational Cancer Treatment; Repare Shares Rise. (Updates with stock move in the headline and last paragraph.) Gilead Sciences (GILD) has signed a"},{"id":"ba01418a-cf26-32ec-8075-e1d6d7b2e9e3","title":"GILD Exercises Option to License Assembly Bio's Herpes Programs","url":"https://finance.yahoo.com/news/gild-exercises-option-license-assembly-154500059.html","publisher":"Zacks","publishedAt":"2025-12-23T15:45:00.000Z","relatedTickers":["ASMB","CRMD","CSTL"],"mainIdea":"GILD Exercises Option to License Assembly Bio's Herpes Programs","summary":"Zacks: GILD Exercises Option to License Assembly Bio's Herpes Programs. Gilead exercises its option to license ASMB's HSV programs for developing long-acting candidates, ABI-1179 & ABI-5366, for recurrent genital herpes. Related tickers mentioned: ASMB, CRMD, CSTL."},{"id":"25bbe09c-4971-39d2-84c5-75f7fa56c4de","title":"Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner","url":"https://finance.yahoo.com/m/25bbe09c-4971-39d2-84c5-75f7fa56c4de/mandy-patinkin-and-aram.html","publisher":"CBS News Videos","publishedAt":"2025-12-23T14:54:14.000Z","relatedTickers":[],"mainIdea":"Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner","summary":"CBS News Videos: Mandy Patinkin and Aram Rappaport on \"The Artist\" and remembering Rob Reiner. Actor Mandy Patinkin and writer and director Aram Rappaport are behind the new murder mystery series, \"The Artist,\" which is a work of historical fiction set in the Gilded Age. They speak to \"CBS Mornings\" about the series and how it got started. Patinkin also reflects on the life of Hollywood icon Rob Reiner."},{"id":"bb02e589-c05e-30be-bd13-eddf9070f525","title":"Trump Unveils Warship Named After Himself in Shipbuilding Push","url":"https://finance.yahoo.com/news/trump-unveils-warship-named-himself-221403687.html","publisher":"Bloomberg","publishedAt":"2025-12-22T23:21:08.000Z","relatedTickers":["FNCNF"],"mainIdea":"Trump Unveils Warship Named After Himself in Shipbuilding Push","summary":"Bloomberg: Trump Unveils Warship Named After Himself in Shipbuilding Push. A poster displayed at the event at Trump’s gilded Mar-a-Lago estate featured an artist’s rendering of a sleek-looking warship dubbed the USS Defiant, cutting through choppy waters with a laser beam shooting from its deck and smoke billowing from a target in the background. Next to the ship was a picture of Trump raising his fist in the air in a near copy of the defiant pose he struck minutes after surviving an assassination attempt in 2024. “Some of them have gotten old and tired and obsolete, and we’re going to go the exact opposite direction,” Trump said. Related tickers mentioned: FNCNF."}]}
