{"symbol":"HIG","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:10.751Z","asOfDate":"2025-12-24","articles":[{"id":"ec928819-987e-3b20-b006-b78d4f76469a","title":"Piper Sandler Adjusts PT on Hartford Insurance Group to $161 From $152, Maintains Overweight Rating","url":"https://finance.yahoo.com/news/piper-sandler-adjusts-pt-hartford-105602857.html","publisher":"MT Newswires","publishedAt":"2025-12-22T10:56:02.000Z","relatedTickers":[],"mainIdea":"Piper Sandler Adjusts PT on Hartford Insurance Group to $161 From $152, Maintains Overweight Rating","summary":"MT Newswires: Piper Sandler Adjusts PT on Hartford Insurance Group to $161 From $152, Maintains Overweight Rating. Hartford Insurance Group (HIG) has an average rating of overweight and mean price target of $143.81,"},{"id":"a861dc1e-468e-3835-bc4f-331c2add48f2","title":"Does Hartford’s Strong 2025 Rally Still Offer Attractive Value for Long Term Investors?","url":"https://finance.yahoo.com/news/does-hartford-strong-2025-rally-130708426.html","publisher":"Simply Wall St.","publishedAt":"2025-12-19T13:07:08.000Z","relatedTickers":[],"mainIdea":"Does Hartford’s Strong 2025 Rally Still Offer Attractive Value for Long Term Investors?","summary":"Simply Wall St.: Does Hartford’s Strong 2025 Rally Still Offer Attractive Value for Long Term Investors?. If you are wondering whether Hartford Insurance Group is still a smart buy after such a strong run, or if you are turning up late to the party, this breakdown will walk you through what the current price really implies about potential future returns. The stock has quietly delivered solid gains, up 2.7% over the last week, 5.1% over the past month, and 27.4% year to date, with longer term returns of 29.1% over 1 year, 93.4% over 3 years, and 218.3% over 5 years. These figures naturally raise..."},{"id":"8c0609e6-18ca-3c1d-be2c-319bf17e519a","title":"The Hartford (HIG): Revisiting Valuation After a Multi‑Year Share Price Surge","url":"https://finance.yahoo.com/news/hartford-hig-revisiting-valuation-multi-031601151.html","publisher":"Simply Wall St.","publishedAt":"2025-12-19T03:16:01.000Z","relatedTickers":[],"mainIdea":"The Hartford (HIG): Revisiting Valuation After a Multi‑Year Share Price Surge","summary":"Simply Wall St.: The Hartford (HIG): Revisiting Valuation After a Multi‑Year Share Price Surge. Hartford Insurance Group (HIG) has quietly rewarded patient investors, with the stock up about 32% over the past year and roughly 95% over the past 3 years, outpacing many traditional insurers. See our latest analysis for Hartford Insurance Group. That move has not been a one off, with a solid year to date share price return of 27.47% reflecting improving sentiment on Hartford Insurance Group's earnings quality and disciplined underwriting. The strong multi year total shareholder return also..."}]}
