{"symbol":"ALL","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:28:46.954Z","asOfDate":"2025-12-25","articles":[{"id":"2c4a686c-2cb0-3b16-9b25-422e77e5c4d4","title":"Is Axon (AXON) Quietly Recasting Its Risk Profile With Debt Moves And AI-Driven Contracts?","url":"https://finance.yahoo.com/news/axon-axon-quietly-recasting-risk-230555273.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T23:05:55.000Z","relatedTickers":["AXON"],"mainIdea":"Is Axon (AXON) Quietly Recasting Its Risk Profile With Debt Moves And AI-Driven Contracts?","summary":"Simply Wall St.: Is Axon (AXON) Quietly Recasting Its Risk Profile With Debt Moves And AI-Driven Contracts?. In recent months, Axon Enterprise moved to redeem all of its 0.50% convertible senior notes due 2027 early, while also pursuing debt repurchase options to reshape its balance sheet and funding mix. At the same time, Axon has been winning multi-year public-sector contracts for AI-enabled body cameras, cloud services, and drones, reinforcing its shift toward higher-margin, recurring software and services revenue. We’ll now examine how Axon’s accelerating software and services momentum... Related tickers mentioned: AXON."},{"id":"3190d451-f9b7-31e0-b6de-20ac72652206","title":"How Disney’s US$1 Billion OpenAI Deal and New IP Pact Could Impact Walt Disney (DIS) Investors","url":"https://finance.yahoo.com/news/disney-us-1-billion-openai-220643980.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T22:06:43.000Z","relatedTickers":["ADEA","DIS","OPAI.PVT"],"mainIdea":"How Disney’s US$1 Billion OpenAI Deal and New IP Pact Could Impact Walt Disney (DIS) Investors","summary":"Simply Wall St.: How Disney’s US$1 Billion OpenAI Deal and New IP Pact Could Impact Walt Disney (DIS) Investors. Adeia Inc. recently announced a long-term media IP licensing agreement with The Walt Disney Company that resolves all prior litigation and secures broad rights for Disney’s streaming and entertainment products. A separate three-year, US$1.00 billion licensing and equity deal with OpenAI, alongside the solid global launch of Avatar: Fire and Ash, underlines how Disney is tying its content engine to emerging AI tools while reinforcing its box office reach. We’ll now examine how Disney’s... Related tickers mentioned: ADEA, DIS, OPAI.PVT."},{"id":"266a7152-e6e2-39c1-a22d-4a536d17306a","title":"Discover Hongli Group And Two More Promising Penny Stocks","url":"https://finance.yahoo.com/news/discover-hongli-group-two-more-180450465.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T18:04:50.000Z","relatedTickers":["EGY","GGROU","HLP","LCUT","LX","MAPS","RSKD","WDH","^DJI"],"mainIdea":"Discover Hongli Group And Two More Promising Penny Stocks","summary":"Simply Wall St.: Discover Hongli Group And Two More Promising Penny Stocks. As the U.S. stock market continues to set new records, with the Dow Jones and S&P 500 reaching all-time highs, investors are exploring diverse opportunities beyond blue-chip stocks. Penny stocks, a term that has evolved from its speculative roots, still present intriguing possibilities for those willing to explore smaller or newer companies offering potential growth. In this article, we will discuss three penny stocks that stand out due to their financial resilience and potential for... Related tickers mentioned: EGY, GGROU, HLP, LCUT, LX, MAPS, RSKD, WDH, ^DJI."},{"id":"808b5ec2-5ac3-321e-926c-bfb90e7da7b3","title":"Is Kinsale Capital Group Attractive After 2025 Share Pullback And Earnings Strength?","url":"https://finance.yahoo.com/news/kinsale-capital-group-attractive-2025-080917734.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T08:09:17.000Z","relatedTickers":["KNSL"],"mainIdea":"Is Kinsale Capital Group Attractive After 2025 Share Pullback And Earnings Strength?","summary":"Simply Wall St.: Is Kinsale Capital Group Attractive After 2025 Share Pullback And Earnings Strength?. If you have been wondering whether Kinsale Capital Group is starting to look like a bargain or still pricing in perfection, you are not alone. This stock has been attracting plenty of valuation chatter lately. After a rough patch that has left shares down about 12.6% year to date and 15.6% over the last year, the stock has recently bounced with gains of roughly 4.9% over the past week and 4.6% over the past month, all on the back of a long term record that still shows it up about 52.4% over... Related tickers mentioned: KNSL."},{"id":"09e45113-f8c6-33b3-84a3-e7ee36b30f35","title":"Is Blackrock Silver’s (TSXV:BRC) Cornerstone-Funded Placement Quietly Redefining Its Tonopah West Risk Profile?","url":"https://finance.yahoo.com/news/blackrock-silver-tsxv-brc-cornerstone-080748304.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T08:07:48.000Z","relatedTickers":["BKRRF"],"mainIdea":"Is Blackrock Silver’s (TSXV:BRC) Cornerstone-Funded Placement Quietly Redefining Its Tonopah West Risk Profile?","summary":"Simply Wall St.: Is Blackrock Silver’s (TSXV:BRC) Cornerstone-Funded Placement Quietly Redefining Its Tonopah West Risk Profile?. Blackrock Silver Corp. recently announced a non-brokered private placement of up to 13,636,363 units at C$1.10 per unit, targeting gross proceeds of up to C$14,999,999.30, with each unit including one common share and a half warrant exercisable at C$1.50 for two years. An interesting feature of this financing is the expectation that two cornerstone investors will acquire all or nearly all of the units, providing focused backing for ongoing exploration and pre-development work at the Tonopah... Related tickers mentioned: BKRRF."},{"id":"ec5ef1f9-8f0b-30de-8056-20f0b1b4510d","title":"China says it hopes firms seek lawful, balanced solutions over TikTok deal","url":"https://finance.yahoo.com/m/ec5ef1f9-8f0b-30de-8056-20f0b1b4510d/china-says-it-hopes-firms.html","publisher":"Reuters","publishedAt":"2025-12-25T07:49:35.000Z","relatedTickers":[],"mainIdea":"China says it hopes firms seek lawful, balanced solutions over TikTok deal","summary":"Reuters: China says it hopes firms seek lawful, balanced solutions over TikTok deal. BEIJING, Dec 25 (Reuters) - The Chinese government would like to see companies reach solutions that comply with Chinese laws and regulations and balance the interests of all parties, a commerce"}]}
