{"symbol":"ALL","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:04.852Z","asOfDate":"2025-12-23","articles":[{"id":"bb85f4d8-5721-3166-821c-7edeaa7b0296","title":"Does Recent Cost Restructuring Make UPS Attractive at Current 2025 Price Levels?","url":"https://finance.yahoo.com/news/does-recent-cost-restructuring-ups-081002057.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:10:02.000Z","relatedTickers":["UPS"],"mainIdea":"Does Recent Cost Restructuring Make UPS Attractive at Current 2025 Price Levels?","summary":"Simply Wall St.: Does Recent Cost Restructuring Make UPS Attractive at Current 2025 Price Levels?. If you are wondering whether United Parcel Service is a bargain or a trap at current levels, especially with all the noise around e commerce and logistics, you are not alone. This article focuses on what the numbers indicate about value. Despite being down 18.7% year to date and 14.4% over the last year, UPS has quietly risen about 0.7% in the last week and 6.4% over the past month. This may indicate that some investors are starting to reassess the risk reward trade off after a challenging... Related tickers mentioned: UPS."},{"id":"0d21f45b-2c2b-35d7-b466-884343260c97","title":"Puzzle solutions for Tuesday, Dec. 23, 2025","url":"https://finance.yahoo.com/m/0d21f45b-2c2b-35d7-b466-884343260c97/puzzle-solutions-for-tuesday%2C.html","publisher":"USA TODAY","publishedAt":"2025-12-23T07:19:23.000Z","relatedTickers":[],"mainIdea":"Puzzle solutions for Tuesday, Dec. 23, 2025","summary":"USA TODAY: Puzzle solutions for Tuesday, Dec. 23, 2025. Find answers to the latest online sudoku and crossword puzzles that were published in USA TODAY Network's local newspapers."},{"id":"b8558741-e43a-35f0-b461-34fceaa9c06c","title":"/C O R R E C T I O N -- Musee Platinum Tokyo/","url":"https://finance.yahoo.com/news/mus-e-platinum-tokyo-launches-060000414.html","publisher":"PR Newswire","publishedAt":"2025-12-23T06:00:00.000Z","relatedTickers":[],"mainIdea":"/C O R R E C T I O N -- Musee Platinum Tokyo/","summary":"PR Newswire: /C O R R E C T I O N -- Musee Platinum Tokyo/. Musee Platinum Tokyo, a leading beauty brand with over 15 years in Singapore, has officially launched the DUO Hydrogen Treatment at all its salon locations. The non-invasive treatment is formulated for individuals with sensitive, acne-prone, eczema-prone, or reactive skin and is suitable for application to the face, scalp, and body, including delicate areas."}]}
