{"symbol":"CB","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:34.442Z","asOfDate":"2025-12-24","articles":[{"id":"ce87f79a-1058-3dda-8d45-7d9703f93a3e","title":"Healthy Paws Pet Foundation at Chubb Donates $275,000 to Animal Rescue Organizations Across the United States to Support Adoption and Ongoing Care for Vulnerable Pets","url":"https://finance.yahoo.com/news/healthy-paws-pet-foundation-chubb-150000343.html","publisher":"PR Newswire","publishedAt":"2025-12-22T15:00:00.000Z","relatedTickers":[],"mainIdea":"Healthy Paws Pet Foundation at Chubb Donates $275,000 to Animal Rescue Organizations Across the United States to Support Adoption and Ongoing Care for Vulnerable Pets","summary":"PR Newswire: Healthy Paws Pet Foundation at Chubb Donates $275,000 to Animal Rescue Organizations Across the United States to Support Adoption and Ongoing Care for Vulnerable Pets. Healthy Paws, a leading provider of accident and illness pet insurance for dogs and cats, today announced recent donations totaling $275,000 to seven animal rescue organizations across the country through the Healthy Paws Pet Foundation at Chubb. These contributions are part of the Foundation's ongoing commitment to creating accessible pathways for pet rescue and care."},{"id":"0c5bb937-fe96-3f34-9159-1d062273e621","title":"Why Chubb (CB) is a Top Value Stock for the Long-Term","url":"https://finance.yahoo.com/news/why-chubb-cb-top-value-144003301.html","publisher":"Zacks","publishedAt":"2025-12-19T14:40:03.000Z","relatedTickers":[],"mainIdea":"Why Chubb (CB) is a Top Value Stock for the Long-Term","summary":"Zacks: Why Chubb (CB) is a Top Value Stock for the Long-Term. Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."},{"id":"f0a92a3f-46cb-3d27-8e8b-94c655fb4746","title":"How to Find Strong Finance Stocks Slated for Positive Earnings Surprises","url":"https://finance.yahoo.com/news/strong-finance-stocks-slated-positive-140001556.html","publisher":"Zacks","publishedAt":"2025-12-19T14:00:01.000Z","relatedTickers":["MS","MS-PQ"],"mainIdea":"How to Find Strong Finance Stocks Slated for Positive Earnings Surprises","summary":"Zacks: How to Find Strong Finance Stocks Slated for Positive Earnings Surprises. Investors looking for ways to find stocks that are set to beat quarterly earnings estimates should check out the Zacks Earnings ESP. Related tickers mentioned: MS, MS-PQ."}]}
