{"symbol":"FDX","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:33:59.422Z","asOfDate":"2025-12-25","articles":[{"id":"e76d324d-bb95-3f15-a5f9-36feb70a6ab0","title":"The 5 Most Interesting Analyst Questions From FedEx’s Q4 Earnings Call","url":"https://finance.yahoo.com/news/5-most-interesting-analyst-questions-053118975.html","publisher":"StockStory","publishedAt":"2025-12-25T05:31:18.000Z","relatedTickers":[],"mainIdea":"The 5 Most Interesting Analyst Questions From FedEx’s Q4 Earnings Call","summary":"StockStory: The 5 Most Interesting Analyst Questions From FedEx’s Q4 Earnings Call. FedEx’s fourth quarter was marked by solid execution amid a complex environment, as the company surpassed Wall Street’s revenue and profit expectations. Management attributed the performance to strength in U.S. domestic package services, continued progress in cost reductions, and resilience in B2B segments. CEO Raj Subramaniam credited the company’s ability to “mitigate the operational and financial impacts of the MD-11 groundings” and emphasized that almost half of revenue growth came from B2B"},{"id":"3515ca78-ef7e-35dd-8948-09c4f29cf78d","title":"Does the stock market close early on Christmas Eve? Are the banks open?","url":"https://finance.yahoo.com/m/3515ca78-ef7e-35dd-8948-09c4f29cf78d/does-the-stock-market-close.html","publisher":"MarketWatch","publishedAt":"2025-12-24T14:42:00.000Z","relatedTickers":["^IXIC"],"mainIdea":"Does the stock market close early on Christmas Eve? Are the banks open?","summary":"MarketWatch: Does the stock market close early on Christmas Eve? Are the banks open?. Expect plenty of schedule changes for financial markets, mail service, federal offices and more during the coming days Related tickers mentioned: ^IXIC."},{"id":"2e6ebbd3-0303-37cd-8ef3-5c0923b3c48e","title":"Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.","url":"https://finance.yahoo.com/m/2e6ebbd3-0303-37cd-8ef3-5c0923b3c48e/is-the-stock-market-open.html","publisher":"Barrons.com","publishedAt":"2025-12-24T05:01:00.000Z","relatedTickers":["^IXIC"],"mainIdea":"Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.","summary":"Barrons.com: Is the Stock Market Open Today? Here Are the Trading Hours for Christmas Eve and Christmas Day.. Here’s what investors should know about trading hours on Christmas Eve and Christmas Day. Is the Stock Market Open or Closed on Christmas Eve? President Donald Trump signed an executive order last week closing all executive departments and federal agencies on both Christmas Eve and Dec. 26 this year. Related tickers mentioned: ^IXIC."},{"id":"7f4f99c1-43f3-3f00-a32e-50a499efc9e3","title":"Susquehanna Adjusts Price Target on FedEx to $340 From $345","url":"https://finance.yahoo.com/news/susquehanna-adjusts-price-target-fedex-115914853.html","publisher":"MT Newswires","publishedAt":"2025-12-23T11:59:14.000Z","relatedTickers":[],"mainIdea":"Susquehanna Adjusts Price Target on FedEx to $340 From $345","summary":"MT Newswires: Susquehanna Adjusts Price Target on FedEx to $340 From $345. FedEx (FDX) has an average rating of overweight and mean price target of $304.35, according to analy"}]}
