{"symbol":"SPY","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:28.951Z","asOfDate":"2025-12-27","articles":[{"id":"e0cff7a0-5d2e-3df9-b449-c31b06bf95d1","title":"Meet the team that investigates when journalists and activists get hacked with government spyware","url":"https://finance.yahoo.com/m/e0cff7a0-5d2e-3df9-b449-c31b06bf95d1/meet-the-team-that.html","publisher":"TechCrunch","publishedAt":"2025-12-27T18:00:00.000Z","relatedTickers":[],"mainIdea":"Meet the team that investigates when journalists and activists get hacked with government spyware","summary":"TechCrunch: Meet the team that investigates when journalists and activists get hacked with government spyware. For years, Access Now’s Digital Security Helpline has been aiding journalists and dissidents who have been targeted with government spyware. This is how they operate."},{"id":"8a38e651-70d7-3476-a12a-322394c9cf95","title":"Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession","url":"https://finance.yahoo.com/news/biden-boom-vs-trump-freeze-153051202.html","publisher":"Benzinga","publishedAt":"2025-12-27T15:30:51.000Z","relatedTickers":[],"mainIdea":"Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession","summary":"Benzinga: Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession. Economist Paul Krugman warns that the United States has traded the inclusive, pro-worker recovery of the Joe Biden years for a stratified “Trump freeze,” creating a new K-shaped economy where the wealthy thrive while the working class falls behind. Reversal Of Fortune In a new analysis, Krugman challenges the “lazy cynicism” that economic inequality is an unchangeable constant in American life. He points to Atlanta Fed data showing that the Biden presidency presided over a rare “Great Compressio"},{"id":"320e84e4-5862-3084-a0de-7342e1fa6374","title":"Iran Eases Social Rules Amid Crises—but Crushes Dissent","url":"https://finance.yahoo.com/m/320e84e4-5862-3084-a0de-7342e1fa6374/iran-eases-social-rules-amid.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-27T04:00:00.000Z","relatedTickers":[],"mainIdea":"Iran Eases Social Rules Amid Crises—but Crushes Dissent","summary":"The Wall Street Journal: Iran Eases Social Rules Amid Crises—but Crushes Dissent. Facing sanctions pressure and still reeling from war with Israel, Iran’s regime is tolerating women shunning hijabs, even as it cracks down on political dissent."}]}
