{"symbol":"LI","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:19.815Z","asOfDate":"2025-12-24","articles":[{"id":"f602b972-d1b5-3fd7-aa11-b8e4be8441bd","title":"Goldman Sachs Analyst Lowers Its Price Target For Li Auto Inc. (LI)","url":"https://finance.yahoo.com/news/goldman-sachs-analyst-lowers-price-023449892.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T02:34:49.000Z","relatedTickers":["LAAOF"],"mainIdea":"Goldman Sachs Analyst Lowers Its Price Target For Li Auto Inc. (LI)","summary":"Insider Monkey: Goldman Sachs Analyst Lowers Its Price Target For Li Auto Inc. (LI). Li Auto Inc. (NASDAQ:LI) is among 10 Best EV Stocks to Buy Heading into 2026. As reported by TheFly, Goldman Sachs lowered its price target for Li Auto Inc. (NASDAQ:LI) from $30.90 to $27 on December 1 and still maintained a Buy rating. As noted by Goldman Sachs analyst Tina Hou, the company’s third-quarter results […] Related tickers mentioned: LAAOF."},{"id":"d42c613e-a596-3679-bf1c-5f8f5f4789ee","title":"Li Auto And 2 More Growth Companies With Strong Insider Confidence","url":"https://finance.yahoo.com/news/li-auto-2-more-growth-113540592.html","publisher":"Simply Wall St.","publishedAt":"2025-12-22T11:35:40.000Z","relatedTickers":["ALAB","APP","ATAT","CORT","CRDO","LAAOF","NIU","SE","SES","SMCI","STUB","UPST","^GSPC"],"mainIdea":"Li Auto And 2 More Growth Companies With Strong Insider Confidence","summary":"Simply Wall St.: Li Auto And 2 More Growth Companies With Strong Insider Confidence. As the U.S. stock market experiences a resurgence, with major indexes like the S&P 500 and Nasdaq posting weekly gains amid a tech rally, investor confidence appears to be on the rise. In such an environment, growth companies with high insider ownership can signal strong internal belief in their long-term potential, making them attractive considerations for those looking to align with management's vision. Related tickers mentioned: ALAB, APP, ATAT, CORT, CRDO, LAAOF, NIU, SE, SES, SMCI, STUB, UPST, ^GSPC."},{"id":"c3d00133-897c-33e2-a466-9926de8d4dc8","title":"HSBC Downgrades To Hold For Li Auto Inc. (LI)","url":"https://finance.yahoo.com/news/hsbc-downgrades-hold-li-auto-132113155.html","publisher":"Insider Monkey","publishedAt":"2025-12-18T13:21:13.000Z","relatedTickers":["LAAOF"],"mainIdea":"HSBC Downgrades To Hold For Li Auto Inc. (LI)","summary":"Insider Monkey: HSBC Downgrades To Hold For Li Auto Inc. (LI). Li Auto Inc. (NASDAQ:LI) is among the 8 High Growth EV Stocks to Buy Now. HSBC downgraded Li Auto Inc. (NASDAQ:LI) to Hold from Buy on December 4, bringing down its price objective to $18.60 from $30.30, according to TheFly. HSBC stated that significant recall, delivery issues, and declining sales were the main causes of […] Related tickers mentioned: LAAOF."}]}
