{"symbol":"SHOP","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:08.030Z","asOfDate":"2025-12-26","articles":[{"id":"0c0a0a36-edfe-3456-a613-9bcb18dcedb5","title":"These 300 Stores Are Closing Across The US In 2026—And Shoppers May Feel It Fast","url":"https://finance.yahoo.com/news/300-stores-closing-across-us-100550084.html","publisher":"Benzinga","publishedAt":"2025-12-26T10:05:50.000Z","relatedTickers":["CRI","KR","M","NWL"],"mainIdea":"These 300 Stores Are Closing Across The US In 2026—And Shoppers May Feel It Fast","summary":"Benzinga: These 300 Stores Are Closing Across The US In 2026—And Shoppers May Feel It Fast. In an ongoing trend of retail retrenchment, nearly 300 retail stores are expected to close their doors in 2026, following the pattern of significant store closures observed in 2024 and 2025. Major chains including Macy’s and Kroger (NYSE:KR) have unveiled plans for multi-year store closures extending into 2026. This trend is not limited to large chains, as many niche stores are also reallocating resources to bolster their online presence. For 2026, the outlet has already identified almost 270 pl Related tickers mentioned: CRI, KR, M, NWL."},{"id":"9e965e9b-66c4-3506-8ad3-a72e94a355ab","title":"Nike Stock Has Lost Value 4 Years Straight. Will 2026 Be Different?","url":"https://finance.yahoo.com/m/9e965e9b-66c4-3506-8ad3-a72e94a355ab/nike-stock-has-lost-value-4.html","publisher":"Motley Fool","publishedAt":"2025-12-26T09:45:00.000Z","relatedTickers":["NKE"],"mainIdea":"Nike Stock Has Lost Value 4 Years Straight. Will 2026 Be Different?","summary":"Motley Fool: Nike Stock Has Lost Value 4 Years Straight. Will 2026 Be Different?. Nike investors have little to cheer about this holiday season, especially with the S&P 500 hovering around all-time highs. Related tickers mentioned: NKE."},{"id":"f3e6f329-6e59-3410-a22c-b43d2b861e3c","title":"Bad gift? These retailers in NJ have started charging for returns","url":"https://finance.yahoo.com/m/f3e6f329-6e59-3410-a22c-b43d2b861e3c/bad-gift%3F-these-retailers-in.html","publisher":"The Bergen Record","publishedAt":"2025-12-26T09:30:50.000Z","relatedTickers":[],"mainIdea":"Bad gift? These retailers in NJ have started charging for returns","summary":"The Bergen Record: Bad gift? These retailers in NJ have started charging for returns. Consumers will return $850 billion of merchandise this year, and in response 72% of retailers have started charging at least some return fees."}]}
