{"symbol":"LMT","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:00.441Z","asOfDate":"2025-12-25","articles":[{"id":"d175bf38-5d85-344f-a247-ee3a1a177028","title":"Lockheed Martin (LMT): Revisiting Valuation After a Recent 8% Share Price Climb","url":"https://finance.yahoo.com/news/lockheed-martin-lmt-revisiting-valuation-232018635.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T23:20:18.000Z","relatedTickers":[],"mainIdea":"Lockheed Martin (LMT): Revisiting Valuation After a Recent 8% Share Price Climb","summary":"Simply Wall St.: Lockheed Martin (LMT): Revisiting Valuation After a Recent 8% Share Price Climb. Lockheed Martin (LMT) shares have been quietly grinding higher, with the stock up about 8% over the past month. That move has investors revisiting the defense giant’s valuation and long term earnings power. See our latest analysis for Lockheed Martin. Zooming out, that recent 1 month share price return of roughly 8 percent comes after a relatively muted year to date move. This suggests momentum is starting to build as investors warm to Lockheed Martin’s growth and cash flow profile. If that..."},{"id":"62b2085c-ecb8-33d9-85f9-745cd771a908","title":"Aerospace Leader Howmet Poised To Hit New Buy Point","url":"https://finance.yahoo.com/m/62b2085c-ecb8-33d9-85f9-745cd771a908/aerospace-leader-howmet.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T16:39:21.000Z","relatedTickers":["BA","EADSF","GE","HWM","SWK"],"mainIdea":"Aerospace Leader Howmet Poised To Hit New Buy Point","summary":"Investor's Business Daily: Aerospace Leader Howmet Poised To Hit New Buy Point. Howmet Stock: The aerospace leader is approaching a new buy point following strong gains in recent sessions. Related tickers mentioned: BA, EADSF, GE, HWM, SWK."},{"id":"39a44fb5-09d3-3a3a-9a92-a7950e8d8a73","title":"Airbus Secures Contract to Supply 100 Military Helicopters to Spain","url":"https://finance.yahoo.com/news/airbus-secures-contract-supply-100-143800545.html","publisher":"Zacks","publishedAt":"2025-12-24T14:38:00.000Z","relatedTickers":["BA","EADSF","EADSY","TXT"],"mainIdea":"Airbus Secures Contract to Supply 100 Military Helicopters to Spain","summary":"Zacks: Airbus Secures Contract to Supply 100 Military Helicopters to Spain. EADSY wins Spain's largest helicopter procurement, agreeing to supply 100 military aircraft across four models to modernize the nation's armed forces. Related tickers mentioned: BA, EADSF, EADSY, TXT."}]}
