{"symbol":"LMT","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:24.754Z","asOfDate":"2025-12-23","articles":[{"id":"2df14432-becb-3e95-84a0-d44a731eff4f","title":"Analyst Report: The Boeing Company","url":"https://finance.yahoo.com/m/2df14432-becb-3e95-84a0-d44a731eff4f/analyst-report%3A-the-boeing.html","publisher":"Morningstar Research","publishedAt":"2025-12-23T00:58:48.000Z","relatedTickers":["BA","EADSF","NOC"],"mainIdea":"Analyst Report: The Boeing Company","summary":"Morningstar Research: Analyst Report: The Boeing Company. Boeing is a major aerospace and defense firm operating in three segments: commercial airplanes; defense, space, and security; and global services. Boeing's commercial airplanes segment competes with Airbus in the production of aircraft that can carry more than 130 passengers. Boeing's defense, space, and security segment competes with defense contractors such as Lockheed Martin and Northrop Grumman to create military aircraft, satellites, and weaponry. Global services provides aftermarket support to airlines. Related tickers mentioned: BA, EADSF, NOC."},{"id":"b7098cd1-155a-3f22-b054-68768f046836","title":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","url":"https://finance.yahoo.com/m/b7098cd1-155a-3f22-b054-68768f046836/trump-targets-defense-firms.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-23T00:25:00.000Z","relatedTickers":[],"mainIdea":"Trump Targets Defense Firms on Weapons Speed, Stock Buybacks","summary":"The Wall Street Journal: Trump Targets Defense Firms on Weapons Speed, Stock Buybacks. President Trump said Monday he wants to pressure America’s largest defense contractors to speed up weapons production by investing in new facilities and ending the practice of repurchasing stocks. “They want to buy back their stock—I don’t want them to buy back their stock,” Trump said, adding that he would make his case to top defense executives in Florida next week. Speaking at his Mar-a-Lago club in Palm Beach on Monday after announcing a new class of Navy battleships that will bear his name, Trump also criticized the high pay of executives at defense firms."},{"id":"8adcea15-3113-3cf8-9f44-b34c0e667a28","title":"Why Lockheed Martin (LMT) Outpaced the Stock Market Today","url":"https://finance.yahoo.com/news/why-lockheed-martin-lmt-outpaced-225003199.html","publisher":"Zacks","publishedAt":"2025-12-22T22:50:03.000Z","relatedTickers":["^DJI","^GSPC"],"mainIdea":"Why Lockheed Martin (LMT) Outpaced the Stock Market Today","summary":"Zacks: Why Lockheed Martin (LMT) Outpaced the Stock Market Today. In the closing of the recent trading day, Lockheed Martin (LMT) stood at $483.57, denoting a +1.99% move from the preceding trading day. Related tickers mentioned: ^DJI, ^GSPC."}]}
