{"symbol":"CSCO","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:17.339Z","asOfDate":"2025-12-23","articles":[{"id":"a589b3ef-91ff-3675-bd61-c8408b25ea4d","title":"Can AI Data Center Partnership With Fortinet Lift Arista's Shares?","url":"https://finance.yahoo.com/news/ai-data-center-partnership-fortinet-155400795.html","publisher":"Zacks","publishedAt":"2025-12-23T15:54:00.000Z","relatedTickers":["ANET","FTNT","HPE"],"mainIdea":"Can AI Data Center Partnership With Fortinet Lift Arista's Shares?","summary":"Zacks: Can AI Data Center Partnership With Fortinet Lift Arista's Shares?. ANET teams up with Fortinet to deliver a secure, high-speed AI data center solution, boosting scalable, zero-trust AI infrastructure. Related tickers mentioned: ANET, FTNT, HPE."},{"id":"0e7c2934-343d-3f98-8773-2b1507742813","title":"Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec","url":"https://finance.yahoo.com/news/naughty-ventures-acquires-claims-adjacent-144000468.html","publisher":"Newsfile","publishedAt":"2025-12-23T14:40:00.000Z","relatedTickers":["QUEXF","YORKF"],"mainIdea":"Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec","summary":"Newsfile: Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec. Vancouver, British Columbia--(Newsfile Corp. - December 23, 2025) - Naughty Ventures Corp. (CSE: BAD) (FSE: 5DEO) (OTC Pink: YORKF) (\"Naughty Ventures\" or the \"Company\") is pleased to announce that it has staked a strategic 7,207-hectare land package, hereinafter referred to as the Green Lightning Lithium Project, directly adjoining Q2 Metals Corp. (\"Cisco\") emerging lithium project in the Frotet Evans Greenstone Belt, located in Quebec.Figure 1: Naughty Ventures' Green Lightning Lithium... Related tickers mentioned: QUEXF, YORKF."},{"id":"dd2efcc2-1648-3d63-a25d-0325069c4b24","title":"Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally","url":"https://finance.yahoo.com/news/cisco-still-attractively-priced-strong-130747176.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T13:07:47.000Z","relatedTickers":[],"mainIdea":"Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally","summary":"Simply Wall St.: Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally. Wondering if Cisco Systems is still a bargain after its big run up, or if you might be arriving late to the party? This breakdown will walk you through whether the current price makes sense. The stock has pulled back slightly over the last week, down 0.2%, but it is still up 2.6% over 30 days, 32.2% year to date, and 35.9% over the past year, following gains of 79.6% over 3 years and 101.5% over 5 years. Those moves have come as investors refocus on Cisco's role in powering AI ready networks..."},{"id":"65a995e2-731e-3bd8-ac46-a5c62b2ff7d7","title":"SCHD vs. NOBL: Different Paths to Dividend Stability","url":"https://finance.yahoo.com/m/65a995e2-731e-3bd8-ac46-a5c62b2ff7d7/schd-vs.-nobl%3A-different.html","publisher":"Motley Fool","publishedAt":"2025-12-22T21:31:52.000Z","relatedTickers":["SCHD"],"mainIdea":"SCHD vs. NOBL: Different Paths to Dividend Stability","summary":"Motley Fool: SCHD vs. NOBL: Different Paths to Dividend Stability. Both ETFs target dividend paying stocks, but their rules determine whether investors receive higher income or stricter dividend consistency Related tickers mentioned: SCHD."},{"id":"16486494-c6aa-3545-bbc5-e6697baee919","title":"Morgan Stanley Sees Cisco (CSCO) Benefiting From AI Infrastructure Demand","url":"https://finance.yahoo.com/news/morgan-stanley-sees-cisco-csco-155737752.html","publisher":"Insider Monkey","publishedAt":"2025-12-22T15:57:37.000Z","relatedTickers":["NVDA"],"mainIdea":"Morgan Stanley Sees Cisco (CSCO) Benefiting From AI Infrastructure Demand","summary":"Insider Monkey: Morgan Stanley Sees Cisco (CSCO) Benefiting From AI Infrastructure Demand. Cisco Systems, Inc. (NASDAQ:CSCO) is included among the 13 Top Tech Stocks Paying Consistent Dividends. On December 17, Morgan Stanley lifted its price target on Cisco Systems, Inc. (NASDAQ:CSCO) to $91 from $82 and kept an Overweight rating on the stock. The firm said the AI trade widened beyond semiconductor stocks in 2025, giving a […] Related tickers mentioned: NVDA."},{"id":"1b235e4d-18a0-31bf-89f4-1555a966fd11","title":"5 Stocks That Pay Out Dividends Like Apple","url":"https://finance.yahoo.com/news/5-stocks-pay-dividends-apple-155506022.html","publisher":"GOBankingRates","publishedAt":"2025-12-22T15:55:06.000Z","relatedTickers":["AAPL","^GSPC"],"mainIdea":"5 Stocks That Pay Out Dividends Like Apple","summary":"GOBankingRates: 5 Stocks That Pay Out Dividends Like Apple. Discover 5 top dividend stocks that offer payouts similar to Apple, combining strong returns and stability for smart long-term investors. Related tickers mentioned: AAPL, ^GSPC."}]}
