{"symbol":"CSCO","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:21:27.710Z","asOfDate":"2025-12-24","articles":[{"id":"defab8ac-e89b-3c97-adc4-a08604b8aa7a","title":"Cisco's AI-Push Aids Networking Revenue: Is There More Upside Ahead?","url":"https://finance.yahoo.com/news/ciscos-ai-push-aids-networking-160300644.html","publisher":"Zacks","publishedAt":"2025-12-24T16:03:00.000Z","relatedTickers":["ANET","HPE","NVDA"],"mainIdea":"Cisco's AI-Push Aids Networking Revenue: Is There More Upside Ahead?","summary":"Zacks: Cisco's AI-Push Aids Networking Revenue: Is There More Upside Ahead?. CSCO's AI push lifts Q1 FY26 networking revenue 15% to $7.77B, with hyperscaler AI orders surging and a $3B FY26 target in sight. Related tickers mentioned: ANET, HPE, NVDA."},{"id":"7b800fdb-9006-390a-afa1-a43c54564c80","title":"Prediction: D-Wave Quantum Stock Will Be Worth This Much by Year-End 2026","url":"https://finance.yahoo.com/m/7b800fdb-9006-390a-afa1-a43c54564c80/prediction%3A-d-wave-quantum.html","publisher":"Motley Fool","publishedAt":"2025-12-24T14:30:00.000Z","relatedTickers":["IONQ","QBTS","RGTI","^GSPC"],"mainIdea":"Prediction: D-Wave Quantum Stock Will Be Worth This Much by Year-End 2026","summary":"Motley Fool: Prediction: D-Wave Quantum Stock Will Be Worth This Much by Year-End 2026. The quantum computing startup has outperformed the broader market in 2025, but its rise has left it trading at a hefty premium. Related tickers mentioned: IONQ, QBTS, RGTI, ^GSPC."},{"id":"e564730c-630c-33c4-b0b9-dbab6a708e72","title":"Snowflake In Talks To Buy Observe Amid AI Acquisition Spree","url":"https://finance.yahoo.com/m/e564730c-630c-33c4-b0b9-dbab6a708e72/snowflake-in-talks-to-buy.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T13:01:58.000Z","relatedTickers":["DDOG","DT","PANW","SNOW"],"mainIdea":"Snowflake In Talks To Buy Observe Amid AI Acquisition Spree","summary":"Investor's Business Daily: Snowflake In Talks To Buy Observe Amid AI Acquisition Spree. Snowflake reportedly is in talks to buy startup Observe, a deal that would add to its artificial intelligence acquisition spree. Related tickers mentioned: DDOG, DT, PANW, SNOW."},{"id":"a589b3ef-91ff-3675-bd61-c8408b25ea4d","title":"Can AI Data Center Partnership With Fortinet Lift Arista's Shares?","url":"https://finance.yahoo.com/news/ai-data-center-partnership-fortinet-155400795.html","publisher":"Zacks","publishedAt":"2025-12-23T15:54:00.000Z","relatedTickers":["ANET","FTNT","HPE"],"mainIdea":"Can AI Data Center Partnership With Fortinet Lift Arista's Shares?","summary":"Zacks: Can AI Data Center Partnership With Fortinet Lift Arista's Shares?. ANET teams up with Fortinet to deliver a secure, high-speed AI data center solution, boosting scalable, zero-trust AI infrastructure. Related tickers mentioned: ANET, FTNT, HPE."},{"id":"0e7c2934-343d-3f98-8773-2b1507742813","title":"Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec","url":"https://finance.yahoo.com/news/naughty-ventures-acquires-claims-adjacent-144000468.html","publisher":"Newsfile","publishedAt":"2025-12-23T14:40:00.000Z","relatedTickers":["QUEXF","YORKF"],"mainIdea":"Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec","summary":"Newsfile: Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec. Vancouver, British Columbia--(Newsfile Corp. - December 23, 2025) - Naughty Ventures Corp. (CSE: BAD) (FSE: 5DEO) (OTC Pink: YORKF) (\"Naughty Ventures\" or the \"Company\") is pleased to announce that it has staked a strategic 7,207-hectare land package, hereinafter referred to as the Green Lightning Lithium Project, directly adjoining Q2 Metals Corp. (\"Cisco\") emerging lithium project in the Frotet Evans Greenstone Belt, located in Quebec.Figure 1: Naughty Ventures' Green Lightning Lithium... Related tickers mentioned: QUEXF, YORKF."},{"id":"dd2efcc2-1648-3d63-a25d-0325069c4b24","title":"Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally","url":"https://finance.yahoo.com/news/cisco-still-attractively-priced-strong-130747176.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T13:07:47.000Z","relatedTickers":[],"mainIdea":"Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally","summary":"Simply Wall St.: Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally. Wondering if Cisco Systems is still a bargain after its big run up, or if you might be arriving late to the party? This breakdown will walk you through whether the current price makes sense. The stock has pulled back slightly over the last week, down 0.2%, but it is still up 2.6% over 30 days, 32.2% year to date, and 35.9% over the past year, following gains of 79.6% over 3 years and 101.5% over 5 years. Those moves have come as investors refocus on Cisco's role in powering AI ready networks..."}]}
