{"symbol":"IBM","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:39.999Z","asOfDate":"2025-12-23","articles":[{"id":"6306c3e6-bc9e-398b-850f-2ec3ef7c9b9b","title":"Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?","url":"https://finance.yahoo.com/news/quantum-stocks-2026-ionq-qbts-200000618.html","publisher":"Zacks","publishedAt":"2025-12-22T20:00:00.000Z","relatedTickers":["IONQ","NVDA","QBTS"],"mainIdea":"Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?","summary":"Zacks: Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?. IonQ and D-Wave are gaining momentum in 2026 as quantum computing attracts billions in public and corporate funding. Related tickers mentioned: IONQ, NVDA, QBTS."},{"id":"b6089725-3cbc-30ab-bfab-4d5614429499","title":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","url":"https://finance.yahoo.com/news/ter-vs-amd-ai-component-163800705.html","publisher":"Zacks","publishedAt":"2025-12-22T16:38:00.000Z","relatedTickers":["AMD","TER"],"mainIdea":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","summary":"Zacks: TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?. Teradyne's AI-driven test systems and stronger earnings surprises give TER an edge over Advanced Micro Devices in the fast-growing AI semiconductor supply chain. Related tickers mentioned: AMD, TER."},{"id":"dcfe0d1e-756c-37cb-b7ca-dd3b9756d27a","title":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","url":"https://finance.yahoo.com/news/warner-bros-bidding-war-red-161251059.html","publisher":"Reuters","publishedAt":"2025-12-22T16:12:51.000Z","relatedTickers":["CFLT","TATE.PVT","WBD"],"mainIdea":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","summary":"Reuters: Warner Bros bidding war and red hot M&A market has dealmakers working through holidays. A flurry of multi-billion-dollar deals has bankers and advisers from Wall Street to Canary Wharf packing laptops next to presents and warning family and friends their holiday vacations over the next two weeks will be cut short. There have been $463.6 billion ​in mergers and acquisitions announced this month, 30% more than last year, including Trump Media & Technology Group's $6 billion merger with nuclear fusion firm TAE Technologies, IBM's $11 ‌billion purchase of data infrastructure company Confluent and a bidding war between Paramount Skydance and Netflix for Warner Bros Discovery, according to data compiled by Dealogic. Related tickers mentioned: CFLT, TATE.PVT, WBD."}]}
