{"symbol":"IBM","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:29.262Z","asOfDate":"2025-12-27","articles":[{"id":"66e7e90c-bf91-3558-84cf-0e575c2a45bf","title":"Emerge's 2025 Tech Trend of The Year: Quantum Computing Stopped Being Background Noise","url":"https://finance.yahoo.com/m/66e7e90c-bf91-3558-84cf-0e575c2a45bf/emerge%27s-2025-tech-trend-of.html","publisher":"decrypt","publishedAt":"2025-12-27T20:01:02.000Z","relatedTickers":[],"mainIdea":"Emerge's 2025 Tech Trend of The Year: Quantum Computing Stopped Being Background Noise","summary":"decrypt: Emerge's 2025 Tech Trend of The Year: Quantum Computing Stopped Being Background Noise. Advances in quantum computing this year clarified timelines and forced a reassessment of Bitcoin’s future security"},{"id":"3e3d253a-ea03-3c9d-bdae-3dfe50a3675b","title":"Why Analysts Remain Split on Domo, Inc. (DOMO)","url":"https://finance.yahoo.com/news/why-analysts-remain-split-domo-124316317.html","publisher":"Insider Monkey","publishedAt":"2025-12-27T12:43:16.000Z","relatedTickers":["CFLT","DATB.PVT","DOMO","SNOW"],"mainIdea":"Why Analysts Remain Split on Domo, Inc. (DOMO)","summary":"Insider Monkey: Why Analysts Remain Split on Domo, Inc. (DOMO). Domo, Inc. (NASDAQ:DOMO) is among the Best Get Rich Fast Stocks to Buy Right Now. On December 24, Tom Blakey from Cantor Fitzgerald assumed coverage on Domo, Inc. (NASDAQ:DOMO) with an ‘Overweight’ rating and a price target of $22, according to TheFly. This reaffirmation follows the firm’s revised research coverage for the Security & Infrastructure Software […] Related tickers mentioned: CFLT, DATB.PVT, DOMO, SNOW."},{"id":"1456670d-557d-3bf1-9015-2f9451186a12","title":"Oracle Veteran Appointment Sends CID HoldCo Shares Up Nearly 24% After Hours","url":"https://finance.yahoo.com/news/oracle-veteran-appointment-sends-cid-043010048.html","publisher":"Benzinga","publishedAt":"2025-12-27T04:30:10.000Z","relatedTickers":["DAIC","ORCL"],"mainIdea":"Oracle Veteran Appointment Sends CID HoldCo Shares Up Nearly 24% After Hours","summary":"Benzinga: Oracle Veteran Appointment Sends CID HoldCo Shares Up Nearly 24% After Hours. CID HoldCo Inc. (NASDAQ:DAIC) shares rose 23.80% in after-hours trading on Tuesday to $1.04, following an amended Securities and Exchange Commission filing detailing a C-suite leadership change. Oracle Veteran Named CRO The company named Delores Rochester as Chief Revenue Officer, effective Jan. 5, 2026, according to Tuesday's filing. She succeeds Robert Reny, who was removed on Dec. 12; the SEC filing noted his departure involved no accounting disagreements with the company. Don't Miss: If ther Related tickers mentioned: DAIC, ORCL."}]}
