{"symbol":"IBM","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:18.187Z","asOfDate":"2025-12-22","articles":[{"id":"b6089725-3cbc-30ab-bfab-4d5614429499","title":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","url":"https://finance.yahoo.com/news/ter-vs-amd-ai-component-163800705.html","publisher":"Zacks","publishedAt":"2025-12-22T16:38:00.000Z","relatedTickers":["AMD","TER"],"mainIdea":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","summary":"Zacks: TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?. Teradyne Related tickers mentioned: AMD, TER."},{"id":"dcfe0d1e-756c-37cb-b7ca-dd3b9756d27a","title":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","url":"https://finance.yahoo.com/news/warner-bros-bidding-war-red-161251059.html","publisher":"Reuters","publishedAt":"2025-12-22T16:12:51.000Z","relatedTickers":["CFLT","TATE.PVT","WBD"],"mainIdea":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","summary":"Reuters: Warner Bros bidding war and red hot M&A market has dealmakers working through holidays. A flurry of multi-billion-dollar deals has bankers and advisers from Wall Street to Canary Wharf packing laptops next to presents and warning family and friends their holiday vacations over the next two weeks will be cut short. There have been $463.6 billion ​in mergers and acquisitions announced this month, 30% more than last year, including Trump Media & Technology Group Related tickers mentioned: CFLT, TATE.PVT, WBD."},{"id":"cf7d533e-fd53-31af-8a72-a0568deecd2e","title":"IBM Leans on AI, Acquisitions, and Partnerships to Drive Growth","url":"https://finance.yahoo.com/news/ibm-leans-ai-acquisitions-partnerships-154559337.html","publisher":"Insider Monkey","publishedAt":"2025-12-22T15:45:59.000Z","relatedTickers":["SAP"],"mainIdea":"IBM Leans on AI, Acquisitions, and Partnerships to Drive Growth","summary":"Insider Monkey: IBM Leans on AI, Acquisitions, and Partnerships to Drive Growth. International Business Machines Corporation (NYSE:IBM) is included among the 13 Top Tech Stocks Paying Consistent Dividends. IBM has been working on AI for decades. That long game is starting to show up in the stock. Shares are up nearly 38% so far this year. To keep pushing its AI strategy, International Business Machines Corporation (NYSE:IBM) […] Related tickers mentioned: SAP."}]}
