{"symbol":"IBM","provider":"yahoo-finance","fetchedAt":"2025-12-23T15:59:05.489Z","asOfDate":"2025-12-23","articles":[{"id":"54d8858c-0d01-38ef-91e3-910033905cca","title":"Is Digi International (DGII) Stock Outpacing Its Computer and Technology Peers This Year?","url":"https://finance.yahoo.com/news/digi-international-dgii-stock-outpacing-144003764.html","publisher":"Zacks","publishedAt":"2025-12-23T14:40:03.000Z","relatedTickers":["DGII"],"mainIdea":"Is Digi International (DGII) Stock Outpacing Its Computer and Technology Peers This Year?","summary":"Zacks: Is Digi International (DGII) Stock Outpacing Its Computer and Technology Peers This Year?. Here is how Digi International (DGII) and IBM (IBM) have performed compared to their sector so far this year. Related tickers mentioned: DGII."},{"id":"99431ddf-6edd-36db-9d40-21565c0b204d","title":"dLocal completes transition to a majority independent Board with appointments of Paco Ybarra and Nelson Mattos","url":"https://finance.yahoo.com/news/dlocal-completes-transition-majority-independent-130000381.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T13:00:00.000Z","relatedTickers":["DLO","MNGPF"],"mainIdea":"dLocal completes transition to a majority independent Board with appointments of Paco Ybarra and Nelson Mattos","summary":"GlobeNewswire: dLocal completes transition to a majority independent Board with appointments of Paco Ybarra and Nelson Mattos. MONTEVIDEO, Uruguay, Dec. 23, 2025 (GLOBE NEWSWIRE) -- dLocal Limited (“dLocal”, the “company”, “we”, “us”, and “our”) (NASDAQ:DLO), a leading financial technology company powering payments across emerging markets, today announced it has completed the transition to a nine-person, majority independent Board of Directors, now comprising five independent members. Following through on the governance update shared in August during its second quarter earnings presentation, dLocal has appointed Paco Yb Related tickers mentioned: DLO, MNGPF."},{"id":"b5f61dec-e9c2-3335-a5c9-9fb7761368d8","title":"AI Hardware Market Set to Witness 31.2% CAGR During 2025-2035, Growing by $593 Billion - Energy-Efficient Hardware, Custom AI Chipsets, and Storage Accelerators Present Lucrative Opportunities","url":"https://finance.yahoo.com/news/ai-hardware-market-set-witness-121400108.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T12:14:00.000Z","relatedTickers":[],"mainIdea":"AI Hardware Market Set to Witness 31.2% CAGR During 2025-2035, Growing by $593 Billion - Energy-Efficient Hardware, Custom AI Chipsets, and Storage Accelerators Present Lucrative Opportunities","summary":"GlobeNewswire: AI Hardware Market Set to Witness 31.2% CAGR During 2025-2035, Growing by $593 Billion - Energy-Efficient Hardware, Custom AI Chipsets, and Storage Accelerators Present Lucrative Opportunities. The market offers substantial opportunities driven by increasing demand for high-performance AI solutions and advancements in semiconductor technology. Growth is anticipated across sectors with cloud deployment, processors, and automotive applications leading, while Asia’s market share is set to rise significantly.Dublin, Dec. 23, 2025 (GLOBE NEWSWIRE) -- The \"AI Hardware Market Till 2035: Industry Trends and Global Forecasts\" has been added to ResearchAndMarkets.com's offering. The global AI ha"},{"id":"6306c3e6-bc9e-398b-850f-2ec3ef7c9b9b","title":"Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?","url":"https://finance.yahoo.com/news/quantum-stocks-2026-ionq-qbts-200000618.html","publisher":"Zacks","publishedAt":"2025-12-22T20:00:00.000Z","relatedTickers":["IONQ","NVDA","QBTS"],"mainIdea":"Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?","summary":"Zacks: Quantum Stocks 2026: Can IONQ & QBTS Follow NVDA's Playbook?. IonQ and D-Wave are gaining momentum in 2026 as quantum computing attracts billions in public and corporate funding. Related tickers mentioned: IONQ, NVDA, QBTS."},{"id":"b6089725-3cbc-30ab-bfab-4d5614429499","title":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","url":"https://finance.yahoo.com/news/ter-vs-amd-ai-component-163800705.html","publisher":"Zacks","publishedAt":"2025-12-22T16:38:00.000Z","relatedTickers":["AMD","TER"],"mainIdea":"TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?","summary":"Zacks: TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?. Teradyne's AI-driven test systems and stronger earnings surprises give TER an edge over Advanced Micro Devices in the fast-growing AI semiconductor supply chain. Related tickers mentioned: AMD, TER."},{"id":"dcfe0d1e-756c-37cb-b7ca-dd3b9756d27a","title":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","url":"https://finance.yahoo.com/news/warner-bros-bidding-war-red-161251059.html","publisher":"Reuters","publishedAt":"2025-12-22T16:12:51.000Z","relatedTickers":["CFLT","TATE.PVT","WBD"],"mainIdea":"Warner Bros bidding war and red hot M&A market has dealmakers working through holidays","summary":"Reuters: Warner Bros bidding war and red hot M&A market has dealmakers working through holidays. A flurry of multi-billion-dollar deals has bankers and advisers from Wall Street to Canary Wharf packing laptops next to presents and warning family and friends their holiday vacations over the next two weeks will be cut short. There have been $463.6 billion ​in mergers and acquisitions announced this month, 30% more than last year, including Trump Media & Technology Group's $6 billion merger with nuclear fusion firm TAE Technologies, IBM's $11 ‌billion purchase of data infrastructure company Confluent and a bidding war between Paramount Skydance and Netflix for Warner Bros Discovery, according to data compiled by Dealogic. Related tickers mentioned: CFLT, TATE.PVT, WBD."}]}
