{"symbol":"IBM","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:29:11.700Z","asOfDate":"2025-12-25","articles":[{"id":"748752e0-71f4-3e5b-94e1-cf2670783c10","title":"DOE’s ‘Genesis Mission’ Enlists AI to Double U.S. Research Productivity in a Decade","url":"https://finance.yahoo.com/m/748752e0-71f4-3e5b-94e1-cf2670783c10/doe%E2%80%99s-%E2%80%98genesis-mission%E2%80%99.html","publisher":"POWER Magazine","publishedAt":"2025-12-25T14:26:30.000Z","relatedTickers":[],"mainIdea":"DOE’s ‘Genesis Mission’ Enlists AI to Double U.S. Research Productivity in a Decade","summary":"POWER Magazine: DOE’s ‘Genesis Mission’ Enlists AI to Double U.S. Research Productivity in a Decade. The U.S. Department of Energy (DOE) has launched the “Genesis Mission,” a national effort to build an integrated artificial intelligence (AI) platform across its 17 national laboratories. According to The White House, the initiative will “accelerate scientific discovery, strengthen national security, secure energy dominance, enhance workforce productivity, and multiply the return on taxpayer investment into […]"},{"id":"c76863b5-c2f1-3dad-b559-bea709196d57","title":"Kyndryl Holdings (KD) Fell Following Weak Bookings","url":"https://finance.yahoo.com/news/kyndryl-holdings-kd-fell-following-123957774.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T12:39:57.000Z","relatedTickers":["KD"],"mainIdea":"Kyndryl Holdings (KD) Fell Following Weak Bookings","summary":"Insider Monkey: Kyndryl Holdings (KD) Fell Following Weak Bookings. Loomis Sayles, an investment management company, released its “Small Cap Value Fund” third-quarter 2025 investor letter. A copy of the letter can be downloaded here. US equities delivered strong results in the third quarter, mainly driven by easing tariff concerns, a pro-growth budget passed by the U.S. Congress, and anticipation of the Federal Reserve’s further […] Related tickers mentioned: KD."},{"id":"ba84deed-64ec-3f33-af71-2f2215b92274","title":"Agios Pharmaceuticals price target raised to $34 from $32 at BofA","url":"https://finance.yahoo.com/news/agios-pharmaceuticals-price-target-raised-110533493.html","publisher":"TipRanks","publishedAt":"2025-12-25T11:05:33.000Z","relatedTickers":["AGIO"],"mainIdea":"Agios Pharmaceuticals price target raised to $34 from $32 at BofA","summary":"TipRanks: Agios Pharmaceuticals price target raised to $34 from $32 at BofA. BofA raised the firm’s price target on Agios Pharmaceuticals (AGIO) to $34 from $32 and keeps a Buy rating on the shares following FDA approval for mitapivat to make it the only drug approved in both transfusion-dependent and non-transfusion-dependent alpha- or beta- thalassemia. The REMS and black box for hepatocellular injury were in line with the firm’s expectations and BofA doesn’t expect this to impact uptake, the analyst tells investors.Claim 70% Off TipRanks This Holiday SeasonUnlock hedg Related tickers mentioned: AGIO."},{"id":"1796e503-192b-3687-b870-75593a851d97","title":"Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER","url":"https://finance.yahoo.com/news/quantum-enablers-poised-40-plus-200000520.html","publisher":"Zacks","publishedAt":"2025-12-23T20:00:00.000Z","relatedTickers":["AVGO","INTC","IONQ","LMT","QBTS","TER"],"mainIdea":"Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER","summary":"Zacks: Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER. INTC, AVGO and TER stand out as quantum enablers, already generating revenues and projected to deliver 40%+ earnings growth in 2026. Related tickers mentioned: AVGO, INTC, IONQ, LMT, QBTS, TER."},{"id":"1666e143-0148-3fa4-959a-6053221e2416","title":"Is Palo Alto Networks Stock a Buy, Sell, or Hold Following Its Major Multibillion-Dollar Google Deal?","url":"https://finance.yahoo.com/m/1666e143-0148-3fa4-959a-6053221e2416/is-palo-alto-networks-stock-a.html","publisher":"Barchart","publishedAt":"2025-12-23T16:18:02.000Z","relatedTickers":["GOOG","PANW"],"mainIdea":"Is Palo Alto Networks Stock a Buy, Sell, or Hold Following Its Major Multibillion-Dollar Google Deal?","summary":"Barchart: Is Palo Alto Networks Stock a Buy, Sell, or Hold Following Its Major Multibillion-Dollar Google Deal?. Palo Alto Networks is a large-cap tech stock that continues to grow revenue and earnings steadily. Is PANW stock still a good buy? Related tickers mentioned: GOOG, PANW."},{"id":"71900056-2d51-3bc1-bb6c-8e62c26c26eb","title":"monday.com (MNDY) Q1 2025 Earnings Call Transcript","url":"https://finance.yahoo.com/m/71900056-2d51-3bc1-bb6c-8e62c26c26eb/monday.com-%28mndy%29-q1-2025.html","publisher":"Motley Fool","publishedAt":"2025-12-23T16:15:46.000Z","relatedTickers":[],"mainIdea":"monday.com (MNDY) Q1 2025 Earnings Call Transcript","summary":"Motley Fool: monday.com (MNDY) Q1 2025 Earnings Call Transcript. Roy Mann: Thank you, Byron, and thank you, everyone for joining us today. In Q1, we delivered robust revenue growth of 30% year-over-year, achieved record quarterly operating profit and generated our highest-ever cash flow for a single quarter. As of the end of Q1, we've seen our user perform more than 26 million AI actions to date, up more than 150% since the end of 2024."}]}
