{"symbol":"PANW","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:55.322Z","asOfDate":"2025-12-24","articles":[{"id":"a940a17f-31e1-371f-94ee-d9b1c4d13b73","title":"Options trading: This analyst's calls on Palo Alto, TJX, SoFi","url":"https://finance.yahoo.com/video/options-trading-analysts-calls-palo-181022959.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-24T18:10:22.000Z","relatedTickers":["MSLH.L","SOFI","TJX","^GSPC"],"mainIdea":"Options trading: This analyst's calls on Palo Alto, TJX, SoFi","summary":"Yahoo Finance Video: Options trading: This analyst's calls on Palo Alto, TJX, SoFi. As part of the latest installment of Yahoo Finance's Options Playbook, Prosper Trading Academy CEO Scott Bauer sits down with Josh Lipton to discuss his covered call options strategy around shares of Palo Alto Networks (PANW), Marshalls parent company TJX (TJX), and SoFi Technologies (SOFI) as the 2025 trading years soon draws to a close. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Domination. Related tickers mentioned: MSLH.L, SOFI, TJX, ^GSPC."},{"id":"32d9e845-20d0-3fb3-b1ea-8efb3c36ca77","title":"Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.","url":"https://finance.yahoo.com/m/32d9e845-20d0-3fb3-b1ea-8efb3c36ca77/mergers-%26-acquisitions-soared.html","publisher":"Barrons.com","publishedAt":"2025-12-24T14:41:00.000Z","relatedTickers":["AMZN","CRWD","CYBR","GOOG","NFLX"],"mainIdea":"Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.","summary":"Barrons.com: Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.. Mergers and acquisitions rose this year — and they can keep rising. Total M&A dollars so far this year rose to $4.39 trillion, according to data from London Stock Exchange Group. The increase in aggregate deal value is driven by larger deals, with the number of deals fairly stable. Related tickers mentioned: AMZN, CRWD, CYBR, GOOG, NFLX."},{"id":"e564730c-630c-33c4-b0b9-dbab6a708e72","title":"Snowflake In Talks To Buy Observe Amid AI Acquisition Spree","url":"https://finance.yahoo.com/m/e564730c-630c-33c4-b0b9-dbab6a708e72/snowflake-in-talks-to-buy.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T13:01:58.000Z","relatedTickers":["CSCO","DDOG","DT","SNOW"],"mainIdea":"Snowflake In Talks To Buy Observe Amid AI Acquisition Spree","summary":"Investor's Business Daily: Snowflake In Talks To Buy Observe Amid AI Acquisition Spree. Snowflake reportedly is in talks to buy startup Observe, a deal that would add to its artificial intelligence acquisition spree. Related tickers mentioned: CSCO, DDOG, DT, SNOW."},{"id":"1e5c58a7-1a75-3dd7-adfd-7a23ef892dbd","title":"Broadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.","url":"https://finance.yahoo.com/m/1e5c58a7-1a75-3dd7-adfd-7a23ef892dbd/broadcom-%28avgo%29-stock-options.html","publisher":"Barchart","publishedAt":"2025-12-23T18:30:02.000Z","relatedTickers":["AVGO"],"mainIdea":"Broadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.","summary":"Barchart: Broadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.. With the unusual options activity screener hedged for kinetic uncertainty, AVGO stock could present a sophisticated contrarian case for intrepid speculators. Related tickers mentioned: AVGO."},{"id":"8035e35c-3523-3938-a851-8ba52087f1e9","title":"Occidental Petroleum Stock Has Tanked - But It May Hike Its Dividend - Time to Buy?","url":"https://finance.yahoo.com/m/8035e35c-3523-3938-a851-8ba52087f1e9/occidental-petroleum-stock.html","publisher":"Barchart","publishedAt":"2025-12-23T18:26:04.000Z","relatedTickers":["OXY"],"mainIdea":"Occidental Petroleum Stock Has Tanked - But It May Hike Its Dividend - Time to Buy?","summary":"Barchart: Occidental Petroleum Stock Has Tanked - But It May Hike Its Dividend - Time to Buy?. Occidental Petroleum Corp could hike its dividend in late January or early February. But OXY stock is still well off its highs. Based on its average dividend yield, OXY could be worth over 25% more at $50 per share. Related tickers mentioned: OXY."}]}
