{"symbol":"HON","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:22:24.269Z","asOfDate":"2025-12-23","articles":[{"id":"521277ea-a340-38ea-93e4-d9c2caf5d6ec","title":"FIH Achieves ISO 26262 and ISO/SAE 21434 Dual Certifications from DEKRA, Strengthening Automotive Safety and Cybersecurity Capabilities","url":"https://finance.yahoo.com/news/fih-achieves-iso-26262-iso-080700818.html","publisher":"PR Newswire","publishedAt":"2025-12-23T08:07:00.000Z","relatedTickers":["601138.SS"],"mainIdea":"FIH Achieves ISO 26262 and ISO/SAE 21434 Dual Certifications from DEKRA, Strengthening Automotive Safety and Cybersecurity Capabilities","summary":"PR Newswire: FIH Achieves ISO 26262 and ISO/SAE 21434 Dual Certifications from DEKRA, Strengthening Automotive Safety and Cybersecurity Capabilities. FIH, a subsidiary of Hon Hai Technology Group (Foxconn), announced that its key automotive electronics product, the Telematics Control Unit (TCU), has successfully passed DEKRA process certification and obtained both ISO 26262 Functional Safety certification and ISO/SAE 21434 Automotive Cybersecurity certification. This milestone places FIH among a limited number of companies in the TCU domain to concurrently obtain both certifications, significantly reinforcing its strategic role in the global Related tickers mentioned: 601138.SS."},{"id":"d80d82e3-0586-3cfb-b69a-b7ae3f006ff7","title":"3 Asian Stocks Estimated To Be Trading At Discounts Of Up To 37%","url":"https://finance.yahoo.com/news/3-asian-stocks-estimated-trading-043754118.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T04:37:54.000Z","relatedTickers":["301589.SZ","4417.T","CPHGF","DSKYF","JNDOF","KURRF","MEIUF"],"mainIdea":"3 Asian Stocks Estimated To Be Trading At Discounts Of Up To 37%","summary":"Simply Wall St.: 3 Asian Stocks Estimated To Be Trading At Discounts Of Up To 37%. Amid recent developments in Asia's financial landscape, including the Bank of Japan raising its benchmark interest rate to a 30-year high and mixed signals from China's economic indicators, investors are keenly observing opportunities for value in the region. In this context, identifying stocks that are trading at a discount can be particularly appealing, as they may offer potential upside when market conditions stabilize or improve. Related tickers mentioned: 301589.SZ, 4417.T, CPHGF, DSKYF, JNDOF, KURRF, MEIUF."},{"id":"1ad389f7-526b-3e1e-a4d5-4d9980a199fa","title":"Fight between Waymo and Santa Monica goes to court","url":"https://finance.yahoo.com/m/1ad389f7-526b-3e1e-a4d5-4d9980a199fa/fight-between-waymo-and-santa.html","publisher":"LA Times","publishedAt":"2025-12-23T00:39:13.000Z","relatedTickers":[],"mainIdea":"Fight between Waymo and Santa Monica goes to court","summary":"LA Times: Fight between Waymo and Santa Monica goes to court. Waymo has filed suit against the city of Santa Monica, arguing that the city's attempt to have them stop using two charging stations overnight for its fleet of self-driving cars is unfair."}]}
