{"symbol":"HON","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:47.945Z","asOfDate":"2025-12-25","articles":[{"id":"b03b4c13-c615-3e7e-9a47-0f0c54153992","title":"Quantum computing is the stock market’s next big tech play — and these stocks are still cheap","url":"https://finance.yahoo.com/m/b03b4c13-c615-3e7e-9a47-0f0c54153992/quantum-computing-is-the.html","publisher":"MarketWatch","publishedAt":"2025-12-24T16:03:00.000Z","relatedTickers":["GOOG"],"mainIdea":"Quantum computing is the stock market’s next big tech play — and these stocks are still cheap","summary":"MarketWatch: Quantum computing is the stock market’s next big tech play — and these stocks are still cheap. Quantum stocks are where AI was five years ago — and the science actually works. Related tickers mentioned: GOOG."},{"id":"50da9ef9-151c-37d8-8ebd-67c54315a7cd","title":"3 Asian Stocks That May Be Trading Below Estimated Value In December 2025","url":"https://finance.yahoo.com/news/3-asian-stocks-may-trading-043804868.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T04:38:04.000Z","relatedTickers":["1415.HK","301589.SZ","DSKYF","KURRF","MRCHF","SNYYF"],"mainIdea":"3 Asian Stocks That May Be Trading Below Estimated Value In December 2025","summary":"Simply Wall St.: 3 Asian Stocks That May Be Trading Below Estimated Value In December 2025. As the Bank of Japan raises its benchmark interest rate to levels not seen in three decades, Asian markets are navigating a complex landscape marked by fluctuating economic indicators and monetary policy shifts. Amid these developments, identifying stocks that may be trading below their estimated value can present opportunities for investors seeking to capitalize on potential market inefficiencies. Related tickers mentioned: 1415.HK, 301589.SZ, DSKYF, KURRF, MRCHF, SNYYF."},{"id":"a28ba2b5-c622-33a4-9ed7-ffb8b3ce52f5","title":"3 Asian Stocks Estimated To Be Trading Below Fair Value By Up To 49.5%","url":"https://finance.yahoo.com/news/3-asian-stocks-estimated-trading-223451581.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T22:34:51.000Z","relatedTickers":["301589.SZ","DSKYF","KURRF","MCRPF","MRCHF","SNYYF"],"mainIdea":"3 Asian Stocks Estimated To Be Trading Below Fair Value By Up To 49.5%","summary":"Simply Wall St.: 3 Asian Stocks Estimated To Be Trading Below Fair Value By Up To 49.5%. As global markets navigate a complex landscape marked by interest rate adjustments and mixed economic signals, Asia's stock markets have faced their own set of challenges, with Japan experiencing significant rate hikes and China's growth indicators showing signs of stagnation. In this environment, identifying undervalued stocks can be particularly appealing to investors looking for opportunities that may offer potential value relative to current market valuations. Related tickers mentioned: 301589.SZ, DSKYF, KURRF, MCRPF, MRCHF, SNYYF."}]}
