{"symbol":"HBAN","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:50:00.937Z","asOfDate":"2025-12-23","articles":[{"id":"fb4f7c85-617b-32fa-8e20-53c047d0b5ea","title":"Cadence Bank, Huntington Bancshares get regulatory approval for merger","url":"https://finance.yahoo.com/news/cadence-bank-huntington-bancshares-regulatory-222512817.html","publisher":"TipRanks","publishedAt":"2025-12-23T22:25:12.000Z","relatedTickers":[],"mainIdea":"Cadence Bank, Huntington Bancshares get regulatory approval for merger","summary":"TipRanks: Cadence Bank, Huntington Bancshares get regulatory approval for merger. Huntington Bancshares (HBAN) and Cadence Bank (CADE) “jointly announced that the Office of the Comptroller of the Currency has approved the proposed merger of Cadence Bank with and into The Huntington National Bank, with The Huntington National Bank as the surviving bank. All required regulatory approvals to complete the Huntington-Cadence transaction have now been received. The merger is expected to close on February 1, 2026, subject to the receipt of shareholder approvals and the satisfaction"},{"id":"0db620b5-ca61-3ae7-a8c7-91c1875faf83","title":"Huntington Secures OCC Regulatory Green Light for Cadence Merger","url":"https://finance.yahoo.com/news/huntington-secures-occ-regulatory-green-170800063.html","publisher":"Zacks","publishedAt":"2025-12-23T17:08:00.000Z","relatedTickers":["CADE","CADE-PA","KKR","KKR-PD","PNC"],"mainIdea":"Huntington Secures OCC Regulatory Green Light for Cadence Merger","summary":"Zacks: Huntington Secures OCC Regulatory Green Light for Cadence Merger. HBAN secures OCC approval to merge with CADE, expanding its Southern U.S. footprint and positioning for a February 2026 close. Related tickers mentioned: CADE, CADE-PA, KKR, KKR-PD, PNC."},{"id":"acdbfe9a-a10d-36a8-bbc5-ecef43a4d454","title":"Huntington Bancshares, Cadence Bank Get Regulatory Approval for Merger","url":"https://finance.yahoo.com/news/huntington-bancshares-cadence-bank-regulatory-230122612.html","publisher":"MT Newswires","publishedAt":"2025-12-22T23:01:22.000Z","relatedTickers":["CADE"],"mainIdea":"Huntington Bancshares, Cadence Bank Get Regulatory Approval for Merger","summary":"MT Newswires: Huntington Bancshares, Cadence Bank Get Regulatory Approval for Merger. Huntington Bancshares' (HBAN) planned merger with Cadence Bank (CADE) has received approval from the Related tickers mentioned: CADE."},{"id":"0b2f39da-0d9b-35c6-9da4-bb6641fe8354","title":"Huntington Bancshares Incorporated and Cadence Bank Announce Receipt of Required Regulatory Approval for Pending Merger","url":"https://finance.yahoo.com/news/huntington-bancshares-incorporated-cadence-bank-222000334.html","publisher":"PR Newswire","publishedAt":"2025-12-22T22:20:00.000Z","relatedTickers":["CADE","CADE-PA","HBANL","HBANM","HBANP"],"mainIdea":"Huntington Bancshares Incorporated and Cadence Bank Announce Receipt of Required Regulatory Approval for Pending Merger","summary":"PR Newswire: Huntington Bancshares Incorporated and Cadence Bank Announce Receipt of Required Regulatory Approval for Pending Merger. Huntington Bancshares Incorporated (Nasdaq: HBAN); (\"Huntington\") and Cadence Bank (NYSE: CADE); (\"Cadence\") jointly announced that the Office of the Comptroller of the Currency has approved the proposed merger of Cadence Bank with and into The Huntington National Bank, with The Huntington National Bank as the surviving bank. Related tickers mentioned: CADE, CADE-PA, HBANL, HBANM, HBANP."},{"id":"8d6ce1a7-7da6-3967-b909-74efdd6796b7","title":"Sector Update: Financial Stocks Advance Late Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-advance-afternoon-210207709.html","publisher":"MT Newswires","publishedAt":"2025-12-19T21:02:07.000Z","relatedTickers":["BTC-USD","XLF","XLRE"],"mainIdea":"Sector Update: Financial Stocks Advance Late Afternoon","summary":"MT Newswires: Sector Update: Financial Stocks Advance Late Afternoon. Financial stocks were advancing in late Friday afternoon trading, with the NYSE Financial Index addi Related tickers mentioned: BTC-USD, XLF, XLRE."}]}
