{"symbol":"HBAN","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:11.338Z","asOfDate":"2025-12-22","articles":[{"id":"8d6ce1a7-7da6-3967-b909-74efdd6796b7","title":"Sector Update: Financial Stocks Advance Late Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-advance-afternoon-210207709.html","publisher":"MT Newswires","publishedAt":"2025-12-19T21:02:07.000Z","relatedTickers":["BTC-USD","XLF","XLRE"],"mainIdea":"Sector Update: Financial Stocks Advance Late Afternoon","summary":"MT Newswires: Sector Update: Financial Stocks Advance Late Afternoon. Financial stocks were advancing in late Friday afternoon trading, with the NYSE Financial Index addi Related tickers mentioned: BTC-USD, XLF, XLRE."},{"id":"567de782-86ea-3130-8788-f65f7fefbefa","title":"Sector Update: Financial","url":"https://finance.yahoo.com/news/sector-financial-204759160.html","publisher":"MT Newswires","publishedAt":"2025-12-19T20:47:59.000Z","relatedTickers":["BTC-USD","XLF","XLRE"],"mainIdea":"Sector Update: Financial","summary":"MT Newswires: Sector Update: Financial. Financial stocks were advancing in late Friday afternoon trading, with the NYSE Financial Index addi Related tickers mentioned: BTC-USD, XLF, XLRE."},{"id":"ae3bffc5-e2af-3759-9eda-2bc26f5147dc","title":"How The Cadence Deal And Growth Outlook Are Shaping The Huntington Bancshares Investment Story","url":"https://finance.yahoo.com/news/cadence-deal-growth-outlook-shaping-201301115.html","publisher":"Simply Wall St.","publishedAt":"2025-12-19T20:13:01.000Z","relatedTickers":["HBANL","HBANM","HBANP"],"mainIdea":"How The Cadence Deal And Growth Outlook Are Shaping The Huntington Bancshares Investment Story","summary":"Simply Wall St.: How The Cadence Deal And Growth Outlook Are Shaping The Huntington Bancshares Investment Story. Huntington Bancshares has seen its fair value estimate nudged up to $19.85 from $19.75, as refreshed models incorporate slightly stronger growth assumptions following the Cadence acquisition and recent results. A marginal decline in the discount rate to 7.29% from 7.32% reflects a modestly lower perceived risk profile, while revenue growth expectations have inched higher to about 25.11% from 25.02% on a firmer outlook for loan expansion in faster growing markets. Stay tuned to see how you can... Related tickers mentioned: HBANL, HBANM, HBANP."}]}
