{"symbol":"QQQ","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:15.791Z","asOfDate":"2025-12-27","articles":[{"id":"14f280ec-f0c0-35ab-8f0f-878d11a1faf1","title":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","url":"https://finance.yahoo.com/news/silver-jumps-6-platinum-8-160108318.html","publisher":"Benzinga","publishedAt":"2025-12-27T16:01:08.000Z","relatedTickers":["PA=F","PL=F","SI=F"],"mainIdea":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","summary":"Benzinga: Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?. While Wall Street traded in a subdued session marked by thin liquidity and low volumes following the Christmas market closure, price action turned wild across precious and industrial metals. By midday trading in New York, silver prices — as tracked by the iShares Silver Trust (NYSE:SLV) — surged more than 6%, breaking above $76 an ounce, fueled by an intensifying supply crunch across Asian markets. The move pushed silver's year-to-date gains to roughly 164%, marking the metal's strongest annual Related tickers mentioned: PA=F, PL=F, SI=F."},{"id":"8a38e651-70d7-3476-a12a-322394c9cf95","title":"Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession","url":"https://finance.yahoo.com/news/biden-boom-vs-trump-freeze-153051202.html","publisher":"Benzinga","publishedAt":"2025-12-27T15:30:51.000Z","relatedTickers":[],"mainIdea":"Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession","summary":"Benzinga: Biden Boom Vs. Trump Freeze: Paul Krugman Says We Traded Pro-Worker Recovery For K-Shaped Recession. Economist Paul Krugman warns that the United States has traded the inclusive, pro-worker recovery of the Joe Biden years for a stratified “Trump freeze,” creating a new K-shaped economy where the wealthy thrive while the working class falls behind. Reversal Of Fortune In a new analysis, Krugman challenges the “lazy cynicism” that economic inequality is an unchangeable constant in American life. He points to Atlanta Fed data showing that the Biden presidency presided over a rare “Great Compressio"},{"id":"c3ba5fcf-0b32-373b-b3c7-56fb9b5abd04","title":"TQQQ vs. QLD: Which High-Risk, High-Reward Leveraged ETF Is the Better Buy for Investors?","url":"https://finance.yahoo.com/m/c3ba5fcf-0b32-373b-b3c7-56fb9b5abd04/tqqq-vs.-qld%3A-which.html","publisher":"Motley Fool","publishedAt":"2025-12-27T11:20:01.000Z","relatedTickers":["TQQQ"],"mainIdea":"TQQQ vs. QLD: Which High-Risk, High-Reward Leveraged ETF Is the Better Buy for Investors?","summary":"Motley Fool: TQQQ vs. QLD: Which High-Risk, High-Reward Leveraged ETF Is the Better Buy for Investors?. Explore how TQQQ's structure and risk profile set it apart from QLD for investors considering leveraged Nasdaq-100 exposure. Related tickers mentioned: TQQQ."}]}
