{"symbol":"DHR","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:22.287Z","asOfDate":"2025-12-26","articles":[{"id":"960aae48-0fd4-3f41-9943-27331972735a","title":"Daily Spotlight: Three Signals from Dividend Growth","url":"https://finance.yahoo.com/m/960aae48-0fd4-3f41-9943-27331972735a/daily-spotlight%3A-three.html","publisher":"Argus Research","publishedAt":"2025-12-24T12:11:42.000Z","relatedTickers":["^GSPC"],"mainIdea":"Daily Spotlight: Three Signals from Dividend Growth","summary":"Argus Research: Daily Spotlight: Three Signals from Dividend Growth. Since 1988, the dividends of companies in the S&P 500 index have grown on average 6% per year, faster than long-term GDP growth and testament to the fundamental soundness of corporate America. But rates have varied sharply over the years, and from year to year. At times, the dividend growth rate has been zero or negative (during the \"dot-com\" implosion in the early 2000s; the bear market of 2008-09; and the COVID-19 pandemic). At the other end of the spectrum, the average dividend growth rate has been 10% or above in 12 of the past 36 years. More recently, dividend growth accelerated to 9% in 2018-19, which was a good period for stocks as trade wars settled and the Federal Reserve took a dovish stance on interest rates. But dividend growth slowed sharply in 2020, due to the pandemic, and growth has been in the 5%-6% range in the past two years. At this stage of the economic and market cycles, we recommend that investors focus on dividend growth instead of dividend yield. Specifically, we are bullish on companies that have boosted their dividend at high growth rates for many years consecutively. Even during the pandemic and the ensuing periods of supply-chain snags and high inflation, our analysts noted that a number of high-quality, well-managed companies continued to raise their dividends at double-digit rates as part of their value proposition to investors. We think this type of consistent -- and accelerated -- dividend growth gives three important signals: a company's balance sheet is strong enough to pay a dividend; management is mindful of shareholder returns, which include dividends; and management is telling investors that the near-term outlook for the company is promising. Related tickers mentioned: ^GSPC."},{"id":"a4f523f3-84f7-373a-92a8-0c7085f8b1f5","title":"Q3 Research Tools & Consumables Earnings: Sotera Health Company (NASDAQ:SHC) Earns Top Marks","url":"https://finance.yahoo.com/news/q3-research-tools-consumables-earnings-033654267.html","publisher":"StockStory","publishedAt":"2025-12-24T03:36:54.000Z","relatedTickers":["SHC"],"mainIdea":"Q3 Research Tools & Consumables Earnings: Sotera Health Company (NASDAQ:SHC) Earns Top Marks","summary":"StockStory: Q3 Research Tools & Consumables Earnings: Sotera Health Company (NASDAQ:SHC) Earns Top Marks. As the craze of earnings season draws to a close, here’s a look back at some of the most exciting (and some less so) results from Q3. Today, we are looking at research tools & consumables stocks, starting with Sotera Health Company (NASDAQ:SHC). Related tickers mentioned: SHC."},{"id":"41c228ec-ae8f-38a0-b966-91ac28962aab","title":"The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider","url":"https://finance.yahoo.com/m/41c228ec-ae8f-38a0-b966-91ac28962aab/the-bill-gates-portfolio%3A-3.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-23T16:40:38.000Z","relatedTickers":["DE","MCD","MSFT"],"mainIdea":"The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider","summary":"24/7 Wall St.: The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider. Microsoft (NASDAQ:MSFT) founder Bill gates is best-known for his founding of the most valuable company in the world (on multiple occasions, just not now). And rightfully so. That said, over the years, Bill Gates has adjusted his portfolio holdings, choosing to divest in a range of companies via his own personal portfolio but also via his ... The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider Related tickers mentioned: DE, MCD, MSFT."}]}
