{"symbol":"USB","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:21:19.463Z","asOfDate":"2025-12-23","articles":[{"id":"a06d142c-b77e-397f-b336-09fda8ccfd2f","title":"Vadzo Imaging Launches 20MP Monochrome USB3.2 Gen1 Camera Based on Onsemi AR2020 HyperLux Sensor","url":"https://finance.yahoo.com/news/vadzo-imaging-launches-20mp-monochrome-160000210.html","publisher":"ACCESS Newswire","publishedAt":"2025-12-23T16:00:00.000Z","relatedTickers":[],"mainIdea":"Vadzo Imaging Launches 20MP Monochrome USB3.2 Gen1 Camera Based on Onsemi AR2020 HyperLux Sensor","summary":"ACCESS Newswire: Vadzo Imaging Launches 20MP Monochrome USB3.2 Gen1 Camera Based on Onsemi AR2020 HyperLux Sensor. 5K UHD Resolution | Dynamic ROI | Enhanced Dynamic Range | Excellent NIR Sensitivity | Compact Camera Design | Wake on Motion | USB3.2 Gen1 UVC Camera FORT WORTH, TEXAS / ACCESS Newswire / December 23, 2025 / Vadzo Imaging, a global leader in embedded ..."},{"id":"4d02119b-9baa-3707-9ba9-cfc39cbde656","title":"Lifevibe VAT Chair Prime®- The World's First Consumer-Grade Vibroacoustic Therapy Chair Officially Launched","url":"https://finance.yahoo.com/news/lifevibe-vat-chair-prime-worlds-110000907.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T11:00:00.000Z","relatedTickers":[],"mainIdea":"Lifevibe VAT Chair Prime®- The World's First Consumer-Grade Vibroacoustic Therapy Chair Officially Launched","summary":"GlobeNewswire: Lifevibe VAT Chair Prime®- The World's First Consumer-Grade Vibroacoustic Therapy Chair Officially Launched. Montclair, CA, Dec. 23, 2025 (GLOBE NEWSWIRE) -- Lifevibe® has launched the Vibroacoustic Therapy Chair, the first consumer-grade vibroacoustic therapy chair (VAT Massage Chair) for home usage. This marks a significant milestone in wellness technology. The introduction represents a significant first-to-market breakthrough: clinically proven medical technology previously used in European rehabilitation centers is now available as an attractive, accessible, and engaging consumer product. With this"},{"id":"ef92a8a9-274a-3c22-a589-5a632c4991b1","title":"Is Boltz Retro Stick Legit? Examining Whether This Could Be the Best Retro Gaming Console as Plug-and-Play Demand Increases","url":"https://finance.yahoo.com/news/boltz-retro-stick-legit-examining-012900193.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T01:29:00.000Z","relatedTickers":[],"mainIdea":"Is Boltz Retro Stick Legit? Examining Whether This Could Be the Best Retro Gaming Console as Plug-and-Play Demand Increases","summary":"GlobeNewswire: Is Boltz Retro Stick Legit? Examining Whether This Could Be the Best Retro Gaming Console as Plug-and-Play Demand Increases. Compact HDMI Gaming Device Marketed for Plug-and-Play Access to Classic Game Emulators Raises Questions About Licensing, Performance, and Category Positioning for Consumers Evaluating Retro Gaming OptionsCommerce, Dec. 22, 2025 (GLOBE NEWSWIRE) -- This article contains affiliate links. If you purchase through these links, a commission may be earned at no additional cost to you. This compensation does not influence the accuracy, neutrality, or integrity of the information presented in this review"},{"id":"3ff36c59-e24f-3389-8df7-c1484396257c","title":"Boltz Retro Device: Handheld Gaming System Featuring Classic Titles Marketed for Holiday Travel Use","url":"https://finance.yahoo.com/news/boltz-retro-device-handheld-gaming-012300967.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T01:23:00.000Z","relatedTickers":[],"mainIdea":"Boltz Retro Device: Handheld Gaming System Featuring Classic Titles Marketed for Holiday Travel Use","summary":"GlobeNewswire: Boltz Retro Device: Handheld Gaming System Featuring Classic Titles Marketed for Holiday Travel Use. Offline Portable Device Features Thousands of Classic NES, SNES, Genesis, and PlayStation Games Without Wi-Fi or Downloads Required for Family TravelSAN FRANCISCO, Dec. 22, 2025 (GLOBE NEWSWIRE) -- Affiliate Disclosure: A commission may be earned if you purchase through links in this article, at no additional cost to you. As families prepare for holiday travel and look ahead to entertainment options for 2026, boltzretrodevice.com is marketing a handheld gaming system that comes pre-loaded with c"},{"id":"cd1021bd-2e64-30b3-963a-a699b6873661","title":"VIA Labs Expands Connectivity Portfolio with New Line of Industrial-Grade USB Hub Controllers","url":"https://finance.yahoo.com/news/via-labs-expands-connectivity-portfolio-230300273.html","publisher":"PR Newswire","publishedAt":"2025-12-22T23:03:00.000Z","relatedTickers":[],"mainIdea":"VIA Labs Expands Connectivity Portfolio with New Line of Industrial-Grade USB Hub Controllers","summary":"PR Newswire: VIA Labs Expands Connectivity Portfolio with New Line of Industrial-Grade USB Hub Controllers. VIA Labs, Inc. (VLI), a leading supplier of USB4, SuperSpeed USB, USB 2.0, and USB Power Delivery Controllers, announced its new line of industrial-grade USB 2.0 Hub controllers, VL122 and VL123. This launch marks the company's entry into industrial-grade applications and highlights its technical capabilities and long-term supply commitment in high-reliability design. VLI will showcase these controllers during CES 2026, January 6–9, at The Venetian Resort in Las Vegas."}]}
