{"symbol":"CAT","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:29:12.044Z","asOfDate":"2025-12-25","articles":[{"id":"8a583613-f359-3b81-a0b0-507886b386e8","title":"Promising Growth Forecasts Leading to Analysts’ Optimism for Ehang Holdings (EH)","url":"https://finance.yahoo.com/news/promising-growth-forecasts-leading-analysts-123520739.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T12:35:20.000Z","relatedTickers":["EH"],"mainIdea":"Promising Growth Forecasts Leading to Analysts’ Optimism for Ehang Holdings (EH)","summary":"Insider Monkey: Promising Growth Forecasts Leading to Analysts’ Optimism for Ehang Holdings (EH). Ehang Holdings Ltd. (NASDAQ:EH) is one of the most promising small-cap industrial stocks under $50. On December 2, DBS analyst Jason Sum reaffirmed his bullish view on Ehang Holdings Ltd. (NASDAQ:EH). He assigned a Buy rating to the stock and has estimated a target price of $24. Sum’s forecasts lead to an almost 80% upside […] Related tickers mentioned: EH."},{"id":"0a6a9714-f45f-3be2-a32f-abbe12242012","title":"ZCash (ZEC) Price Shoots 10% as Whale Scoops $13.25M","url":"https://finance.yahoo.com/m/0a6a9714-f45f-3be2-a32f-abbe12242012/zcash-%28zec%29-price-shoots-10%25.html","publisher":"Coinspeaker","publishedAt":"2025-12-25T09:40:23.000Z","relatedTickers":["ZEC-USD"],"mainIdea":"ZCash (ZEC) Price Shoots 10% as Whale Scoops $13.25M","summary":"Coinspeaker: ZCash (ZEC) Price Shoots 10% as Whale Scoops $13.25M. As the broader crypto market shows signs of consolidation, ZCash ZEC $440.3 24h volatility: 1.2% Market cap: $7.25 B Vol. 24h: $503.49 M has defied the trend with 10% upside on Dec. 25. ZEC is now trading at $446 levels with its market cap soaring past $7.3 billion once again. ... Related tickers mentioned: ZEC-USD."},{"id":"202de91b-f549-323c-b76f-8d631a23c5f5","title":"China's AI toy boom: Huawei, JD.com, UBTech make big push into growing sector","url":"https://finance.yahoo.com/m/202de91b-f549-323c-b76f-8d631a23c5f5/china%27s-ai-toy-boom%3A-huawei%2C.html","publisher":"South China Morning Post","publishedAt":"2025-12-25T09:30:00.000Z","relatedTickers":[],"mainIdea":"China's AI toy boom: Huawei, JD.com, UBTech make big push into growing sector","summary":"South China Morning Post: China's AI toy boom: Huawei, JD.com, UBTech make big push into growing sector. Huawei Technologies in late November sold more than 10,000 units of its artificial intelligence toy, Smart Hanhan, in the first week of its release, as similar smart playthings seize a growing share of consumer spending worldwide. Shenzhen-based Huawei's AI-powered emotional support plush toy, which costs 399 yuan (US$57), provides a user with interactive companionship via movement recognition, voice and touch. For example, when a user asks Smart Hanhan to count sheep, it often adds playful comm"},{"id":"217b0d59-ca90-3569-8c23-f719b571f63f","title":"Red Cat Holdings (RCAT): Revisiting Valuation After a Sharp Short-Term Share Price Rebound","url":"https://finance.yahoo.com/news/red-cat-holdings-rcat-revisiting-031141172.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T03:11:41.000Z","relatedTickers":["RCAT"],"mainIdea":"Red Cat Holdings (RCAT): Revisiting Valuation After a Sharp Short-Term Share Price Rebound","summary":"Simply Wall St.: Red Cat Holdings (RCAT): Revisiting Valuation After a Sharp Short-Term Share Price Rebound. Red Cat Holdings (RCAT) has quietly turned into a volatile ride for investors, with the stock surging over the past week and month even as longer term returns remain mixed and fundamentals still in flux. See our latest analysis for Red Cat Holdings. The 7 day share price return of 31.93 percent stands out against a year to date share price loss of 23.81 percent and a 1 year total shareholder return of 23.55 percent. This suggests sentiment is swinging back toward growth despite earlier... Related tickers mentioned: RCAT."},{"id":"6f135c99-4aa2-3a67-a4e8-a5c7dab33563","title":"The Hidden Risks of America’s Most Popular Prescription Painkiller","url":"https://finance.yahoo.com/m/6f135c99-4aa2-3a67-a4e8-a5c7dab33563/the-hidden-risks-of-america%E2%80%99s.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-25T02:00:00.000Z","relatedTickers":[],"mainIdea":"The Hidden Risks of America’s Most Popular Prescription Painkiller","summary":"The Wall Street Journal: The Hidden Risks of America’s Most Popular Prescription Painkiller. Gabapentin has soared in popularity as an alternative to opioids, but research is finding that it isn’t as safe or effective as doctors have long thought."},{"id":"8d67dde6-541d-36ce-b7cf-68d649665fc6","title":"20 Toys Every ’90s and ’00s Kid Had on Their Holiday Wishlist","url":"https://finance.yahoo.com/m/8d67dde6-541d-36ce-b7cf-68d649665fc6/20-toys-every-%E2%80%9990s-and-%E2%80%9900s.html","publisher":"Parents","publishedAt":"2025-12-24T21:00:00.000Z","relatedTickers":[],"mainIdea":"20 Toys Every ’90s and ’00s Kid Had on Their Holiday Wishlist","summary":"Parents: 20 Toys Every ’90s and ’00s Kid Had on Their Holiday Wishlist. From a Tamagotchi to an Easy-Bake Oven, these toys are sure to inspire serious nostalgia in millennial parents."}]}
