{"symbol":"VZ","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:27:20.530Z","asOfDate":"2025-12-25","articles":[{"id":"1cc2f975-ad6b-348c-b50b-60e579b6245a","title":"Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026","url":"https://finance.yahoo.com/m/1cc2f975-ad6b-348c-b50b-60e579b6245a/dogs-of-the-dow-beat-the.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-25T14:50:50.000Z","relatedTickers":["T","TMUS"],"mainIdea":"Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026","summary":"24/7 Wall St.: Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026. Keeping things simple when investing is often best, which is why buying an index fund can be the optimal strategy. Because the market has returned about 10% annually on average for the past 100 years, just buying an exchange-traded fund (ETF) could set an investor up for life. Yet you can do better than just ... Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026 Related tickers mentioned: T, TMUS."},{"id":"24ee029e-872c-33a0-b3cf-863c604ed8dc","title":"Is T-Mobile US Still Attractive After Recent 5G Expansion and Share Price Pullback in 2025","url":"https://finance.yahoo.com/news/t-mobile-us-still-attractive-091019025.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T09:10:19.000Z","relatedTickers":["TMUS"],"mainIdea":"Is T-Mobile US Still Attractive After Recent 5G Expansion and Share Price Pullback in 2025","summary":"Simply Wall St.: Is T-Mobile US Still Attractive After Recent 5G Expansion and Share Price Pullback in 2025. Wondering if T-Mobile US is still a smart buy at today’s price, or if the big run in telecom is already behind it? Let us unpack whether the current share price lines up with the company’s underlying value. T-Mobile’s stock has cooled recently, with the shares down about 0.2% over the last week, 4.0% over the last month and roughly 9.3% year to date. It is still up 48.2% over three years and 54.6% over five years. That mix of short term weakness and strong long term gains is exactly where... Related tickers mentioned: TMUS."},{"id":"ce22f4e5-5ed4-3a68-ba9d-ea5e2f06bfcc","title":"If You'd Invested $10,000 in Verizon Communications 10 Years Ago, Here's How Much You'd Have Today","url":"https://finance.yahoo.com/m/ce22f4e5-5ed4-3a68-ba9d-ea5e2f06bfcc/if-you%27d-invested-%2410%2C000-in.html","publisher":"Motley Fool","publishedAt":"2025-12-25T02:53:00.000Z","relatedTickers":["AAPL","^GSPC"],"mainIdea":"If You'd Invested $10,000 in Verizon Communications 10 Years Ago, Here's How Much You'd Have Today","summary":"Motley Fool: If You'd Invested $10,000 in Verizon Communications 10 Years Ago, Here's How Much You'd Have Today. Verizon was a market-beater 10 years ago. The next decade told a very different story. Related tickers mentioned: AAPL, ^GSPC."},{"id":"f4bb684e-9ade-381c-9a9d-4a1ab1684f1c","title":"Does Verizon’s Autonomous Trucking And Public Safety Push Reframe The Bull Case For Verizon (VZ)?","url":"https://finance.yahoo.com/news/does-verizon-autonomous-trucking-public-015407090.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T01:54:07.000Z","relatedTickers":["KYOCF"],"mainIdea":"Does Verizon’s Autonomous Trucking And Public Safety Push Reframe The Bull Case For Verizon (VZ)?","summary":"Simply Wall St.: Does Verizon’s Autonomous Trucking And Public Safety Push Reframe The Bull Case For Verizon (VZ)?. In recent days, Verizon Business and Kodiak AI finalized a commercial agreement to power Kodiak’s driverless trucking with Verizon’s 5G/LTE connectivity, IoT telematics, and ThingSpace platform, alongside the launch of Total Wireless Edge device financing for prepaid customers and the certification of Kyocera’s DuraForce PRO 3 under the Verizon Frontline Verified program. Together, these moves highlight how Verizon is pushing deeper into autonomous logistics, prepaid device access, and... Related tickers mentioned: KYOCF."},{"id":"d144260a-aedc-3ad1-b47f-70b58435829e","title":"Verizon Communications (VZ) Exceeds Market Returns: Some Facts to Consider","url":"https://finance.yahoo.com/news/verizon-communications-vz-exceeds-market-224501969.html","publisher":"Zacks","publishedAt":"2025-12-24T22:45:01.000Z","relatedTickers":["^DJI","^GSPC","^IXIC"],"mainIdea":"Verizon Communications (VZ) Exceeds Market Returns: Some Facts to Consider","summary":"Zacks: Verizon Communications (VZ) Exceeds Market Returns: Some Facts to Consider. Verizon Communications (VZ) reached $40.32 at the closing of the latest trading day, reflecting a +1% change compared to its last close. Related tickers mentioned: ^DJI, ^GSPC, ^IXIC."}]}
