{"symbol":"BK","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:27:10.899Z","asOfDate":"2025-12-25","articles":[{"id":"ec23a96d-58c0-340a-9013-469bab17a3ea","title":"FRN Variable Rate Fix","url":"https://finance.yahoo.com/news/frn-variable-rate-fix-163300571.html","publisher":"Business Wire","publishedAt":"2025-12-23T16:33:00.000Z","relatedTickers":["YW35"],"mainIdea":"FRN Variable Rate Fix","summary":"Business Wire: FRN Variable Rate Fix. LONDON, December 23, 2025-- As Agent Bank, please be advised of the following rate determined on: 12/22/2025Issue Related tickers mentioned: YW35."},{"id":"0ec6b46b-b86d-3887-af88-8ec71033c9e7","title":"Jim Cramer Says Bank of New York Mellon is a Bank He Has “Come to Like Very Much”","url":"https://finance.yahoo.com/news/jim-cramer-says-bank-york-151409348.html","publisher":"Insider Monkey","publishedAt":"2025-12-21T15:14:09.000Z","relatedTickers":["BK-PK"],"mainIdea":"Jim Cramer Says Bank of New York Mellon is a Bank He Has “Come to Like Very Much”","summary":"Insider Monkey: Jim Cramer Says Bank of New York Mellon is a Bank He Has “Come to Like Very Much”. The Bank of New York Mellon Corporation (NYSE:BK) is one of the one of the stocks Jim Cramer was bullish on due to share buyback activity. Cramer said, “we think the world of” the company’s CEO, as he commented: “Fourth is a bank that I’ve come to like very much over the past couple years, […] Related tickers mentioned: BK-PK."},{"id":"fc4eb7c8-b0d7-3893-b7a3-e97025d0a6cf","title":"Has BNY Mellon’s 50% Rally in 2025 Already Priced In Its Growth Story?","url":"https://finance.yahoo.com/news/bny-mellon-50-rally-2025-080855302.html","publisher":"Simply Wall St.","publishedAt":"2025-12-19T08:08:55.000Z","relatedTickers":["BK-PK"],"mainIdea":"Has BNY Mellon’s 50% Rally in 2025 Already Priced In Its Growth Story?","summary":"Simply Wall St.: Has BNY Mellon’s 50% Rally in 2025 Already Priced In Its Growth Story?. If you are wondering whether Bank of New York Mellon is still a smart buy after such a big run, or if the easy money has already been made, you are not alone. The stock is up 50.7% over the past year and 222.2% over five years, even after a recent 2.2% pullback this week and a 6.5% gain over the last month, which signals that investors are actively reassessing its long term prospects. Recent headlines have focused on BNY Mellon's expanding role in custody, asset servicing, and digital... Related tickers mentioned: BK-PK."}]}
