{"symbol":"OKTA","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:24.850Z","asOfDate":"2025-12-27","articles":[{"id":"775eb16f-fe2e-3929-843f-4fb522b2a034","title":"Phishing scams becoming prevalent on LinkedIn: How to spot them","url":"https://finance.yahoo.com/video/phishing-scams-becoming-prevalent-linkedin-150028882.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-27T15:00:28.000Z","relatedTickers":["CRWD","NET","PANW","ZS"],"mainIdea":"Phishing scams becoming prevalent on LinkedIn: How to spot them","summary":"Yahoo Finance Video: Phishing scams becoming prevalent on LinkedIn: How to spot them. Americans lost $12.5 billion in scams in 2025, according to a report from the US Federal Trade Commission (FTC), a whopping 25% increase from last year. Push Security CTO Mark Orlando explains the methods and platforms that scammers are using, such as social media and networking sites like LinkedIn, and the tell-tale signs of a phishing scam. Catch Yahoo Finance's interview with CrowdStrike (CRWD) president Michael Sentonas on how the cybersecurity industry is using AI to combat hacks. Also read up on how North Korean hackers were responsible for over $2 billion in crypto losses in 2025. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Domination Overtime. Related tickers mentioned: CRWD, NET, PANW, ZS."},{"id":"ab235a30-9f03-35a3-9ced-48055e4f774c","title":"Stifel: Cloudflare (NET) a Key Player in Emerging AI Security Market","url":"https://finance.yahoo.com/news/stifel-cloudflare-net-key-player-072033857.html","publisher":"Insider Monkey","publishedAt":"2025-12-27T07:20:33.000Z","relatedTickers":["NET"],"mainIdea":"Stifel: Cloudflare (NET) a Key Player in Emerging AI Security Market","summary":"Insider Monkey: Stifel: Cloudflare (NET) a Key Player in Emerging AI Security Market. Cloudflare, Inc. (NYSE:NET) is one of the AI Stocks on Market Radar. On December 17, Stifel reiterated its Buy rating on the stock, with analysts viewing Cloudflare as a key beneficiary of rising AI-first security demand amid growing risks. The firm highlighted how it is becoming increasingly important for cyber teams to secure the use […] Related tickers mentioned: NET."},{"id":"0211cd13-7fed-3d7e-8d18-03d40e726023","title":"Cloud AI Today - AI Trends Shaping Strategic Business Approaches For 2026","url":"https://finance.yahoo.com/news/cloud-ai-today-ai-trends-123726916.html","publisher":"Simply Wall St.","publishedAt":"2025-12-26T12:37:26.000Z","relatedTickers":["GOOG","MSFT","ORCL"],"mainIdea":"Cloud AI Today - AI Trends Shaping Strategic Business Approaches For 2026","summary":"Simply Wall St.: Cloud AI Today - AI Trends Shaping Strategic Business Approaches For 2026. Recent findings from a survey conducted by the Ramsey Theory Group highlight three pivotal trends in artificial intelligence (AI) that will define enterprise strategies in 2026. As AI moves from experimental phases to becoming a fundamental component of business operations, organizations are focusing on agentic AI systems with controlled autonomy, robust AI cost management, and dynamic governance models. These developments reflect a mature AI market where accountability, transparency, and... Related tickers mentioned: GOOG, MSFT, ORCL."}]}
