{"symbol":"VTI","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:35.482Z","asOfDate":"2025-12-27","articles":[{"id":"2bad7ffd-c766-3853-a017-cf8a7c3555ab","title":"One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026","url":"https://finance.yahoo.com/m/2bad7ffd-c766-3853-a017-cf8a7c3555ab/one-avantis-etf-beat.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-27T15:08:43.000Z","relatedTickers":["AVEM","IEMG","TSM","VOO"],"mainIdea":"One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026","summary":"24/7 Wall St.: One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026. The Avantis Emerging Markets Equity ETF (NYSEARCA:AVEM) delivered a 35% return in 2025, outperforming Vanguard’s largest funds and signaling emerging markets might finally be having their moment. With $15.1 billion in assets and concentrated bets on Asian technology and financials, the fund beat both Vanguard S&P 500 ETF (NYSEARCA:VOO) and Vanguard Total Stock Market ETF ... One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026 Related tickers mentioned: AVEM, IEMG, TSM, VOO."},{"id":"f4b6bcf7-884d-3f95-b8cc-1159a14e9bcc","title":"How Broad Market ETFs Like VTI Can Support Long-Term Portfolio Stability","url":"https://finance.yahoo.com/m/f4b6bcf7-884d-3f95-b8cc-1159a14e9bcc/how-broad-market-etfs-like.html","publisher":"Motley Fool","publishedAt":"2025-12-25T17:37:00.000Z","relatedTickers":["^CRSPTMT"],"mainIdea":"How Broad Market ETFs Like VTI Can Support Long-Term Portfolio Stability","summary":"Motley Fool: How Broad Market ETFs Like VTI Can Support Long-Term Portfolio Stability. Total stock market ETFs should be the cornerstone of any well-constructed investment portfolio. Related tickers mentioned: ^CRSPTMT."},{"id":"d0055203-9a24-344b-8381-b87565143b7a","title":"Sight Sciences price target raised to $12 from $7 at UBS","url":"https://finance.yahoo.com/news/sight-sciences-price-target-raised-005511592.html","publisher":"TipRanks","publishedAt":"2025-12-24T00:55:11.000Z","relatedTickers":["SGHT"],"mainIdea":"Sight Sciences price target raised to $12 from $7 at UBS","summary":"TipRanks: Sight Sciences price target raised to $12 from $7 at UBS. UBS raised the firm’s price target on Sight Sciences (SGHT) to $12 from $7 and keeps a Buy rating on the shares. Medicare Administrative Contractors Novitas and First Coast Service Option established the Medicare fee schedule for TearCare, which represented a critical strategic milestone that increases market access for Sight Sciences’ Dry Eye Solution, and the now-established $1,140 fee offers a clearer line of sight to accelerating TearCare utilization, expanding gross margins, and a potential Related tickers mentioned: SGHT."}]}
