{"symbol":"TMO","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:16.723Z","asOfDate":"2025-12-27","articles":[{"id":"cee5753c-19c7-3782-89e7-03936ef608e0","title":"Thermo Fisher Scientific to Hold Earnings Conference Call on Thursday, January 29, 2026","url":"https://finance.yahoo.com/news/thermo-fisher-scientific-hold-earnings-130000766.html","publisher":"Business Wire","publishedAt":"2025-12-26T13:00:00.000Z","relatedTickers":[],"mainIdea":"Thermo Fisher Scientific to Hold Earnings Conference Call on Thursday, January 29, 2026","summary":"Business Wire: Thermo Fisher Scientific to Hold Earnings Conference Call on Thursday, January 29, 2026. WALTHAM, Mass., December 26, 2025--Thermo Fisher Scientific Inc. (NYSE: TMO), the world leader in serving science, announced that it will release its financial results for the fourth quarter and full year 2025 before the market opens on Thursday, January 29, 2026, and will hold a conference call on the same day at 8:30 a.m. ET. During the call, the company will discuss its financial performance, as well as future expectations."},{"id":"dac56130-3493-3a33-97cf-bdb72ea31b5d","title":"Sector Rotation: 2 Smart Money Moves for 2026","url":"https://finance.yahoo.com/m/dac56130-3493-3a33-97cf-bdb72ea31b5d/sector-rotation%3A-2-smart.html","publisher":"MarketBeat","publishedAt":"2025-12-26T12:15:00.000Z","relatedTickers":["DIS","GOOG","LLY","META","NFLX","UNH","XLC","XLV"],"mainIdea":"Sector Rotation: 2 Smart Money Moves for 2026","summary":"MarketBeat: Sector Rotation: 2 Smart Money Moves for 2026. Investors are rotating capital into communication services and healthcare stocks as falling interest rates create new opportunities for growth and income. Related tickers mentioned: DIS, GOOG, LLY, META, NFLX, UNH, XLC, XLV."},{"id":"15a96642-7351-30e1-b87a-6c5cff477151","title":"Japan govt approves record budget, including for defence","url":"https://finance.yahoo.com/news/japan-govt-approves-record-122-020613815.html","publisher":"AFP","publishedAt":"2025-12-26T09:04:59.000Z","relatedTickers":[],"mainIdea":"Japan govt approves record budget, including for defence","summary":"AFP: Japan govt approves record budget, including for defence. The Japanese government approved a record budget for the upcoming fiscal year on Friday, to pay for everything from bigger defence spending to ballooning social security costs as inflation persists.The 122.3-trillion-yen ($782 billion) budget for the fiscal year from April 2026 will include a record nine trillion yen for defence spending, as Prime Minister Sanae Takaichi aims to accelerate Tokyo's sweeping upgrade of its military in the face of worsening relations with China."}]}
