{"symbol":"TMO","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:21.521Z","asOfDate":"2025-12-26","articles":[{"id":"15a96642-7351-30e1-b87a-6c5cff477151","title":"Japan govt approves record budget, including for defence","url":"https://finance.yahoo.com/news/japan-govt-approves-record-122-020613815.html","publisher":"AFP","publishedAt":"2025-12-26T09:04:59.000Z","relatedTickers":[],"mainIdea":"Japan govt approves record budget, including for defence","summary":"AFP: Japan govt approves record budget, including for defence. The Japanese government approved a record budget for the upcoming fiscal year on Friday, to pay for everything from bigger defence spending to ballooning social security costs as inflation persists.The 122.3-trillion-yen ($782 billion) budget for the fiscal year from April 2026 will include a record nine trillion yen for defence spending, as Prime Minister Sanae Takaichi aims to accelerate Tokyo's sweeping upgrade of its military in the face of worsening relations with China."},{"id":"549d4ec5-35d0-35f3-a6e6-d90ff2ffca08","title":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","url":"https://finance.yahoo.com/m/549d4ec5-35d0-35f3-a6e6-d90ff2ffca08/fidelity-contrafund%E2%80%99s-will.html","publisher":"Barrons.com","publishedAt":"2025-12-24T06:00:00.000Z","relatedTickers":["AAPL","AMZN","BRK-B","MCD","META"],"mainIdea":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","summary":"Barrons.com: Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins. The legendary manager has taken on two co-managers to help him run the mammoth fund. Just don’t use the word “retirement.” Related tickers mentioned: AAPL, AMZN, BRK-B, MCD, META."},{"id":"a03ebc9e-9145-3a2d-ac73-fc1e170f6cb5","title":"2 S&P 500 Stocks Worth Investigating and 1 We Avoid","url":"https://finance.yahoo.com/news/2-p-500-stocks-worth-043102191.html","publisher":"StockStory","publishedAt":"2025-12-24T04:31:02.000Z","relatedTickers":["COIN","LII","^GSPC"],"mainIdea":"2 S&P 500 Stocks Worth Investigating and 1 We Avoid","summary":"StockStory: 2 S&P 500 Stocks Worth Investigating and 1 We Avoid. While the S&P 500 (^GSPC) includes industry leaders, not every stock in the index is a winner. Some companies are past their prime, weighed down by poor execution, weak financials, or structural headwinds. Related tickers mentioned: COIN, LII, ^GSPC."}]}
