{"symbol":"DB","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:16.449Z","asOfDate":"2025-12-27","articles":[{"id":"af2f0b25-7124-3d8b-80d6-f5ffc5d85956","title":"JPMorgan Chase Hits New Highs As Nasdaq Stock Trades With Others At Peaks In Buy Zones","url":"https://finance.yahoo.com/m/af2f0b25-7124-3d8b-80d6-f5ffc5d85956/jpmorgan-chase-hits-new-highs.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-26T20:53:02.000Z","relatedTickers":["HWM","JPM","NDAQ"],"mainIdea":"JPMorgan Chase Hits New Highs As Nasdaq Stock Trades With Others At Peaks In Buy Zones","summary":"Investor's Business Daily: JPMorgan Chase Hits New Highs As Nasdaq Stock Trades With Others At Peaks In Buy Zones. JPMorgan Chase and Deutsche Bank are also hitting all-time highs along with Howmet Aerospace on Friday. Related tickers mentioned: HWM, JPM, NDAQ."},{"id":"fcaedb2d-0bb8-31f3-9ae3-aa2aa28e88e5","title":"Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates","url":"https://finance.yahoo.com/news/why-narrative-around-hilton-food-020618808.html","publisher":"Simply Wall St.","publishedAt":"2025-12-26T02:06:18.000Z","relatedTickers":["HLFGY","HLTFF"],"mainIdea":"Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates","summary":"Simply Wall St.: Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates. Hilton Food Group’s latest research updates paint a picture of a stock whose fair value anchor at £7.65 remains intact, even as the market narrative turns more cautious. A slightly higher discount rate at 7.43% and largely unchanged revenue growth expectations near 1.94% reflect a delicate balance between recognition of higher risk and confidence in steady execution. As this tug of war between bullish and bearish views evolves, stay tuned to see how you can track these shifting assumptions... Related tickers mentioned: HLFGY, HLTFF."},{"id":"dda848f8-a01c-36e5-a105-99c2f682057c","title":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","url":"https://finance.yahoo.com/news/xtrackers-russell-us-multifactor-etf-112001749.html","publisher":"Zacks","publishedAt":"2025-12-25T11:20:01.000Z","relatedTickers":["DEUS"],"mainIdea":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","summary":"Zacks: Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?. Style Box ETF report for DEUS Related tickers mentioned: DEUS."}]}
