{"symbol":"DB","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:03.653Z","asOfDate":"2025-12-22","articles":[{"id":"779662b2-0ba1-3155-b53d-cb38576b609f","title":"DB vs. NABZY: Which Stock Should Value Investors Buy Now?","url":"https://finance.yahoo.com/news/db-vs-nabzy-stock-value-164003806.html","publisher":"Zacks","publishedAt":"2025-12-22T16:40:03.000Z","relatedTickers":["NAB.AX","NABZY","NAUBF"],"mainIdea":"DB vs. NABZY: Which Stock Should Value Investors Buy Now?","summary":"Zacks: DB vs. NABZY: Which Stock Should Value Investors Buy Now?. DB vs. NABZY: Which Stock Is the Better Value Option? Related tickers mentioned: NAB.AX, NABZY, NAUBF."},{"id":"1ab86ca7-be40-3413-9fcb-f2180c730efa","title":"Investor positioning steady but cautious as equity inflows surge: Deutsche Bank","url":"https://finance.yahoo.com/news/investor-positioning-steady-cautious-equity-163142401.html","publisher":"Investing.com","publishedAt":"2025-12-22T16:31:42.000Z","relatedTickers":[],"mainIdea":"Investor positioning steady but cautious as equity inflows surge: Deutsche Bank","summary":"Investing.com: Investor positioning steady but cautious as equity inflows surge: Deutsche Bank. Investing.com -- Investor positioning in equities remains modestly overweight but volatile, with discretionary investors still cautious despite a recent surge in fund inflows, according to Deutsche Bank."},{"id":"8ac0085a-f752-35f0-bb5a-e176ee7fb670","title":"Evaluating East West Bancorp (EWBC) After Deutsche Bank’s Bullish Coverage and Renewed Investor Interest","url":"https://finance.yahoo.com/news/evaluating-east-west-bancorp-ewbc-151114088.html","publisher":"Simply Wall St.","publishedAt":"2025-12-19T15:11:14.000Z","relatedTickers":["EWBC"],"mainIdea":"Evaluating East West Bancorp (EWBC) After Deutsche Bank’s Bullish Coverage and Renewed Investor Interest","summary":"Simply Wall St.: Evaluating East West Bancorp (EWBC) After Deutsche Bank’s Bullish Coverage and Renewed Investor Interest. East West Bancorp (EWBC) has been getting extra attention after fresh bullish coverage from Deutsche Bank, which spotlighted the bank’s cross border niche and ongoing push away from commercial real estate concentration. See our latest analysis for East West Bancorp. The upbeat coverage has landed just as momentum is building again, with a roughly 14.5 percent 1 month share price return and a powerful 5 year total shareholder return of about 159 percent suggesting investors are steadily... Related tickers mentioned: EWBC."}]}
