{"symbol":"DB","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:20.563Z","asOfDate":"2025-12-26","articles":[{"id":"fcaedb2d-0bb8-31f3-9ae3-aa2aa28e88e5","title":"Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates","url":"https://finance.yahoo.com/news/why-narrative-around-hilton-food-020618808.html","publisher":"Simply Wall St.","publishedAt":"2025-12-26T02:06:18.000Z","relatedTickers":["HLFGY","HLTFF"],"mainIdea":"Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates","summary":"Simply Wall St.: Why The Narrative Around Hilton Food Group Is Shifting After Cautious Analyst Updates. Hilton Food Group’s latest research updates paint a picture of a stock whose fair value anchor at £7.65 remains intact, even as the market narrative turns more cautious. A slightly higher discount rate at 7.43% and largely unchanged revenue growth expectations near 1.94% reflect a delicate balance between recognition of higher risk and confidence in steady execution. As this tug of war between bullish and bearish views evolves, stay tuned to see how you can track these shifting assumptions... Related tickers mentioned: HLFGY, HLTFF."},{"id":"dda848f8-a01c-36e5-a105-99c2f682057c","title":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","url":"https://finance.yahoo.com/news/xtrackers-russell-us-multifactor-etf-112001749.html","publisher":"Zacks","publishedAt":"2025-12-25T11:20:01.000Z","relatedTickers":["DEUS"],"mainIdea":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","summary":"Zacks: Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?. Style Box ETF report for DEUS Related tickers mentioned: DEUS."},{"id":"1385162f-7ecd-3b41-bc34-c8ed6f4b9a99","title":"Has Deutsche Bank’s 98% Rally in 2025 Already Priced In Its Turnaround Story?","url":"https://finance.yahoo.com/news/deutsche-bank-98-rally-2025-041829258.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T04:18:29.000Z","relatedTickers":[],"mainIdea":"Has Deutsche Bank’s 98% Rally in 2025 Already Priced In Its Turnaround Story?","summary":"Simply Wall St.: Has Deutsche Bank’s 98% Rally in 2025 Already Priced In Its Turnaround Story?. Wondering if Deutsche Bank's huge run up has already played out or if there is still value on the table? This article will walk through what the current share price really implies. After climbing 1.9% over the last week, 11.4% in the past month, and 98.1% year to date, Deutsche Bank shares have also delivered 109.9% over 1 year, 239.6% over 3 years, and 314.9% over 5 years, which raises questions about how much upside is left versus how much risk has been repriced. Recent moves have been..."}]}
