{"symbol":"MDT","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:57:52.289Z","asOfDate":"2025-12-22","articles":[{"id":"ff2356fd-c717-380d-af4d-aa97cb7e0cfe","title":"Is It Too Late To Consider Medtronic After Its Strong 2025 Share Price Rally?","url":"https://finance.yahoo.com/news/too-consider-medtronic-strong-2025-200718200.html","publisher":"Simply Wall St.","publishedAt":"2025-12-22T20:07:18.000Z","relatedTickers":[],"mainIdea":"Is It Too Late To Consider Medtronic After Its Strong 2025 Share Price Rally?","summary":"Simply Wall St.: Is It Too Late To Consider Medtronic After Its Strong 2025 Share Price Rally?. If you are wondering whether Medtronic at around $98 is still a smart buy or if most of the upside is already priced in, this article will walk through what the market might be missing. The stock is up 22.9% year to date and 25.2% over the last year, even after a recent 2.5% pullback over the past month. This suggests sentiment has improved but is still a bit cautious after a flat 5 year return of -1.2%. That backdrop comes as Medtronic keeps leaning into high growth areas such as robotic..."},{"id":"d36cd3e7-ef16-30e2-86f5-d24fe1fb69a7","title":"MDT vs. ESLOY: Which Stock Is the Better Value Option?","url":"https://finance.yahoo.com/news/mdt-vs-esloy-stock-better-164003189.html","publisher":"Zacks","publishedAt":"2025-12-22T16:40:03.000Z","relatedTickers":["ESLOF","ESLOY"],"mainIdea":"MDT vs. ESLOY: Which Stock Is the Better Value Option?","summary":"Zacks: MDT vs. ESLOY: Which Stock Is the Better Value Option?. MDT vs. ESLOY: Which Stock Is the Better Value Option? Related tickers mentioned: ESLOF, ESLOY."},{"id":"d7afdeda-8d1a-3a48-8f26-c238f06e008d","title":"4 Large-Cap MedTech Stocks to Keep Winning Streaks Alive in 2026","url":"https://finance.yahoo.com/news/4-large-cap-medtech-stocks-160700054.html","publisher":"Zacks","publishedAt":"2025-12-22T16:07:00.000Z","relatedTickers":["CAH","EW","^DJI"],"mainIdea":"4 Large-Cap MedTech Stocks to Keep Winning Streaks Alive in 2026","summary":"Zacks: 4 Large-Cap MedTech Stocks to Keep Winning Streaks Alive in 2026. Four large-cap MedTech leaders, MDT, ISRG, CAH, EW, appear well-positioned to extend their winning streaks in 2026 on resilient procedure demand and innovation. Related tickers mentioned: CAH, EW, ^DJI."}]}
