{"symbol":"MDT","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:45.167Z","asOfDate":"2025-12-25","articles":[{"id":"b490926d-5071-357c-81b2-cda8c9b50b67","title":"Analyst Report: Medtronic plc","url":"https://finance.yahoo.com/m/b490926d-5071-357c-81b2-cda8c9b50b67/analyst-report%3A-medtronic-plc.html","publisher":"Morningstar Research","publishedAt":"2025-12-25T00:17:46.000Z","relatedTickers":[],"mainIdea":"Analyst Report: Medtronic plc","summary":"Morningstar Research: Analyst Report: Medtronic plc. One of the largest medical-device companies, Medtronic develops and manufactures therapeutic medical devices for chronic diseases. Its portfolio includes pacemakers, defibrillators, transcatheter heart valves, stents, insulin pumps, spinal fixation devices, neurovascular products, advanced energy, ablation laser therapy, and surgical tools. The company primarily markets its products to healthcare institutions and physicians in the United States, Western Europe, and Japan. Foreign sales account for roughly 50% of the company's total sales."},{"id":"727ca8e3-ac25-33d3-8de8-b180eb99424d","title":"Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever","url":"https://finance.yahoo.com/m/727ca8e3-ac25-33d3-8de8-b180eb99424d/got-%241%2C000%3F-2-high-yield.html","publisher":"Motley Fool","publishedAt":"2025-12-24T22:46:00.000Z","relatedTickers":["BMY","PFE"],"mainIdea":"Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever","summary":"Motley Fool: Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever. If you are looking for high yields, this drug maker and this device maker are both worth a deep dive today. Related tickers mentioned: BMY, PFE."},{"id":"5d2d8671-dd1c-3467-ad2e-fd9350a14f92","title":"Crazy Woman Creek Bancorp Reports Earnings for Fiscal Year 2025; Declares Annual Cash Dividend of $0.32 Per Share","url":"https://finance.yahoo.com/news/crazy-woman-creek-bancorp-reports-140000810.html","publisher":"GlobeNewswire","publishedAt":"2025-12-24T14:00:00.000Z","relatedTickers":["CRZY"],"mainIdea":"Crazy Woman Creek Bancorp Reports Earnings for Fiscal Year 2025; Declares Annual Cash Dividend of $0.32 Per Share","summary":"GlobeNewswire: Crazy Woman Creek Bancorp Reports Earnings for Fiscal Year 2025; Declares Annual Cash Dividend of $0.32 Per Share. BUFFALO, Wyo., Dec. 24, 2025 (GLOBE NEWSWIRE) -- We continue to build our franchise as Crazy Woman Creek Bancorp (OTCPink: CRZY) and Buffalo Federal Bank, known as The Banks of Buffalo, Sheridan, Gillette and BFSB Mortgage of Evanston. Headquartered in Buffalo, Wyoming, our bank remains a vital business and community partner since founding in 1936. We take great pride in meeting our customers’ banking needs with a passion for local decision-making and personal involvement in our communities. Our Related tickers mentioned: CRZY."}]}
