{"symbol":"NVDA","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:18:08.497Z","asOfDate":"2025-12-24","articles":[{"id":"88f19cce-a65c-37d0-bca8-5d1006ecf0d2","title":"Billionaire Stanley Druckenmiller Sold Nvidia and Palantir and Piled Into One of Wall Street's Hottest Drug Stocks Ahead of 2026","url":"https://finance.yahoo.com/m/88f19cce-a65c-37d0-bca8-5d1006ecf0d2/billionaire-stanley.html","publisher":"Motley Fool","publishedAt":"2025-12-24T09:11:00.000Z","relatedTickers":["PLTR"],"mainIdea":"Billionaire Stanley Druckenmiller Sold Nvidia and Palantir and Piled Into One of Wall Street's Hottest Drug Stocks Ahead of 2026","summary":"Motley Fool: Billionaire Stanley Druckenmiller Sold Nvidia and Palantir and Piled Into One of Wall Street's Hottest Drug Stocks Ahead of 2026. Duquesne Family Office's billionaire boss has jettisoned the faces of the artificial intelligence (AI) revolution in favor of a drugmaker whose shares have rallied 191% since the beginning of 2024. Related tickers mentioned: PLTR."},{"id":"f23e92b6-ba2a-363b-9e3c-11a58a736da2","title":"Nvidia (NVDA) Tests Path Back Into China With H200 AI Chip Plans","url":"https://finance.yahoo.com/news/nvidia-nvda-tests-path-back-075935453.html","publisher":"Insider Monkey","publishedAt":"2025-12-24T07:59:35.000Z","relatedTickers":[],"mainIdea":"Nvidia (NVDA) Tests Path Back Into China With H200 AI Chip Plans","summary":"Insider Monkey: Nvidia (NVDA) Tests Path Back Into China With H200 AI Chip Plans. NVIDIA Corporation (NASDAQ:NVDA) is one of the AI Stocks Making Waves on Wall Street. On December 22, Reuters reported that Nvidia has told its Chinese clients that it aims to start shipping its H200 AI chips to China before the Lunar New Year holiday in mid-February. According to sources familiar with the matter, the AI […]"},{"id":"549d4ec5-35d0-35f3-a6e6-d90ff2ffca08","title":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","url":"https://finance.yahoo.com/m/549d4ec5-35d0-35f3-a6e6-d90ff2ffca08/fidelity-contrafund%E2%80%99s-will.html","publisher":"Barrons.com","publishedAt":"2025-12-24T06:00:00.000Z","relatedTickers":["AAPL","AMZN","BRK-B","MCD","META"],"mainIdea":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","summary":"Barrons.com: Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins. The legendary manager has taken on two co-managers to help him run the mammoth fund. Just don’t use the word “retirement.” Related tickers mentioned: AAPL, AMZN, BRK-B, MCD, META."}]}
