{"symbol":"NVDA","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:16:18.465Z","asOfDate":"2025-12-23","articles":[{"id":"2226fe27-a4e3-3a96-b5e3-b6fb38a5bf3b","title":"Nvidia Stock Climbs as H200 AI Chips Eye China Market","url":"https://finance.yahoo.com/news/nvidia-stock-climbs-h200-ai-155903616.html","publisher":"GuruFocus.com","publishedAt":"2025-12-23T15:59:03.000Z","relatedTickers":["BABA"],"mainIdea":"Nvidia Stock Climbs as H200 AI Chips Eye China Market","summary":"GuruFocus.com: Nvidia Stock Climbs as H200 AI Chips Eye China Market. China Approval Looms Over Nvidia's Mid-February H200 Shipment Plans Related tickers mentioned: BABA."},{"id":"b878e684-3aa3-3aa3-aa69-940b9ae24047","title":"An X-Ray View of the Magnificent Seven","url":"https://finance.yahoo.com/news/x-ray-view-magnificent-seven-153824716.html","publisher":"GuruFocus.com","publishedAt":"2025-12-23T15:38:24.000Z","relatedTickers":["AAPL","AMZN","GOOG","META","MSFT","TSLA","^GSPC"],"mainIdea":"An X-Ray View of the Magnificent Seven","summary":"GuruFocus.com: An X-Ray View of the Magnificent Seven. Valuation, growth, balance sheets and analyst sentiment suggest leadership fatigue -- but not collapse Related tickers mentioned: AAPL, AMZN, GOOG, META, MSFT, TSLA, ^GSPC."},{"id":"bca52ed6-9ce8-3d95-84d3-e3420f7b292f","title":"Nvidia and Tesla are the 'best physical AI plays in the world'","url":"https://finance.yahoo.com/video/nvidia-tesla-best-physical-ai-151938642.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-23T15:19:38.000Z","relatedTickers":["TSLA"],"mainIdea":"Nvidia and Tesla are the 'best physical AI plays in the world'","summary":"Yahoo Finance Video: Nvidia and Tesla are the 'best physical AI plays in the world'. Wedbush Securities managing director and global head of technology research Dan Ives, who has been a vocal Tesla (TSLA) bull on Wall Street, tells Yahoo Finance Executive Editor Brian Sozzi that 2026 may be the most important year in the Elon Musk-led company's history. Ives names Nvidia (NVDA) and Tesla as his top physical AI picks. Watch the video above to hear why. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Morning Brief. Related tickers mentioned: TSLA."},{"id":"c4d7c648-0956-37bc-a5ba-93b9feec3a03","title":"Nvidia and Broadcom Executives Cash Out Millions in Stock Sales","url":"https://finance.yahoo.com/news/nvidia-broadcom-executives-cash-millions-150518739.html","publisher":"GuruFocus.com","publishedAt":"2025-12-23T15:05:18.000Z","relatedTickers":["AVGO"],"mainIdea":"Nvidia and Broadcom Executives Cash Out Millions in Stock Sales","summary":"GuruFocus.com: Nvidia and Broadcom Executives Cash Out Millions in Stock Sales. Large insider sales spark investor caution as AI chip stocks rally into year-end. Related tickers mentioned: AVGO."},{"id":"c5850b7d-401f-3291-aea0-638a8a364279","title":"Zacks.com featured highlights include NVIDIA, Micron Technology and Seagate Technology","url":"https://finance.yahoo.com/news/zacks-com-featured-highlights-nvidia-144300642.html","publisher":"Zacks","publishedAt":"2025-12-23T14:43:00.000Z","relatedTickers":["MU","STX","^GSPC"],"mainIdea":"Zacks.com featured highlights include NVIDIA, Micron Technology and Seagate Technology","summary":"Zacks: Zacks.com featured highlights include NVIDIA, Micron Technology and Seagate Technology. NVIDIA tops a screen of profitable S&P 500 stocks, with Micron Technology and Seagate Technology also standing out for strong net income ratios. Related tickers mentioned: MU, STX, ^GSPC."},{"id":"629b9e43-9948-31f9-a32b-ceedd0b81fcd","title":"US delays announcement of China chip tariffs until 2027","url":"https://finance.yahoo.com/news/us-impose-tariffs-chips-china-141948243.html","publisher":"Reuters","publishedAt":"2025-12-23T14:19:48.000Z","relatedTickers":[],"mainIdea":"US delays announcement of China chip tariffs until 2027","summary":"Reuters: US delays announcement of China chip tariffs until 2027. The Trump administration on Tuesday said it will slap tariffs on ​Chinese semiconductor imports over Beijing's \"unreasonable\" pursuit of chip industry dominance, ‌but would delay the action until June 2027. The tariff rate will be announced at ‌least 30 days in advance, according to the filing, which follows a year-long investigation into China's chip imports into the United States, launched by the Biden administration. \"China’s targeting of the semiconductor industry for dominance is ⁠unreasonable and burdens or ‌restricts U.S. commerce and thus is actionable,\" the U.S. Trade Representative said in its release."},{"id":"2d165f1a-b15c-3235-8f37-a0682b9ccd73","title":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","url":"https://finance.yahoo.com/news/truist-reaffirms-buy-nvidia-nvda-075136854.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T07:51:36.000Z","relatedTickers":["AMD","AVGO","TFC","TTMI"],"mainIdea":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","summary":"Insider Monkey: Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside. NVIDIA Corporation (NASDAQ:NVDA) is one of the AI Stocks in the Spotlight for Investors. On December 19, Truist reiterated the stock at “Buy” and raised its price target to $275 per share from $255. The firm revised price targets in the semiconductor and artificial intelligence group after establishing 2027 projections. “In this construct, we favor […] Related tickers mentioned: AMD, AVGO, TFC, TTMI."},{"id":"71ca0b31-035b-3bd8-822b-0e2943f63563","title":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","url":"https://finance.yahoo.com/news/analysis-global-investors-turn-chinese-072806140.html","publisher":"Reuters","publishedAt":"2025-12-23T07:28:06.000Z","relatedTickers":["0981.HK","5310.TWO","688008.SS","688256.SS","688795.SS","AAPL","AMD","BABA","BIDU","GOOG","META","OPAI.PVT","TCEHY","TSLA","^IXIC"],"mainIdea":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","summary":"Reuters: Analysis-Global investors turn to Chinese AI as Wall Street fears bubble. Foreigners see China closing ‌the tech gap with the U.S. as Beijing steps up support for AI chipmakers, spurring bets on Chinese companies just as worries grow over lofty valuations on U.S.-listed AI stocks. U.K.-based asset manager Ruffer, for example, said it has \"deliberately limited ‌exposure\" to the Magnificent Seven - the U.S. tech giants - and is looking to add positions in Alibaba for a bigger exposure to China's AI theme. \"While the U.S. remains the leader in frontier AI, China is rapidly narrowing the gap,\" said Gemma Cairns-Smith, Investment Specialist at Ruffer. Related tickers mentioned: 0981.HK, 5310.TWO, 688008.SS, 688256.SS, 688795.SS, AAPL, AMD, BABA, BIDU, GOOG, META, OPAI.PVT, TCEHY, TSLA, ^IXIC."},{"id":"ae1636a4-3517-3d3c-881e-5bd8251f95cb","title":"If You'd Invested $10,000 in Nvidia 10 Years Ago, Here's How Much You'd Have Today","url":"https://finance.yahoo.com/m/ae1636a4-3517-3d3c-881e-5bd8251f95cb/if-you%27d-invested-%2410%2C000-in.html","publisher":"Motley Fool","publishedAt":"2025-12-23T06:39:00.000Z","relatedTickers":[],"mainIdea":"If You'd Invested $10,000 in Nvidia 10 Years Ago, Here's How Much You'd Have Today","summary":"Motley Fool: If You'd Invested $10,000 in Nvidia 10 Years Ago, Here's How Much You'd Have Today. Taking a buy-and-hold approach to the chipmaker's stock could have made you a multimillionaire."}]}
