{"symbol":"NIO","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:15.356Z","asOfDate":"2025-12-24","articles":[{"id":"78d96d11-5a86-3a71-a02d-a86c95f4c6d9","title":"ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness","url":"https://finance.yahoo.com/news/zeekr-intelligent-technology-holding-nyse-081123347.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:11:23.000Z","relatedTickers":["ZK"],"mainIdea":"ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness","summary":"Simply Wall St.: ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness. ZEEKR Intelligent Technology Holding (NYSE:ZK) has been drifting slightly lower over the past 3 months, even as revenue and net income have grown at a solid clip. That mismatch raises some interesting valuation questions. See our latest analysis for ZEEKR Intelligent Technology Holding. At the latest share price of $26.73, ZEEKR’s 90 day share price return of negative 7.06 percent and 1 year total shareholder return of negative 10.09 percent suggest momentum has cooled as investors reassess... Related tickers mentioned: ZK."},{"id":"a0bf2302-3a6e-3025-bbba-105efd6516c6","title":"Barclays Is Bullish On NIO Inc. (NIO)","url":"https://finance.yahoo.com/news/barclays-bullish-nio-inc-nio-023410068.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T02:34:10.000Z","relatedTickers":["NIOIF"],"mainIdea":"Barclays Is Bullish On NIO Inc. (NIO)","summary":"Insider Monkey: Barclays Is Bullish On NIO Inc. (NIO). NIO Inc. (NYSE:NIO) is among 10 Best EV Stocks to Buy Heading into 2026. On November 28, TheFly revealed that Barclays had raised its price target for NIO Inc. (NYSE:NIO) from $3 to $4. The stock’s Underweight rating was maintained by the company. According to Barclays, the company’s third-quarter sales and marketing costs were higher, […] Related tickers mentioned: NIOIF."},{"id":"dbaea867-3b3a-3bd7-b6f7-31fe5777b6c8","title":"China’s Sprint for Tech Dominance Can’t Hide an Economy Full of Holes","url":"https://finance.yahoo.com/m/dbaea867-3b3a-3bd7-b6f7-31fe5777b6c8/china%E2%80%99s-sprint-for-tech.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-23T02:00:00.000Z","relatedTickers":[],"mainIdea":"China’s Sprint for Tech Dominance Can’t Hide an Economy Full of Holes","summary":"The Wall Street Journal: China’s Sprint for Tech Dominance Can’t Hide an Economy Full of Holes. A self-sufficiency push has made China a tougher competitor to the U.S., but it comes with enormous waste."}]}
