{"symbol":"NIO","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:02.169Z","asOfDate":"2025-12-27","articles":[{"id":"c4c68f1f-0429-3531-a0e5-94ffb15240ae","title":"Uxin Agrees to $50 Million Investments by NIO Capital, Prestige Shine","url":"https://finance.yahoo.com/news/uxin-agrees-50-million-investments-113716132.html","publisher":"MT Newswires","publishedAt":"2025-12-26T11:37:16.000Z","relatedTickers":[],"mainIdea":"Uxin Agrees to $50 Million Investments by NIO Capital, Prestige Shine","summary":"MT Newswires: Uxin Agrees to $50 Million Investments by NIO Capital, Prestige Shine. Uxin (UXIN) said Friday it has agreed to sell stakes in the company to affiliates of NIO Capital and"},{"id":"7816b7b2-6891-39dd-a7cd-bc55b11f1fc6","title":"Uxin Announces Entry into Share Subscription Agreements with NIO Capital and Prestige Shine Group Limited","url":"https://finance.yahoo.com/news/uxin-announces-entry-share-subscription-110000443.html","publisher":"PR Newswire","publishedAt":"2025-12-26T11:00:00.000Z","relatedTickers":["UXIN"],"mainIdea":"Uxin Announces Entry into Share Subscription Agreements with NIO Capital and Prestige Shine Group Limited","summary":"PR Newswire: Uxin Announces Entry into Share Subscription Agreements with NIO Capital and Prestige Shine Group Limited. Uxin Limited (\"Uxin\" or the \"Company\") (Nasdaq: UXIN), China's leading used car retailer, today announced that the Company has entered into definitive share subscription agreements with affiliates of NIO Capital and Prestige Shine Group Limited (collectively, the \"Investors\"). Related tickers mentioned: UXIN."},{"id":"62bd290e-d168-3999-918e-4edcdfa79222","title":"Chinese EV battery giant CATL and Guoxin Micro set up new automotive chip firm","url":"https://finance.yahoo.com/news/chinese-ev-battery-giant-catl-093000370.html","publisher":"South China Morning Post","publishedAt":"2025-12-26T09:30:00.000Z","relatedTickers":["002049.SZ","CTATF"],"mainIdea":"Chinese EV battery giant CATL and Guoxin Micro set up new automotive chip firm","summary":"South China Morning Post: Chinese EV battery giant CATL and Guoxin Micro set up new automotive chip firm. Contemporary Amperex Technology (CATL), the world's largest maker of electric vehicle batteries, has partnered with semiconductor developer Unigroup Guoxin Microelectronics to form a new automotive chip firm in Beijing. CATL-owned Wending Investment, Guoxin Micro subsidiary Tongxin Micro and five affiliates have agreed to establish Tongxin Micro Technology with a registered capital of 300 million yuan (US$43 million), according to a Thursday filing to the Shenzhen Stock Exchange. With its 153 mi Related tickers mentioned: 002049.SZ, CTATF."}]}
