{"symbol":"CMCSA","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:23.535Z","asOfDate":"2025-12-26","articles":[{"id":"2a84a1c7-0ba8-3d4a-bc82-2f26f3ccd2d1","title":"Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'","url":"https://finance.yahoo.com/m/2a84a1c7-0ba8-3d4a-bc82-2f26f3ccd2d1/trump-says-he%27s-hosting-the.html","publisher":"Benzinga","publishedAt":"2025-12-25T22:30:13.000Z","relatedTickers":[],"mainIdea":"Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'","summary":"Benzinga: Trump Says He's Hosting The Kennedy Center Honors, Floats Idea Of Switching To An Alternative Career: 'Would You Like Me To Leave The Presidency?'. On Tuesday, President Donald Trump confirmed he is serving as “Master of Ceremony” for this year's Kennedy Center Honors ahead of the televised broadcast. Trump Jokes About Life After The White House Trump made the remarks in a post on Truth Social ahead of the televised broadcast of the Kennedy Center Honors, which he hosted earlier this month and is set to air Tuesday night on Paramount Skydance Corp's (NASDAQ:PSKY) CBS and Paramount+. At the urging of the board and what he described as widesp"},{"id":"176ea70b-906b-39ff-b768-da1c88afe219","title":"How Investors May Respond To Comcast (CMCSA) Saudi Theme Park Plans And New Co-CEO Structure","url":"https://finance.yahoo.com/news/investors-may-respond-comcast-cmcsa-071147154.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T07:11:47.000Z","relatedTickers":["AMZN","CMCSV"],"mainIdea":"How Investors May Respond To Comcast (CMCSA) Saudi Theme Park Plans And New Co-CEO Structure","summary":"Simply Wall St.: How Investors May Respond To Comcast (CMCSA) Saudi Theme Park Plans And New Co-CEO Structure. Earlier in December, Comcast’s Universal Studios entered early-stage planning for a multibillion-dollar theme park in Saudi Arabia while Comcast also filed amended articles of incorporation removing obsolete preferred stock references and completed a network expansion to nearly 22,000 locations in Connecticut’s Litchfield County. The company also announced Michael J. Cavanagh’s appointment as Co-CEO from January 2026 and deepened its cloud gaming and managed services reach through Amazon... Related tickers mentioned: AMZN, CMCSV."},{"id":"762507e8-2946-32fa-937b-21dc6430d98c","title":"Amazon.com (AMZN) Is Up 5.0% After Expanding AI Infrastructure, AWS Backlog and Strategic Partnerships – What's Changed","url":"https://finance.yahoo.com/news/amazon-com-amzn-5-0-002059048.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T00:20:59.000Z","relatedTickers":["AMZN"],"mainIdea":"Amazon.com (AMZN) Is Up 5.0% After Expanding AI Infrastructure, AWS Backlog and Strategic Partnerships – What's Changed","summary":"Simply Wall St.: Amazon.com (AMZN) Is Up 5.0% After Expanding AI Infrastructure, AWS Backlog and Strategic Partnerships – What's Changed. In recent days, Amazon and its partners have announced a wave of AI- and cloud-focused initiatives spanning AWS infrastructure expansion, new autonomous AI agents, and deeper collaborations such as a potential US$10 billion OpenAI investment and expanded Amazon Luna access on Comcast’s Xfinity devices. Together with a US$200 billion AWS backlog and heavy data center spending, these moves underline how AI-driven workloads are becoming central to Amazon’s long-term profit engine beyond... Related tickers mentioned: AMZN."}]}
