{"symbol":"PYPL","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:15.004Z","asOfDate":"2025-12-23","articles":[{"id":"60705649-6530-3c73-aa7a-82958685d82a","title":"PayPal (PYPL)’s “Going Lower, Maybe Much Lower,” Says Jim Cramer","url":"https://finance.yahoo.com/news/paypal-pypl-going-lower-maybe-173159984.html","publisher":"Insider Monkey","publishedAt":"2025-12-22T17:31:59.000Z","relatedTickers":[],"mainIdea":"PayPal (PYPL)’s “Going Lower, Maybe Much Lower,” Says Jim Cramer","summary":"Insider Monkey: PayPal (PYPL)’s “Going Lower, Maybe Much Lower,” Says Jim Cramer. We recently published 8 Stocks on Jim Cramer’s Radar. PayPal Holdings, Inc. (NASDAQ:PYPL) is one of the stocks on Jim Cramer’s radars. Payments platform operator PayPal Holdings, Inc. (NASDAQ:PYPL) crossed Jim Cramer’s attention after a fresh piece from investment bank Morgan Stanley. The note was quite impactful as it saw the bank not only downgrade the […]"},{"id":"554c40f4-ae79-386d-b4a4-3dcf50ca20d5","title":"This Week In Digital Payment - Euronet Wins Mastercard Award for Agile Credit Innovation","url":"https://finance.yahoo.com/news/week-digital-payment-euronet-wins-123731753.html","publisher":"Simply Wall St.","publishedAt":"2025-12-22T12:37:31.000Z","relatedTickers":["CCRD","EEFT","MA","SOFI","V"],"mainIdea":"This Week In Digital Payment - Euronet Wins Mastercard Award for Agile Credit Innovation","summary":"Simply Wall St.: This Week In Digital Payment - Euronet Wins Mastercard Award for Agile Credit Innovation. Euronet Worldwide has been recognized with Mastercard's Excellence in Agility award for its innovative approach to credit issuance. This accolade highlights the impact of Euronet's acquisition of CoreCard, which facilitated swift deployment of Mastercard credit programs, significantly enhancing the company's issuing capabilities. The award was granted for Euronet's rapid commercial credit program development, including features like advanced loyalty models and digital wallet provisioning,... Related tickers mentioned: CCRD, EEFT, MA, SOFI, V."},{"id":"fd3ed498-0d2d-36df-9545-a777c8a6e026","title":"Weekly Stock List","url":"https://finance.yahoo.com/m/fd3ed498-0d2d-36df-9545-a777c8a6e026/weekly-stock-list.html","publisher":"Argus Research","publishedAt":"2025-12-22T12:18:29.000Z","relatedTickers":["APTV","CAH","CVS","DRI","EXPE","FDX","GD","JBL","KDP","MCHP","MCHPP","MDT","MRNA","PH","PLTR","RCL","RTX","TPR","UNH"],"mainIdea":"Weekly Stock List","summary":"Argus Research: Weekly Stock List. Third-quarter earnings season is over, and a hefty number of companies across sectors raised guidance. In fact, so many took that action that we are running this list for a second time in recent months. We view management's ability to raise guidance as a catalyst for market-beating returns in the quarters ahead, and note that raising guidance during uncertain economic times, when vision is murky, is especially difficult. The following is a partial list of companies in the Argus Fundamental Universe of Coverage at which management increased its outlook during the recent reporting season. The notable sector imbalance in our list is partially due to when sectors report in the earnings cycle. For example, Financials report early and, as such, were heavily represented in the first list we produced in late October. \"Management Signals\" is one of our Investment Themes as we close out 2025, and we continue to like this theme as it crosses numerous industries and generates a robust list of potential portfolio candidates. Related tickers mentioned: APTV, CAH, CVS, DRI, EXPE, FDX, GD, JBL, KDP, MCHP, MCHPP, MDT, MRNA, PH, PLTR, RCL, RTX, TPR, UNH."}]}
