{"symbol":"BDX","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:18:39.072Z","asOfDate":"2025-12-24","articles":[{"id":"b28ef872-a306-3a84-b643-ddaf3af5e392","title":"Becton Dickinson (BDX): Evaluating Valuation After New Immunology Partnership with University of Pennsylvania","url":"https://finance.yahoo.com/news/becton-dickinson-bdx-evaluating-valuation-021624392.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T02:16:24.000Z","relatedTickers":[],"mainIdea":"Becton Dickinson (BDX): Evaluating Valuation After New Immunology Partnership with University of Pennsylvania","summary":"Simply Wall St.: Becton Dickinson (BDX): Evaluating Valuation After New Immunology Partnership with University of Pennsylvania. Becton Dickinson (BDX) just doubled down on immune system science by teaming up with the University of Pennsylvania’s Institute for Immunology and Immune Health to build advanced flow cytometry panels and run a 1,000 patient immune profiling study. See our latest analysis for Becton Dickinson. Those immune profiling and diagnostics wins come as investors are still cautious, with the share price at $195.67 and a year to date share price return of minus 13.61 percent, while the one year total..."},{"id":"321a6258-c2ca-3264-b116-84243a3108b6","title":"reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage","url":"https://finance.yahoo.com/news/realpha-nasdaq-aire-signs-definitive-213000099.html","publisher":"GlobeNewswire","publishedAt":"2025-12-22T21:30:00.000Z","relatedTickers":["AIRE"],"mainIdea":"reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage","summary":"GlobeNewswire: reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage. Proposed acquisition will add direct mortgage lending capabilities to complement the Company’s existing mortgage brokerage operations Expected to close in the first half of 2026 following regulatory approval DUBLIN, Ohio, Dec. 22, 2025 (GLOBE NEWSWIRE) -- reAlpha Tech Corp. (Nasdaq: AIRE) (the “Company” or “reAlpha”), an AI-powered real estate technology company, today announced that it has entered into a definitive agreement to acquire InstaMortgage Inc. (“InstaMortgage”), an independent mortga Related tickers mentioned: AIRE."},{"id":"047c06af-ad73-34e7-8d54-a4222639dbc3","title":"BD and Penn Institute Ink Collaboration to Advance Immunotherapy","url":"https://finance.yahoo.com/news/bd-penn-institute-ink-collaboration-171200789.html","publisher":"Zacks","publishedAt":"2025-12-22T17:12:00.000Z","relatedTickers":["CAH"],"mainIdea":"BD and Penn Institute Ink Collaboration to Advance Immunotherapy","summary":"Zacks: BD and Penn Institute Ink Collaboration to Advance Immunotherapy. BDX teams up with the Penn Institute for Immunology and Immune Health to launch a high-parameter immune profiling study. Related tickers mentioned: CAH."}]}
