{"symbol":"BDX","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:58:26.545Z","asOfDate":"2025-12-22","articles":[{"id":"321a6258-c2ca-3264-b116-84243a3108b6","title":"reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage","url":"https://finance.yahoo.com/news/realpha-nasdaq-aire-signs-definitive-213000099.html","publisher":"GlobeNewswire","publishedAt":"2025-12-22T21:30:00.000Z","relatedTickers":["AIRE"],"mainIdea":"reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage","summary":"GlobeNewswire: reAlpha (Nasdaq: AIRE) Signs Definitive Agreement to Acquire InstaMortgage. Proposed acquisition will add direct mortgage lending capabilities to complement the Company’s existing mortgage brokerage operations Expected to close in the first half of 2026 following regulatory approval DUBLIN, Ohio, Dec. 22, 2025 (GLOBE NEWSWIRE) -- reAlpha Tech Corp. (Nasdaq: AIRE) (the “Company” or “reAlpha”), an AI-powered real estate technology company, today announced that it has entered into a definitive agreement to acquire InstaMortgage Inc. (“InstaMortgage”), an independent mortga Related tickers mentioned: AIRE."},{"id":"047c06af-ad73-34e7-8d54-a4222639dbc3","title":"BD and Penn Institute Ink Collaboration to Advance Immunotherapy","url":"https://finance.yahoo.com/news/bd-penn-institute-ink-collaboration-171200789.html","publisher":"Zacks","publishedAt":"2025-12-22T17:12:00.000Z","relatedTickers":["CAH"],"mainIdea":"BD and Penn Institute Ink Collaboration to Advance Immunotherapy","summary":"Zacks: BD and Penn Institute Ink Collaboration to Advance Immunotherapy. BDX teams up with the Penn Institute for Immunology and Immune Health to launch a high-parameter immune profiling study. Related tickers mentioned: CAH."},{"id":"c6dd3697-84aa-3a38-a211-23ddf1603c55","title":"Why This 1 Value Stock Could Be a Great Addition to Your Portfolio","url":"https://finance.yahoo.com/news/why-1-value-stock-could-144002968.html","publisher":"Zacks","publishedAt":"2025-12-19T14:40:02.000Z","relatedTickers":[],"mainIdea":"Why This 1 Value Stock Could Be a Great Addition to Your Portfolio","summary":"Zacks: Why This 1 Value Stock Could Be a Great Addition to Your Portfolio. Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}]}
