{"symbol":"CRM","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:34.417Z","asOfDate":"2025-12-24","articles":[{"id":"918ce0a7-6af2-35ca-9dbc-d89952c251d6","title":"3 Artificial Intelligence (AI) Trends to Watch in 2026 and How to Invest in Them","url":"https://finance.yahoo.com/m/918ce0a7-6af2-35ca-9dbc-d89952c251d6/3-artificial-intelligence.html","publisher":"Motley Fool","publishedAt":"2025-12-24T16:05:00.000Z","relatedTickers":[],"mainIdea":"3 Artificial Intelligence (AI) Trends to Watch in 2026 and How to Invest in Them","summary":"Motley Fool: 3 Artificial Intelligence (AI) Trends to Watch in 2026 and How to Invest in Them. AI is constantly evolving, and these companies will continue to push it forward in 2026."},{"id":"02306ee5-190c-3c42-8603-0526199b0bee","title":"2026 Payer IT Outsourcing Outlook: Outcome-Based Managed Services, Production-Grade GenAI Governance, and Vendor-Risk Enforcement","url":"https://finance.yahoo.com/news/2026-payer-outsourcing-outlook-outcome-160000085.html","publisher":"ACCESS Newswire","publishedAt":"2025-12-24T16:00:00.000Z","relatedTickers":[],"mainIdea":"2026 Payer IT Outsourcing Outlook: Outcome-Based Managed Services, Production-Grade GenAI Governance, and Vendor-Risk Enforcement","summary":"ACCESS Newswire: 2026 Payer IT Outsourcing Outlook: Outcome-Based Managed Services, Production-Grade GenAI Governance, and Vendor-Risk Enforcement. Black Book Research Q4 flash survey shows health plans shifting from effort-based sourcing to KPI-backed operating models, tightening third- and fourth-party controls while accelerating platform and cloud contract rationalization. NEW YORK CITY, NEW ..."},{"id":"99eb9c5e-e92f-310f-9eda-47b0d817e124","title":"Salesforce Is Ready to Emerge an AI Winner. Buy the Stock.","url":"https://finance.yahoo.com/m/99eb9c5e-e92f-310f-9eda-47b0d817e124/salesforce-is-ready-to-emerge.html","publisher":"Barrons.com","publishedAt":"2025-12-24T13:00:00.000Z","relatedTickers":["PLTR","^GSPC"],"mainIdea":"Salesforce Is Ready to Emerge an AI Winner. Buy the Stock.","summary":"Barrons.com: Salesforce Is Ready to Emerge an AI Winner. Buy the Stock.. The stock can rally as artificial-intelligence fears fade and management demonstrates commitment to improving profitability. The software sector, once a stalwart on Wall Street, has been whipsawed over the past few years. Then, ChatGPT entered investors’ consciousness. Related tickers mentioned: PLTR, ^GSPC."},{"id":"5d2d704d-9437-3121-b3cf-14fa769e5f40","title":"Why Truist Sees Salesforce (CRM) Positioned for AI-Driven Growth","url":"https://finance.yahoo.com/news/why-truist-sees-salesforce-crm-075719670.html","publisher":"Insider Monkey","publishedAt":"2025-12-24T07:57:19.000Z","relatedTickers":["TFC"],"mainIdea":"Why Truist Sees Salesforce (CRM) Positioned for AI-Driven Growth","summary":"Insider Monkey: Why Truist Sees Salesforce (CRM) Positioned for AI-Driven Growth. Salesforce, Inc. (NYSE:CRM) is one of the AI Stocks Making Waves on Wall Street. On December 15, Truist Securities reiterated its Buy rating on the stock with a price target of $380.00. The rating affirmation follows Salesforce’s Agentforce customer event. According to the research firm, 3QFY26 represented “a solid progress report” on Agentforce and the […] Related tickers mentioned: TFC."},{"id":"1e0b848d-3a6d-3ab7-8b08-c1fd787d7834","title":"How Investors May Respond To Salesforce (CRM) Q3 Beat And Surging Enterprise AI Adoption","url":"https://finance.yahoo.com/news/investors-may-respond-salesforce-crm-042219081.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T04:22:19.000Z","relatedTickers":["NVS"],"mainIdea":"How Investors May Respond To Salesforce (CRM) Q3 Beat And Surging Enterprise AI Adoption","summary":"Simply Wall St.: How Investors May Respond To Salesforce (CRM) Q3 Beat And Surging Enterprise AI Adoption. In recent weeks, Salesforce reported record third-quarter fiscal 2026 results, raised its full-year guidance, and highlighted rapid adoption of its AI products Agentforce and Data 360, underpinned by new deployments at organizations such as Novartis, the U.S. Department of Transportation, and DeVry University. These developments point to Salesforce’s AI platform becoming more deeply embedded in critical workflows across healthcare, government, and education, potentially reinforcing customer... Related tickers mentioned: NVS."},{"id":"212786b9-1c06-3dd2-8e01-ce7d711f8138","title":"Winshear Receives TSX-V Consent for the Option Agreement on the Portsoy Nickel – Copper – Cobalt Project, Scotland","url":"https://finance.yahoo.com/news/winshear-receives-tsx-v-consent-230000974.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T23:00:00.000Z","relatedTickers":["HELOF"],"mainIdea":"Winshear Receives TSX-V Consent for the Option Agreement on the Portsoy Nickel – Copper – Cobalt Project, Scotland","summary":"GlobeNewswire: Winshear Receives TSX-V Consent for the Option Agreement on the Portsoy Nickel – Copper – Cobalt Project, Scotland. VANCOUVER, British Columbia, Dec. 23, 2025 (GLOBE NEWSWIRE) -- Winshear Gold Corp. (TSXV: WINS) (‘Winshear’ or the ‘Company’) reports that the Company has received final approval from the TSX Venture Exchange (the ‘TSX-V’) for the arms-length agreement with Peak Nickel Limited (“Peak Nickel”), a private UK registered company, whereby Winshear can earn a 100% interest in the 250km2 Portsoy Project, located in Aberdeenshire, Northeast Scotland (Map 1) (see news release dated August 11, 2025). A te Related tickers mentioned: HELOF."}]}
