{"symbol":"CRM","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:22:48.153Z","asOfDate":"2025-12-23","articles":[{"id":"e01a544f-c17b-313d-a2e4-cb72ff88c52b","title":"BTIG Says Agentforce Momentum Undervalued as Salesforce (CRM) Enters AI “Second Act”","url":"https://finance.yahoo.com/news/btig-says-agentforce-momentum-undervalued-075458530.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T07:54:58.000Z","relatedTickers":[],"mainIdea":"BTIG Says Agentforce Momentum Undervalued as Salesforce (CRM) Enters AI “Second Act”","summary":"Insider Monkey: BTIG Says Agentforce Momentum Undervalued as Salesforce (CRM) Enters AI “Second Act”. Salesforce, Inc. (NYSE:CRM) is one of the AI Stocks in the Spotlight for Investors. On December 17, BTIG initiated coverage on the stock with a “Buy” rating and a price target of $335.00. Firm analysts see upside on Agentforce momentum, an improving narrative, and underestimated execution. Having helped pioneer the SaaS model nearly three decades […]"},{"id":"feef2db4-232d-35b1-ac68-435b84d6ed07","title":"Weighing Veeva Systems Valuation After Choppy 2025 Performance and DCF Upside Potential","url":"https://finance.yahoo.com/news/weighing-veeva-systems-valuation-choppy-050828923.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T05:08:28.000Z","relatedTickers":["VEEV"],"mainIdea":"Weighing Veeva Systems Valuation After Choppy 2025 Performance and DCF Upside Potential","summary":"Simply Wall St.: Weighing Veeva Systems Valuation After Choppy 2025 Performance and DCF Upside Potential. If you are wondering whether Veeva Systems is actually worth its premium price tag, or if there is still upside left in the story, you are not alone. This breakdown is intended to help you cut through the noise. The stock has been choppy lately, up around 1.5% over the last week but still down roughly 8.5% over the past month. This leaves year to date returns at about 6.1% and close to flat over the last year. Recent headlines have focused on Veeva's continued expansion across life sciences... Related tickers mentioned: VEEV."},{"id":"81bb8fea-f0db-3d9b-ae38-4a1d6c87b4d4","title":"Is CRM Competition Quietly Reshaping Veeva Systems’ (VEEV) Core Commercial Moat?","url":"https://finance.yahoo.com/news/crm-competition-quietly-reshaping-veeva-001304342.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T00:13:04.000Z","relatedTickers":["VEEV"],"mainIdea":"Is CRM Competition Quietly Reshaping Veeva Systems’ (VEEV) Core Commercial Moat?","summary":"Simply Wall St.: Is CRM Competition Quietly Reshaping Veeva Systems’ (VEEV) Core Commercial Moat?. In December 2025, Veeva Systems’ board appointed longtime finance leader Vipin Kondath as principal accounting officer, formalizing his oversight of the company’s financial reporting and controls without altering his compensation terms. At the same time, contrasting analyst views on rising CRM competition and pharma client migrations highlighted growing scrutiny of Veeva’s core commercial platform. We’ll now examine how concerns about CRM competition and pharma client migrations may... Related tickers mentioned: VEEV."}]}
