{"symbol":"COF","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:06.896Z","asOfDate":"2025-12-25","articles":[{"id":"6d288ddf-cf08-3f98-acc1-f19bb92a7882","title":"Analyst Report: Capital One Financial Corporation","url":"https://finance.yahoo.com/m/6d288ddf-cf08-3f98-acc1-f19bb92a7882/analyst-report%3A-capital-one.html","publisher":"Morningstar Research","publishedAt":"2025-12-25T00:40:07.000Z","relatedTickers":["COF-PK","COF-PL","COF-PN"],"mainIdea":"Analyst Report: Capital One Financial Corporation","summary":"Morningstar Research: Analyst Report: Capital One Financial Corporation. Capital One is a diversified financial services holding company headquartered in McLean, Virginia. Originally a spinoff of Signet Financial’s credit card division in 1994, the company is now primarily involved in credit card lending, auto loans, and commercial lending. Following the acquisition of Discover in 2025, the firm also has a modest personal loan business, though credit card lending still provides the majority of the bank's revenue. Related tickers mentioned: COF-PK, COF-PL, COF-PN."},{"id":"12e0e69e-8271-3e84-b50d-88290ccd32a1","title":"Capital One (COF): Reassessing Valuation After a 19% Monthly and 39% Annual Share Price Surge","url":"https://finance.yahoo.com/news/capital-one-cof-reassessing-valuation-171035915.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T17:10:35.000Z","relatedTickers":["COF-PK","COF-PL","COF-PN"],"mainIdea":"Capital One (COF): Reassessing Valuation After a 19% Monthly and 39% Annual Share Price Surge","summary":"Simply Wall St.: Capital One (COF): Reassessing Valuation After a 19% Monthly and 39% Annual Share Price Surge. Capital One Financial (COF) has quietly delivered a strong run, with the stock up roughly 19% over the past month and nearly 39% over the past year. That outperformance now has investors reassessing valuation. See our latest analysis for Capital One Financial. The strong 30 day share price return of 18.71 percent, alongside a 1 year total shareholder return of 38.87 percent, suggests momentum is building as investors warm to Capital One Financial's growth profile and risk reward balance at... Related tickers mentioned: COF-PK, COF-PL, COF-PN."},{"id":"cf19eee4-8f5b-3c60-ad07-5fa47ed45866","title":"The Zacks Analyst Blog Highlights Capital One Financial, BHP and Ping An Insurance","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-capital-151200970.html","publisher":"Zacks","publishedAt":"2025-12-23T15:12:00.000Z","relatedTickers":["BHP","BHPLF","COF-PK","COF-PL","COF-PN","PIAIF","PNGAY"],"mainIdea":"The Zacks Analyst Blog Highlights Capital One Financial, BHP and Ping An Insurance","summary":"Zacks: The Zacks Analyst Blog Highlights Capital One Financial, BHP and Ping An Insurance. Capital One Financial headlines Zacks' latest Analyst Blog as investors eye a possible Santa Rally amid global market volatility and key macro events. Related tickers mentioned: BHP, BHPLF, COF-PK, COF-PL, COF-PN, PIAIF, PNGAY."}]}
