{"symbol":"DIS","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:04:24.826Z","asOfDate":"2025-12-23","articles":[{"id":"41fefe16-0c38-3c9f-a596-560ad6a42bce","title":"New to Investing? This 1 Consumer Discretionary Stock Could Be the Perfect Starting Point","url":"https://finance.yahoo.com/news/investing-1-consumer-discretionary-stock-143003362.html","publisher":"Zacks","publishedAt":"2025-12-23T14:30:03.000Z","relatedTickers":[],"mainIdea":"New to Investing? This 1 Consumer Discretionary Stock Could Be the Perfect Starting Point","summary":"Zacks: New to Investing? This 1 Consumer Discretionary Stock Could Be the Perfect Starting Point. Finding strong, market-beating stocks with a positive earnings outlook becomes easier with the Focus List, a top feature of the Zacks Premium portfolio service."},{"id":"b0cab254-4e50-390a-b2f0-5d9b15f04cd5","title":"Gold Has Shone Through Tariffs, AI Fears, Global Risk. Why 2026 Looks Bright.","url":"https://finance.yahoo.com/m/b0cab254-4e50-390a-b2f0-5d9b15f04cd5/gold-has-shone-through.html","publisher":"Barrons.com","publishedAt":"2025-12-23T11:46:00.000Z","relatedTickers":["D","FLUT","NFLX","PSKY","WBD"],"mainIdea":"Gold Has Shone Through Tariffs, AI Fears, Global Risk. Why 2026 Looks Bright.","summary":"Barrons.com: Gold Has Shone Through Tariffs, AI Fears, Global Risk. Why 2026 Looks Bright.. Oracle’s Ellison puts guarantee on Paramount’s Warner Bros. bid, Trump deals offshore wind industry another blow, FanDuel launches prediction market, and more news to start your day. Related tickers mentioned: D, FLUT, NFLX, PSKY, WBD."},{"id":"b3a75110-df3b-3eb3-a884-0c397e0bb377","title":"Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?","url":"https://finance.yahoo.com/news/invesco-large-cap-value-etf-112003155.html","publisher":"Zacks","publishedAt":"2025-12-23T11:20:03.000Z","relatedTickers":["PWV"],"mainIdea":"Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?","summary":"Zacks: Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?. Smart Beta ETF report for PWV Related tickers mentioned: PWV."},{"id":"b9355e13-12f2-3d50-8c12-7e52e81985e5","title":"Mattel brings on vet from Netflix, Disney","url":"https://finance.yahoo.com/m/b9355e13-12f2-3d50-8c12-7e52e81985e5/mattel-brings-on-vet-from.html","publisher":"Retail Dive","publishedAt":"2025-12-23T10:39:00.000Z","relatedTickers":["MAT"],"mainIdea":"Mattel brings on vet from Netflix, Disney","summary":"Retail Dive: Mattel brings on vet from Netflix, Disney. Natalia Premovic was named chief consumer products and experiences officer as the toy company draws on its IP for new projects. Related tickers mentioned: MAT."},{"id":"de8faf8e-a727-3b30-bc2e-588a0226b672","title":"European Dividend Stocks To Consider For Your Portfolio","url":"https://finance.yahoo.com/news/european-dividend-stocks-consider-portfolio-053146839.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T05:31:46.000Z","relatedTickers":["BPSO.MI","BRAV.ST","CMBNF","DKSHF","DMCOF","HCMLF","TKMAF","ZFSVF"],"mainIdea":"European Dividend Stocks To Consider For Your Portfolio","summary":"Simply Wall St.: European Dividend Stocks To Consider For Your Portfolio. As European markets show signs of steady economic growth and benefit from looser monetary policies, the pan-European STOXX Europe 600 Index has risen by 1.60%, reflecting a positive sentiment across major stock indexes like Italy’s FTSE MIB and France’s CAC 40. In such an environment, dividend stocks can offer investors a blend of income and potential capital appreciation, making them an attractive consideration for those looking to enhance their portfolios with reliable returns amidst... Related tickers mentioned: BPSO.MI, BRAV.ST, CMBNF, DKSHF, DMCOF, HCMLF, TKMAF, ZFSVF."},{"id":"1e586ce9-0f4a-3154-9c89-3ed4f6c8f49b","title":"Larry Ellison Provides Personal Guarantee for Paramount’s Bid for Warner","url":"https://finance.yahoo.com/m/1e586ce9-0f4a-3154-9c89-3ed4f6c8f49b/larry-ellison-provides.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-22T23:34:00.000Z","relatedTickers":["PSKY","WBD"],"mainIdea":"Larry Ellison Provides Personal Guarantee for Paramount’s Bid for Warner","summary":"The Wall Street Journal: Larry Ellison Provides Personal Guarantee for Paramount’s Bid for Warner. He agreed to personally guarantee $40.4 billion of equity financing for the deal and publish records related to the family trust that backstops it. Related tickers mentioned: PSKY, WBD."},{"id":"f476e55c-e903-3053-adcd-4823c7002d7b","title":"Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.","url":"https://finance.yahoo.com/m/f476e55c-e903-3053-adcd-4823c7002d7b/paramount-stock-rallies-after.html","publisher":"Barrons.com","publishedAt":"2025-12-22T21:12:00.000Z","relatedTickers":["ORCL","PSKY","WBD"],"mainIdea":"Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.","summary":"Barrons.com: Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.. Paramount Skydance amended its offer for Warner Bros. Discovery on Monday, guaranteeing the backing of Oracle founder Larry Ellison following the rejection last week of its hostile bid. Paramount said in a news release that it wouldn’t be raising its offer of $30 a share for all of Warner Discovery. “Our $30 per share, fully financed all-cash offer was on Dec. 4, and continues to be, the superior option to maximize value for WBD shareholders… We expect the board of directors of WBD to take the necessary steps to secure this value-enhancing transaction and preserve and strengthen an iconic Hollywood treasure for the future,” David Ellison said. Related tickers mentioned: ORCL, PSKY, WBD."}]}
