{"symbol":"DIS","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:12.475Z","asOfDate":"2025-12-25","articles":[{"id":"f419ef44-9dbf-34b8-babf-fd9b6619610f","title":"New CEO and Breakup Plan Could Be A Game Changer For Kraft Heinz (KHC)","url":"https://finance.yahoo.com/news/ceo-breakup-plan-could-game-050940082.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T05:09:40.000Z","relatedTickers":["ABI.BR","K","KHC","KO"],"mainIdea":"New CEO and Breakup Plan Could Be A Game Changer For Kraft Heinz (KHC)","summary":"Simply Wall St.: New CEO and Breakup Plan Could Be A Game Changer For Kraft Heinz (KHC). The Kraft Heinz Company has appointed Steve Cahillane as its next CEO effective January 1, 2026, and as future CEO of the planned Global Taste Elevation Co., while Carlos Abrams-Rivera will step down and stay on as an advisor through March 6, 2026, to support a smooth transition. Cahillane’s track record leading complex separations and brand portfolios at Kellanova, Coca-Cola, AB InBev and Nature’s Bounty directly aligns with Kraft Heinz’s plan to split into two independent, publicly traded... Related tickers mentioned: ABI.BR, K, KHC, KO."},{"id":"89ec9205-99e1-380e-a197-e7fb7cee331f","title":"Walt Disney (DIS) Beats Stock Market Upswing: What Investors Need to Know","url":"https://finance.yahoo.com/news/walt-disney-dis-beats-stock-224502622.html","publisher":"Zacks","publishedAt":"2025-12-24T22:45:02.000Z","relatedTickers":["^DJI","^GSPC"],"mainIdea":"Walt Disney (DIS) Beats Stock Market Upswing: What Investors Need to Know","summary":"Zacks: Walt Disney (DIS) Beats Stock Market Upswing: What Investors Need to Know. Walt Disney (DIS) closed the most recent trading day at $114.48, moving +1.11% from the previous trading session. Related tickers mentioned: ^DJI, ^GSPC."},{"id":"1257f9d8-67e5-375a-8187-2c1a9de613cd","title":"These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More","url":"https://finance.yahoo.com/m/1257f9d8-67e5-375a-8187-2c1a9de613cd/these-stocks-are-moving-the.html","publisher":"Barrons.com","publishedAt":"2025-12-24T17:39:00.000Z","relatedTickers":["AAPL","AMC","INTC","LRCX","MSTR","MU","NKE","NVDA","PATH","TSLA","VSNTV"],"mainIdea":"These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More","summary":"Barrons.com: These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More. Nike rises after Apple CEO Tim Cook snaps up shares, while Tesla stock drops amid door safety investigation. Related tickers mentioned: AAPL, AMC, INTC, LRCX, MSTR, MU, NKE, NVDA, PATH, TSLA, VSNTV."}]}
