{"symbol":"VOO","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:11.335Z","asOfDate":"2025-12-27","articles":[{"id":"d9d58130-e882-32e0-8de7-a06b1ac31656","title":"Better Vanguard ETF: VOO vs. VOOG","url":"https://finance.yahoo.com/m/d9d58130-e882-32e0-8de7-a06b1ac31656/better-vanguard-etf%3A-voo-vs..html","publisher":"Motley Fool","publishedAt":"2025-12-27T16:50:01.000Z","relatedTickers":["^GSPC"],"mainIdea":"Better Vanguard ETF: VOO vs. VOOG","summary":"Motley Fool: Better Vanguard ETF: VOO vs. VOOG. Expense ratios, dividend yields, and sector mix set these two Vanguard ETFs apart for investors seeking the right market balance. Related tickers mentioned: ^GSPC."},{"id":"14f280ec-f0c0-35ab-8f0f-878d11a1faf1","title":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","url":"https://finance.yahoo.com/news/silver-jumps-6-platinum-8-160108318.html","publisher":"Benzinga","publishedAt":"2025-12-27T16:01:08.000Z","relatedTickers":["PA=F","PL=F","SI=F"],"mainIdea":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","summary":"Benzinga: Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?. While Wall Street traded in a subdued session marked by thin liquidity and low volumes following the Christmas market closure, price action turned wild across precious and industrial metals. By midday trading in New York, silver prices — as tracked by the iShares Silver Trust (NYSE:SLV) — surged more than 6%, breaking above $76 an ounce, fueled by an intensifying supply crunch across Asian markets. The move pushed silver's year-to-date gains to roughly 164%, marking the metal's strongest annual Related tickers mentioned: PA=F, PL=F, SI=F."},{"id":"2bad7ffd-c766-3853-a017-cf8a7c3555ab","title":"One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026","url":"https://finance.yahoo.com/m/2bad7ffd-c766-3853-a017-cf8a7c3555ab/one-avantis-etf-beat.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-27T15:08:43.000Z","relatedTickers":["AVEM","IEMG","TSM","VTI"],"mainIdea":"One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026","summary":"24/7 Wall St.: One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026. The Avantis Emerging Markets Equity ETF (NYSEARCA:AVEM) delivered a 35% return in 2025, outperforming Vanguard’s largest funds and signaling emerging markets might finally be having their moment. With $15.1 billion in assets and concentrated bets on Asian technology and financials, the fund beat both Vanguard S&P 500 ETF (NYSEARCA:VOO) and Vanguard Total Stock Market ETF ... One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026 Related tickers mentioned: AVEM, IEMG, TSM, VTI."}]}
