{"symbol":"VOO","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:16.367Z","asOfDate":"2025-12-26","articles":[{"id":"f929427d-62d6-36b4-8d41-b2f5bf1a45a1","title":"Mexican Stocks Hammer Wall Street As Peso Notches Best Year Since 1993","url":"https://finance.yahoo.com/news/mexican-stocks-hammer-wall-street-013112848.html","publisher":"Benzinga","publishedAt":"2025-12-26T01:31:12.000Z","relatedTickers":["MXN=X","QQQ"],"mainIdea":"Mexican Stocks Hammer Wall Street As Peso Notches Best Year Since 1993","summary":"Benzinga: Mexican Stocks Hammer Wall Street As Peso Notches Best Year Since 1993. Mexican financial assets are closing out one of their strongest years in decades, stunning global investors and decisively outperforming Wall Street benchmarks. A synchronized rally in equities and the Mexican peso has erased early fears that renewed U.S. protectionist rhetoric under President Donald Trump would derail Mexico's markets. Instead, 2025 has turned into a historic year for Mexican assets. Mexico's Market Rally Leaves Wall Street In The Dust The iShares Mexico ETF (NYSE:EWW) surged m Related tickers mentioned: MXN=X, QQQ."},{"id":"eb1a328e-8868-32b4-8310-9162ed545362","title":"As Warren Buffett Enters Retirement, An Overlooked Berkshire Trade From Last Year Is Back in Focus. Should Investors Be Worried Heading Into 2026?","url":"https://finance.yahoo.com/m/eb1a328e-8868-32b4-8310-9162ed545362/as-warren-buffett-enters.html","publisher":"Motley Fool","publishedAt":"2025-12-25T19:05:00.000Z","relatedTickers":["BRK.A","^GSPC"],"mainIdea":"As Warren Buffett Enters Retirement, An Overlooked Berkshire Trade From Last Year Is Back in Focus. Should Investors Be Worried Heading Into 2026?","summary":"Motley Fool: As Warren Buffett Enters Retirement, An Overlooked Berkshire Trade From Last Year Is Back in Focus. Should Investors Be Worried Heading Into 2026?. Warren Buffett is stepping down as CEO of Berkshire Hathaway at the end of 2025. Related tickers mentioned: BRK.A, ^GSPC."},{"id":"dda848f8-a01c-36e5-a105-99c2f682057c","title":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","url":"https://finance.yahoo.com/news/xtrackers-russell-us-multifactor-etf-112001749.html","publisher":"Zacks","publishedAt":"2025-12-25T11:20:01.000Z","relatedTickers":["DB","DEUS"],"mainIdea":"Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?","summary":"Zacks: Should Xtrackers Russell US Multifactor ETF (DEUS) Be on Your Investing Radar?. Style Box ETF report for DEUS Related tickers mentioned: DB, DEUS."}]}
