{"symbol":"CI","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:17.098Z","asOfDate":"2025-12-23","articles":[{"id":"f0e644bb-e73a-3cd8-ae03-5cd904c369b6","title":"How Investors Are Reacting To Tenet Healthcare (THC) Cigna Dispute Over Abrazo Reimbursement Rates","url":"https://finance.yahoo.com/news/investors-reacting-tenet-healthcare-thc-010434224.html","publisher":"Simply Wall St.","publishedAt":"2025-12-20T01:04:34.000Z","relatedTickers":["THC"],"mainIdea":"How Investors Are Reacting To Tenet Healthcare (THC) Cigna Dispute Over Abrazo Reimbursement Rates","summary":"Simply Wall St.: How Investors Are Reacting To Tenet Healthcare (THC) Cigna Dispute Over Abrazo Reimbursement Rates. In recent days, Tenet Healthcare has been locked in a contract dispute with Cigna that could leave about 413,000 Cigna enrollees in Arizona without access to Tenet’s Abrazo Health network, as the parties clash over reimbursement rates for hospital and provider services. Beyond Arizona, the disagreement highlights how reimbursement conflicts between major insurers and health systems can ripple across Tenet’s broad national footprint, with potential consequences for patient access and... Related tickers mentioned: THC."},{"id":"003d9ae5-b72e-36a5-918a-c6ee4b043f9c","title":"Health Insurer Stocks Spooked as Trump Asks for Lower Premiums","url":"https://finance.yahoo.com/m/003d9ae5-b72e-36a5-918a-c6ee4b043f9c/health-insurer-stocks-spooked.html","publisher":"Barrons.com","publishedAt":"2025-12-19T21:58:00.000Z","relatedTickers":["ELV","HUM","UNH"],"mainIdea":"Health Insurer Stocks Spooked as Trump Asks for Lower Premiums","summary":"Barrons.com: Health Insurer Stocks Spooked as Trump Asks for Lower Premiums. At Friday’s news conference announcing the latest drug-pricing deals, Trump said he wants health insurers to ‘ease up and start cutting prices’ as well. Related tickers mentioned: ELV, HUM, UNH."},{"id":"1de303d3-1533-3342-b0df-cafa4f65d314","title":"Democrats Pounce as Congress Allows Obamacare Premiums to Spike","url":"https://finance.yahoo.com/news/democrats-pounce-congress-allows-obamacare-134500099.html","publisher":"Bloomberg","publishedAt":"2025-12-19T13:45:00.000Z","relatedTickers":["CNC","ELV","MOH","OSCR","UNH"],"mainIdea":"Democrats Pounce as Congress Allows Obamacare Premiums to Spike","summary":"Bloomberg: Democrats Pounce as Congress Allows Obamacare Premiums to Spike. Health care premiums for more than 20 million Americans will, on average, more than double in 2026, which risks putting insurance out of reach for many voters already concerned about the costs of housing, groceries, utilities and other expenses. When lawmakers return to the Capitol next month, they have less than two weeks to resolve the issue before open enrollment ends Jan. 15. Amid fierce Republican infighting, Democrats are already declaring victory. Related tickers mentioned: CNC, ELV, MOH, OSCR, UNH."}]}
