{"symbol":"ARKW","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:57:59.468Z","asOfDate":"2025-12-22","articles":[{"id":"4203ea1a-8d05-38b2-9b55-0dbe21dc5e63","title":"Cathie Wood Dumps $11 Milllion Worth Of Tesla Stock While Doubling Down On These Notable Crypto Plays","url":"https://finance.yahoo.com/news/cathie-wood-dumps-11-milllion-193021656.html","publisher":"Benzinga","publishedAt":"2025-12-20T19:30:21.000Z","relatedTickers":["ARKK","COIN","SLMT","TSLA"],"mainIdea":"Cathie Wood Dumps $11 Milllion Worth Of Tesla Stock While Doubling Down On These Notable Crypto Plays","summary":"Benzinga: Cathie Wood Dumps $11 Milllion Worth Of Tesla Stock While Doubling Down On These Notable Crypto Plays. On Thursday, Cathie Wood-led Ark Invest made significant trades involving Tesla Inc. (NASDAQ:TSLA), Coinbase Global Inc. (NASDAQ:COIN), and Brera Holdings PLC (NASDAQ:SLMT). The Tesla Trade Ark Invest executed a notable transaction by selling 23,110 shares of Tesla through its ARK Innovation ETF (BATS:ARKK). The sale, valued at approximately $11.2 million, comes amid a backdrop of Tesla’s stock pulling back after reaching all-time highs earlier in the week. Tesla’s shares have been experiencing Related tickers mentioned: ARKK, COIN, SLMT, TSLA."},{"id":"176f30d3-206c-3600-99ec-66e49a2abb81","title":"Ark Invest Adds 17,386 More Coinbase Stock after System Upgrade Announcement","url":"https://finance.yahoo.com/m/176f30d3-206c-3600-99ec-66e49a2abb81/ark-invest-adds-17%2C386-more.html","publisher":"Coinspeaker","publishedAt":"2025-12-19T13:56:45.000Z","relatedTickers":["ARKK","BLSH","COIN","CRCL"],"mainIdea":"Ark Invest Adds 17,386 More Coinbase Stock after System Upgrade Announcement","summary":"Coinspeaker: Ark Invest Adds 17,386 More Coinbase Stock after System Upgrade Announcement. For the second time in less than one week, Cathie Wood’s Ark Invest has acquired more Coinbase (COIN) stock across its Exchange Traded Funds (ETFs). The asset management firm placed the bet on Coinbase, which recently unveiled a system upgrade earlier this week. Ark Invest Conducts Routine Portfolio Rebalancing Ark ... Related tickers mentioned: ARKK, BLSH, COIN, CRCL."},{"id":"e597d4d2-aa72-31f3-b09d-db539ed013fb","title":"Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?","url":"https://finance.yahoo.com/m/e597d4d2-aa72-31f3-b09d-db539ed013fb/cathie-wood-keeps-buying-the.html","publisher":"Barchart","publishedAt":"2025-12-17T16:17:45.000Z","relatedTickers":["ARKK","CRWV"],"mainIdea":"Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?","summary":"Barchart: Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?. Down almost 62% from all-time highs, Cathie Wood continues to purchase shares of CoreWeave in December 2025, as the AI infrastructure company continues to grow rapidly. Related tickers mentioned: ARKK, CRWV."}]}
