{"symbol":"C","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:52.039Z","asOfDate":"2025-12-23","articles":[{"id":"d2f7a592-12b5-38b3-bc6e-b5ffb0ad49c1","title":"Citigroup (C) Outpaces Stock Market Gains: What You Should Know","url":"https://finance.yahoo.com/news/citigroup-c-outpaces-stock-market-224505487.html","publisher":"Zacks","publishedAt":"2025-12-22T22:45:05.000Z","relatedTickers":["^DJI","^GSPC"],"mainIdea":"Citigroup (C) Outpaces Stock Market Gains: What You Should Know","summary":"Zacks: Citigroup (C) Outpaces Stock Market Gains: What You Should Know. Citigroup (C) closed the most recent trading day at $118.09, moving +2.81% from the previous trading session. Related tickers mentioned: ^DJI, ^GSPC."},{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","GS","JPM","MS","MS-PQ","WFC","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve's current interest rate environment. Also catch Yahoo Finance Senior Banking Reporter David Hollerith and Hennion & Walsh CIO Kevin Mahn discuss the 2026 outlook for regional banks. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, GS, JPM, MS, MS-PQ, WFC, XLF."},{"id":"72d00916-1312-3ae0-af67-1eaf1494157f","title":"HSBC Names Ida Liu as CEO of HSBC Private Bank","url":"https://finance.yahoo.com/news/hsbc-names-ida-liu-ceo-194456227.html","publisher":"MT Newswires","publishedAt":"2025-12-22T19:44:56.000Z","relatedTickers":["HSBC"],"mainIdea":"HSBC Names Ida Liu as CEO of HSBC Private Bank","summary":"MT Newswires: HSBC Names Ida Liu as CEO of HSBC Private Bank. HSBC (HSBC) said Monday it has secured the services of former Citigroup (C) executive Ida Liu as chi Related tickers mentioned: HSBC."}]}
