{"symbol":"C","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:08.248Z","asOfDate":"2025-12-22","articles":[{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","GS","JPM","MS","MS-PQ","WFC","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve Related tickers mentioned: BAC, GS, JPM, MS, MS-PQ, WFC, XLF."},{"id":"72d00916-1312-3ae0-af67-1eaf1494157f","title":"HSBC Names Ida Liu as CEO of HSBC Private Bank","url":"https://finance.yahoo.com/news/hsbc-names-ida-liu-ceo-194456227.html","publisher":"MT Newswires","publishedAt":"2025-12-22T19:44:56.000Z","relatedTickers":["HSBC"],"mainIdea":"HSBC Names Ida Liu as CEO of HSBC Private Bank","summary":"MT Newswires: HSBC Names Ida Liu as CEO of HSBC Private Bank. HSBC (HSBC) said Monday it has secured the services of former Citigroup (C) executive Ida Liu as chi Related tickers mentioned: HSBC."},{"id":"fd19a070-6a95-330b-a406-dc34ec98dda7","title":"How Regulatory and Legal Relief Shapes Citigroup’s (C) Turnaround and Risk-Management Story","url":"https://finance.yahoo.com/news/regulatory-legal-relief-shapes-citigroup-190708594.html","publisher":"Simply Wall St.","publishedAt":"2025-12-22T19:07:08.000Z","relatedTickers":[],"mainIdea":"How Regulatory and Legal Relief Shapes Citigroup’s (C) Turnaround and Risk-Management Story","summary":"Simply Wall St.: How Regulatory and Legal Relief Shapes Citigroup’s (C) Turnaround and Risk-Management Story. In recent days, Citigroup has secured meaningful regulatory relief as the Federal Reserve closed key supervisory notices and the Office of the Comptroller of the Currency withdrew a 2024 amendment to its 2020 consent order, while a UK Supreme Court ruling blocked a multibillion-pound forex lawsuit against the bank. Together, this easing of regulatory and legal pressure has helped clear some long-standing overhangs, giving analysts more confidence in Citi’s operational turnaround and..."}]}
