{"symbol":"C","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:25.170Z","asOfDate":"2025-12-27","articles":[{"id":"213f69f9-14d1-3960-b06a-4c6e7b01c607","title":"PNC Financial Hits a New 52-Week High: How to Approach the Stock?","url":"https://finance.yahoo.com/news/pnc-financial-hits-52-week-182800662.html","publisher":"Zacks","publishedAt":"2025-12-26T18:28:00.000Z","relatedTickers":["BAC","PNC"],"mainIdea":"PNC Financial Hits a New 52-Week High: How to Approach the Stock?","summary":"Zacks: PNC Financial Hits a New 52-Week High: How to Approach the Stock?. PNC touches a new 52-week high. Does the stock have more upside as strong Q3 U.S. economic growth and optimism around the FirstBank deal lift investor confidence? Related tickers mentioned: BAC, PNC."},{"id":"5824fa0a-b4ed-37d6-9039-958ce8f0e8ea","title":"Private credit risks: What to make of Oracle's debt, AI trade","url":"https://finance.yahoo.com/video/private-credit-risks-oracles-debt-113052437.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-26T11:30:52.000Z","relatedTickers":["BAC","GS","JPM","MS","MS-PQ","ORCL","WFC","XLF"],"mainIdea":"Private credit risks: What to make of Oracle's debt, AI trade","summary":"Yahoo Finance Video: Private credit risks: What to make of Oracle's debt, AI trade. TPW Advisory founder Jay Pelosky and Whalen Global Advisors founder and chairman Chris Whalen come on Market Catalysts to discuss the credit risks materializing in the AI trade and Magnificent Seven tech names, most notably Oracle's (ORCL) growing debt amid concerns of an AI bubble risk. Also catch Jay Pelosky and Chris Whalen share their insights into the banking sector heading into 2026, the next phase in the commodities super cycle, and forecasts on non-US equities. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, GS, JPM, MS, MS-PQ, ORCL, WFC, XLF."},{"id":"108865a7-b744-3a2c-9424-b7d380cd3416","title":"The Zacks Analyst Blog Wells Fargo, Bank of America and Citigroup","url":"https://finance.yahoo.com/news/zacks-analyst-blog-wells-fargo-072500423.html","publisher":"Zacks","publishedAt":"2025-12-26T07:25:00.000Z","relatedTickers":["BAC","WFC"],"mainIdea":"The Zacks Analyst Blog Wells Fargo, Bank of America and Citigroup","summary":"Zacks: The Zacks Analyst Blog Wells Fargo, Bank of America and Citigroup. Wells Fargo leads a trio of big banks positioned to benefit as Fed rate cuts lift loan demand, stabilize funding costs and boost fee income. Related tickers mentioned: BAC, WFC."}]}
