{"symbol":"NFLX","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:49.751Z","asOfDate":"2025-12-24","articles":[{"id":"1257f9d8-67e5-375a-8187-2c1a9de613cd","title":"These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More","url":"https://finance.yahoo.com/m/1257f9d8-67e5-375a-8187-2c1a9de613cd/these-stocks-are-moving-the.html","publisher":"Barrons.com","publishedAt":"2025-12-24T17:39:00.000Z","relatedTickers":["AAPL","AMC","DIS","INTC","LRCX","MSTR","MU","NKE","NVDA","PATH","TSLA","VSNTV"],"mainIdea":"These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More","summary":"Barrons.com: These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More. Nike rises after Apple CEO Tim Cook snaps up shares, while Tesla stock drops amid door safety investigation. Related tickers mentioned: AAPL, AMC, DIS, INTC, LRCX, MSTR, MU, NKE, NVDA, PATH, TSLA, VSNTV."},{"id":"06b9110d-c69a-3815-a055-8819bb5e9a2d","title":"2025 Changed the Media Business. Next Year Could Be Even More Turbulent.","url":"https://finance.yahoo.com/m/06b9110d-c69a-3815-a055-8819bb5e9a2d/2025-changed-the-media.html","publisher":"Barrons.com","publishedAt":"2025-12-24T15:19:00.000Z","relatedTickers":["CMCSA","PSKY","VSNTV","WBD"],"mainIdea":"2025 Changed the Media Business. Next Year Could Be Even More Turbulent.","summary":"Barrons.com: 2025 Changed the Media Business. Next Year Could Be Even More Turbulent.. Headlines regarding the battle for Warner Bros. just scratch the surface of how busy this year has been for the media industry. Related tickers mentioned: CMCSA, PSKY, VSNTV, WBD."},{"id":"32d9e845-20d0-3fb3-b1ea-8efb3c36ca77","title":"Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.","url":"https://finance.yahoo.com/m/32d9e845-20d0-3fb3-b1ea-8efb3c36ca77/mergers-%26-acquisitions-soared.html","publisher":"Barrons.com","publishedAt":"2025-12-24T14:41:00.000Z","relatedTickers":["AMZN","CRWD","CYBR","GOOG","PANW"],"mainIdea":"Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.","summary":"Barrons.com: Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.. Mergers and acquisitions rose this year — and they can keep rising. Total M&A dollars so far this year rose to $4.39 trillion, according to data from London Stock Exchange Group. The increase in aggregate deal value is driven by larger deals, with the number of deals fairly stable. Related tickers mentioned: AMZN, CRWD, CYBR, GOOG, PANW."},{"id":"28c268d5-775e-3998-be60-937e0cfd12fa","title":"2 Stock-Split Stocks Billionaires Are Piling Into for 2026","url":"https://finance.yahoo.com/m/28c268d5-775e-3998-be60-937e0cfd12fa/2-stock-split-stocks.html","publisher":"Motley Fool","publishedAt":"2025-12-24T08:26:00.000Z","relatedTickers":[],"mainIdea":"2 Stock-Split Stocks Billionaires Are Piling Into for 2026","summary":"Motley Fool: 2 Stock-Split Stocks Billionaires Are Piling Into for 2026. Wall Street's hottest stock-split stocks have been purchased in bulk by some of the savviest billionaire money managers."},{"id":"9dc1a6ae-ca6c-3fd5-988f-4a16f4d5811c","title":"Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance","url":"https://finance.yahoo.com/news/warner-bros-discovery-confirms-receipt-232019880.html","publisher":"TipRanks","publishedAt":"2025-12-23T23:20:19.000Z","relatedTickers":["PSKY","WBD"],"mainIdea":"Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance","summary":"TipRanks: Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance. Warner Bros. Discovery (WBD) confirmed that it has received an amended, unsolicited tender offer from Paramount Skydance (PSKY) to acquire all of the outstanding shares of Warner Bros. Discovery common stock. The Warner Bros. Discovery Board of Directors, consistent with its fiduciary duties and in consultation with its independent financial and legal advisors, will carefully review and consider Paramount Skydance’s offer in accordance with the terms of Warner Bros. Discovery’s agreement with Ne Related tickers mentioned: PSKY, WBD."}]}
