{"symbol":"NFLX","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:18:29.070Z","asOfDate":"2025-12-24","articles":[{"id":"28c268d5-775e-3998-be60-937e0cfd12fa","title":"2 Stock-Split Stocks Billionaires Are Piling Into for 2026","url":"https://finance.yahoo.com/m/28c268d5-775e-3998-be60-937e0cfd12fa/2-stock-split-stocks.html","publisher":"Motley Fool","publishedAt":"2025-12-24T08:26:00.000Z","relatedTickers":[],"mainIdea":"2 Stock-Split Stocks Billionaires Are Piling Into for 2026","summary":"Motley Fool: 2 Stock-Split Stocks Billionaires Are Piling Into for 2026. Wall Street's hottest stock-split stocks have been purchased in bulk by some of the savviest billionaire money managers."},{"id":"06b9110d-c69a-3815-a055-8819bb5e9a2d","title":"2025 Changed the Media Business. Next Year Could Be Even More Turbulent.","url":"https://finance.yahoo.com/m/06b9110d-c69a-3815-a055-8819bb5e9a2d/2025-changed-the-media.html","publisher":"Barrons.com","publishedAt":"2025-12-24T07:30:00.000Z","relatedTickers":["VSNTV","WBD"],"mainIdea":"2025 Changed the Media Business. Next Year Could Be Even More Turbulent.","summary":"Barrons.com: 2025 Changed the Media Business. Next Year Could Be Even More Turbulent.. Headlines regarding the battle for Warner Bros. just scratch the surface of how busy this year has been for the media industry. Related tickers mentioned: VSNTV, WBD."},{"id":"9dc1a6ae-ca6c-3fd5-988f-4a16f4d5811c","title":"Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance","url":"https://finance.yahoo.com/news/warner-bros-discovery-confirms-receipt-232019880.html","publisher":"TipRanks","publishedAt":"2025-12-23T23:20:19.000Z","relatedTickers":["PSKY","WBD"],"mainIdea":"Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance","summary":"TipRanks: Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance. Warner Bros. Discovery (WBD) confirmed that it has received an amended, unsolicited tender offer from Paramount Skydance (PSKY) to acquire all of the outstanding shares of Warner Bros. Discovery common stock. The Warner Bros. Discovery Board of Directors, consistent with its fiduciary duties and in consultation with its independent financial and legal advisors, will carefully review and consider Paramount Skydance’s offer in accordance with the terms of Warner Bros. Discovery’s agreement with Ne Related tickers mentioned: PSKY, WBD."}]}
