{"symbol":"NFLX","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:58:08.529Z","asOfDate":"2025-12-22","articles":[{"id":"165f10a5-b23a-395e-a427-d45d50aed3a4","title":"Wall Street Advances as Holiday-Shortened Trading Week Begins; Gold, Silver Hit Record Highs","url":"https://finance.yahoo.com/news/wall-street-advances-holiday-shortened-213447301.html","publisher":"MT Newswires","publishedAt":"2025-12-22T21:34:47.000Z","relatedTickers":["CL=F","GC=F","SI=F","^DJI","^GSPC","^IXIC"],"mainIdea":"Wall Street Advances as Holiday-Shortened Trading Week Begins; Gold, Silver Hit Record Highs","summary":"MT Newswires: Wall Street Advances as Holiday-Shortened Trading Week Begins; Gold, Silver Hit Record Highs. US equities rose Monday, extending their gains to a third consecutive session at the start of a holi Related tickers mentioned: CL=F, GC=F, SI=F, ^DJI, ^GSPC, ^IXIC."},{"id":"82960b4b-678c-322c-88ac-3e12a6289136","title":"These Stocks Moved the Most Today: Tesla, Warner Bros., Rocket Lab, DJT, Dominion Energy, Newmont, Micron, and More","url":"https://finance.yahoo.com/m/82960b4b-678c-322c-88ac-3e12a6289136/these-stocks-moved-the-most.html","publisher":"Barrons.com","publishedAt":"2025-12-22T21:19:00.000Z","relatedTickers":["D","MU","NEM","ORCL","RKLB","TSLA","WBD"],"mainIdea":"These Stocks Moved the Most Today: Tesla, Warner Bros., Rocket Lab, DJT, Dominion Energy, Newmont, Micron, and More","summary":"Barrons.com: These Stocks Moved the Most Today: Tesla, Warner Bros., Rocket Lab, DJT, Dominion Energy, Newmont, Micron, and More. Tesla shares rise after a Delaware Supreme Court ruling officially restores CEO Elon Musk’s 2018 pay package. Related tickers mentioned: D, MU, NEM, ORCL, RKLB, TSLA, WBD."},{"id":"f476e55c-e903-3053-adcd-4823c7002d7b","title":"Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.","url":"https://finance.yahoo.com/m/f476e55c-e903-3053-adcd-4823c7002d7b/paramount-stock-rallies-after.html","publisher":"Barrons.com","publishedAt":"2025-12-22T21:12:00.000Z","relatedTickers":["DIS","ORCL","PSKY","WBD"],"mainIdea":"Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.","summary":"Barrons.com: Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.. Paramount Skydance amended its offer for Warner Bros. Discovery on Monday, guaranteeing the backing of Oracle founder Larry Ellison following the rejection last week of its hostile bid. Paramount said in a news release that it wouldn’t be raising its offer of $30 a share for all of Warner Discovery. “Our $30 per share, fully financed all-cash offer was on Dec. 4, and continues to be, the superior option to maximize value for WBD shareholders… We expect the board of directors of WBD to take the necessary steps to secure this value-enhancing transaction and preserve and strengthen an iconic Hollywood treasure for the future,” David Ellison said. Related tickers mentioned: DIS, ORCL, PSKY, WBD."}]}
