{"symbol":"BA","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:38.562Z","asOfDate":"2025-12-23","articles":[{"id":"84eccfda-44c9-3247-86d9-fb532a05dc62","title":"Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?","url":"https://finance.yahoo.com/news/howmet-sustain-growth-commercial-aerospace-171700427.html","publisher":"Zacks","publishedAt":"2025-12-23T17:17:00.000Z","relatedTickers":["HWM","RBC"],"mainIdea":"Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?","summary":"Zacks: Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?. HWM is riding a surge in commercial aerospace demand, with rising air travel and strong aircraft programs driving steady revenue growth. Related tickers mentioned: HWM, RBC."},{"id":"6831e405-9d6b-3986-a467-30b4bd30bb50","title":"October Durable Goods Orders Fall as Aircraft Demand Tumbles","url":"https://finance.yahoo.com/news/october-durable-goods-orders-fall-160133638.html","publisher":"MT Newswires","publishedAt":"2025-12-23T16:01:33.000Z","relatedTickers":[],"mainIdea":"October Durable Goods Orders Fall as Aircraft Demand Tumbles","summary":"MT Newswires: October Durable Goods Orders Fall as Aircraft Demand Tumbles. Demand for US durable goods declined more than expected in October, weighed down by double-digit dro"},{"id":"144dd25d-b106-3722-960f-5914acce8900","title":"Ryanair Shares Surge 55% as Buyback and Earnings Lift Stock","url":"https://finance.yahoo.com/news/ryanair-shares-surge-55-buyback-151755630.html","publisher":"GuruFocus.com","publishedAt":"2025-12-23T15:17:55.000Z","relatedTickers":["NWARF","RYAAY","RYAOF"],"mainIdea":"Ryanair Shares Surge 55% as Buyback and Earnings Lift Stock","summary":"GuruFocus.com: Ryanair Shares Surge 55% as Buyback and Earnings Lift Stock. This article first appeared on GuruFocus. Investors have gravitated toward execution and cost discipline in a year of restrained economic optimism in Europe, lifting Ryanair Holdings Plc (NASDAQ:RYAAY) to the top of the regional airline sector. The carrier's shares rose 55% this year, making it the best-performing European stock in the Bloomberg World Airlines Index after Norwegian Air Shuttle, supported by earnings growth and a 750 million share buyback. Related tickers mentioned: NWARF, RYAAY, RYAOF."},{"id":"382b8150-7c1b-36c2-9352-7da85ce58fb1","title":"Amaroq Closes Acquisition of West Greenland Hub Assets","url":"https://finance.yahoo.com/news/amaroq-closes-acquisition-west-greenland-115706489.html","publisher":"MT Newswires","publishedAt":"2025-12-23T11:57:06.000Z","relatedTickers":[],"mainIdea":"Amaroq Closes Acquisition of West Greenland Hub Assets","summary":"MT Newswires: Amaroq Closes Acquisition of West Greenland Hub Assets. Amaroq (AMRQ.V) on Tuesday said it has closed its acquisitions of the entire issued share capital of"},{"id":"ac731bad-0fd2-32bf-b761-c63d9463482d","title":"Jim Cramer Highlights Alphabet’s Diverse Portfolio","url":"https://finance.yahoo.com/news/jim-cramer-highlights-alphabet-diverse-051610017.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T05:16:10.000Z","relatedTickers":["AVGO","GOOG","JPM"],"mainIdea":"Jim Cramer Highlights Alphabet’s Diverse Portfolio","summary":"Insider Monkey: Jim Cramer Highlights Alphabet’s Diverse Portfolio. Alphabet Inc. (NASDAQ:GOOGL) is one of the stocks Jim Cramer answered questions about. Starting the round of “Am I Diversified?”, a caller mentioned that their top five portfolio holdings are JPM, GOOGL, BA, PG, and AVGO. Cramer commented: “Let’s go to work in a year of practical investing, it’s upcoming…. Okay, so Broadcom, we know […] Related tickers mentioned: AVGO, GOOG, JPM."},{"id":"2df14432-becb-3e95-84a0-d44a731eff4f","title":"Analyst Report: The Boeing Company","url":"https://finance.yahoo.com/m/2df14432-becb-3e95-84a0-d44a731eff4f/analyst-report%3A-the-boeing.html","publisher":"Morningstar Research","publishedAt":"2025-12-23T00:58:48.000Z","relatedTickers":["EADSF","LMT","NOC"],"mainIdea":"Analyst Report: The Boeing Company","summary":"Morningstar Research: Analyst Report: The Boeing Company. Boeing is a major aerospace and defense firm operating in three segments: commercial airplanes; defense, space, and security; and global services. Boeing's commercial airplanes segment competes with Airbus in the production of aircraft that can carry more than 130 passengers. Boeing's defense, space, and security segment competes with defense contractors such as Lockheed Martin and Northrop Grumman to create military aircraft, satellites, and weaponry. Global services provides aftermarket support to airlines. Related tickers mentioned: EADSF, LMT, NOC."},{"id":"cbcb27ac-83a8-31dd-a2a8-67abb38ecf62","title":"ULA President and CEO Tory Bruno steps down","url":"https://finance.yahoo.com/m/cbcb27ac-83a8-31dd-a2a8-67abb38ecf62/ula-president-and-ceo-tory.html","publisher":"Orlando Sentinel","publishedAt":"2025-12-22T18:45:00.000Z","relatedTickers":["LMT"],"mainIdea":"ULA President and CEO Tory Bruno steps down","summary":"Orlando Sentinel: ULA President and CEO Tory Bruno steps down. United Launch Alliance’s leader for the last 12 years has stepped down. ULA President and CEO Tory Bruno has resigned as of Monday to “pursue another opportunity,” according to a shared statement from the board chairs from Lockheed Martin and Boeing, which share a 50% ownership of the rocket company. “We are grateful for Tory’s service to ULA and the country, and we thank him for his ... Related tickers mentioned: LMT."}]}
