{"symbol":"BA","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:41.848Z","asOfDate":"2025-12-24","articles":[{"id":"909ec622-e275-3a2d-8df2-d52826b24446","title":"Does Boeing’s Rebound and Safety Scrutiny Leave Further Share Price Upside in 2025?","url":"https://finance.yahoo.com/news/does-boeing-rebound-safety-scrutiny-001359511.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T00:13:59.000Z","relatedTickers":[],"mainIdea":"Does Boeing’s Rebound and Safety Scrutiny Leave Further Share Price Upside in 2025?","summary":"Simply Wall St.: Does Boeing’s Rebound and Safety Scrutiny Leave Further Share Price Upside in 2025?. Wondering if Boeing is still worth buying after its rollercoaster few years, or if the real value has already been priced in? This article unpacks whether the current share price lines up with what the business is actually worth. After a tough stretch, Boeing has quietly climbed, with the stock up 4.9% over the last week, 20.7% over the past month, and 26.2% year to date. It is now 20.9% higher than a year ago and modestly ahead over five years at 0.3%. Recent headlines have focused on..."},{"id":"84eccfda-44c9-3247-86d9-fb532a05dc62","title":"Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?","url":"https://finance.yahoo.com/news/howmet-sustain-growth-commercial-aerospace-171700427.html","publisher":"Zacks","publishedAt":"2025-12-23T17:17:00.000Z","relatedTickers":["HWM","RBC"],"mainIdea":"Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?","summary":"Zacks: Can Howmet Sustain Growth as Commercial Aerospace Demand Surges?. HWM is riding a surge in commercial aerospace demand, with rising air travel and strong aircraft programs driving steady revenue growth. Related tickers mentioned: HWM, RBC."},{"id":"6831e405-9d6b-3986-a467-30b4bd30bb50","title":"October Durable Goods Orders Fall as Aircraft Demand Tumbles","url":"https://finance.yahoo.com/news/october-durable-goods-orders-fall-160133638.html","publisher":"MT Newswires","publishedAt":"2025-12-23T16:01:33.000Z","relatedTickers":[],"mainIdea":"October Durable Goods Orders Fall as Aircraft Demand Tumbles","summary":"MT Newswires: October Durable Goods Orders Fall as Aircraft Demand Tumbles. Demand for US durable goods declined more than expected in October, weighed down by double-digit dro"}]}
