{"symbol":"BA","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:09.850Z","asOfDate":"2025-12-22","articles":[{"id":"cbcb27ac-83a8-31dd-a2a8-67abb38ecf62","title":"ULA President and CEO Tory Bruno steps down","url":"https://finance.yahoo.com/m/cbcb27ac-83a8-31dd-a2a8-67abb38ecf62/ula-president-and-ceo-tory.html","publisher":"Orlando Sentinel","publishedAt":"2025-12-22T18:45:00.000Z","relatedTickers":["LMT"],"mainIdea":"ULA President and CEO Tory Bruno steps down","summary":"Orlando Sentinel: ULA President and CEO Tory Bruno steps down. United Launch Alliance’s leader for the last 12 years has stepped down. ULA President and CEO Tory Bruno has resigned as of Monday to “pursue another opportunity,” according to a shared statement from the board chairs from Lockheed Martin and Boeing, which share a 50% ownership of the rocket company. “We are grateful for Tory’s service to ULA and the country, and we thank him for his ... Related tickers mentioned: LMT."},{"id":"3aae6ee6-b76a-3346-a3ad-998da705284c","title":"Northrop Grumman Corp. (NOC) Secures $100M Missile Weapon System Contract as Analyst Optimism Grows","url":"https://finance.yahoo.com/news/northrop-grumman-corp-noc-secures-155648767.html","publisher":"Insider Monkey","publishedAt":"2025-12-21T15:56:48.000Z","relatedTickers":["GE","NOC","RTX"],"mainIdea":"Northrop Grumman Corp. (NOC) Secures $100M Missile Weapon System Contract as Analyst Optimism Grows","summary":"Insider Monkey: Northrop Grumman Corp. (NOC) Secures $100M Missile Weapon System Contract as Analyst Optimism Grows. Northrop Grumman Corporation (NYSE:NOC) is one of the best aerospace and defense stocks to buy, according to Wall Street analysts. On December 12, Citi initiated coverage of Northrop Grumman with a Buy rating and a $654 price target. The firm also began coverage on 24 aerospace and defense names, pointing to strong long-term trends across […] Related tickers mentioned: GE, NOC, RTX."},{"id":"5a79a49b-a3da-3151-81ee-0efe006be3b1","title":"Boeing (BA) Secures Major Navy Contract as Ratings Agencies Turn More Positive","url":"https://finance.yahoo.com/news/boeing-ba-secures-major-navy-155646850.html","publisher":"Insider Monkey","publishedAt":"2025-12-21T15:56:46.000Z","relatedTickers":[],"mainIdea":"Boeing (BA) Secures Major Navy Contract as Ratings Agencies Turn More Positive","summary":"Insider Monkey: Boeing (BA) Secures Major Navy Contract as Ratings Agencies Turn More Positive. The Boeing Company (NYSE:BA) is one of the best aerospace and defense stocks to buy, according to Wall Street analysts. On December 16, Boeing landed a $930.77 million U.S. Navy contract to extend the service life of up to 60 F/A‑18 E/F Super Hornets. The agreement covers upgrades that will push the aircraft’s lifespan from […]"}]}
