{"symbol":"GE","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:49.232Z","asOfDate":"2025-12-24","articles":[{"id":"62b2085c-ecb8-33d9-85f9-745cd771a908","title":"Aerospace Leader Howmet Poised To Hit New Buy Point","url":"https://finance.yahoo.com/m/62b2085c-ecb8-33d9-85f9-745cd771a908/aerospace-leader-howmet.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T16:39:21.000Z","relatedTickers":["BA","EADSF","HWM","LMT","SWK"],"mainIdea":"Aerospace Leader Howmet Poised To Hit New Buy Point","summary":"Investor's Business Daily: Aerospace Leader Howmet Poised To Hit New Buy Point. Howmet Stock: The aerospace leader is approaching a new buy point following strong gains in recent sessions. Related tickers mentioned: BA, EADSF, HWM, LMT, SWK."},{"id":"bc9f36b8-3a58-3268-96af-0813ce22a821","title":"The Zacks Analyst Blog Highlights Archer Aviation, GE Aerospace and Howmet Aerospace","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-archer-145300169.html","publisher":"Zacks","publishedAt":"2025-12-24T14:53:00.000Z","relatedTickers":["ACHR","HWM"],"mainIdea":"The Zacks Analyst Blog Highlights Archer Aviation, GE Aerospace and Howmet Aerospace","summary":"Zacks: The Zacks Analyst Blog Highlights Archer Aviation, GE Aerospace and Howmet Aerospace. Archer Aviation is highlighted by Zacks as defense spending rises, positioning the eVTOL developer to benefit from military modernization in 2026. Related tickers mentioned: ACHR, HWM."},{"id":"ef940e8e-c66e-369e-8982-695d224c5828","title":"The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-mastercard-143700418.html","publisher":"Zacks","publishedAt":"2025-12-24T14:37:00.000Z","relatedTickers":["GEV","MA","MU","VALU"],"mainIdea":"The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line","summary":"Zacks: The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line. Zacks' Analyst Blog spotlights Mastercard, GE Aerospace, Micron and Value Line, highlighting strong performance drivers and key risks shaping outlooks. Related tickers mentioned: GEV, MA, MU, VALU."},{"id":"eb0e7425-df88-366d-a978-012b64ef965d","title":"Analyst Report: GE Aerospace","url":"https://finance.yahoo.com/m/eb0e7425-df88-366d-a978-012b64ef965d/analyst-report%3A-ge-aerospace.html","publisher":"Morningstar Research","publishedAt":"2025-12-24T01:26:08.000Z","relatedTickers":["SAFRF"],"mainIdea":"Analyst Report: GE Aerospace","summary":"Morningstar Research: Analyst Report: GE Aerospace. GE Aerospace is the global leader in designing, manufacturing, and servicing commercial aircraft engines, along with partner Safran in their CFM joint venture. With its massive global installed base of nearly 70,000 commercial and military engines, GE Aerospace earns most of its profits on recurring service revenue of that equipment, which operates for decades. GE Aerospace is the remaining core business of the company formed in 1892 with historical ties to American inventor Thomas Edison; that company became a storied conglomerate with peak revenue of $130 billion in 2000 until GE spun off its appliance, finance, healthcare, and wind and power businesses between 2016 and 2024. Related tickers mentioned: SAFRF."},{"id":"7cc66270-c036-3749-b907-4c1951d1f427","title":"Top Research Reports for Mastercard, GE Aerospace & Micron Technology","url":"https://finance.yahoo.com/news/top-research-reports-mastercard-ge-211200063.html","publisher":"Zacks","publishedAt":"2025-12-23T21:12:00.000Z","relatedTickers":["MA","MU","SU","VALU","VLO"],"mainIdea":"Top Research Reports for Mastercard, GE Aerospace & Micron Technology","summary":"Zacks: Top Research Reports for Mastercard, GE Aerospace & Micron Technology. Mastercard leads today's top research as analysts spotlight solid revenue growth, digital payment tailwinds, and rising costs to watch. Related tickers mentioned: MA, MU, SU, VALU, VLO."},{"id":"584ccfcf-9afb-39ea-ae55-44e682ca1bdf","title":"Rising Geopolitical Tensions - 3 Defense Stocks to Watch in 2026","url":"https://finance.yahoo.com/news/rising-geopolitical-tensions-3-defense-191000775.html","publisher":"Zacks","publishedAt":"2025-12-23T19:10:00.000Z","relatedTickers":["ACHR","HWM"],"mainIdea":"Rising Geopolitical Tensions - 3 Defense Stocks to Watch in 2026","summary":"Zacks: Rising Geopolitical Tensions - 3 Defense Stocks to Watch in 2026. ACHR, GE and HWM are positioned to benefit as geopolitical tensions drive sustained defense spending and accelerated military modernization. Related tickers mentioned: ACHR, HWM."}]}
