{"symbol":"GE","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:27:29.659Z","asOfDate":"2025-12-25","articles":[{"id":"2ae284cc-4bcc-3738-84f9-b9f8312bf4c5","title":"3 Reasons to Buy Uber Stock Like There's No Tomorrow","url":"https://finance.yahoo.com/m/2ae284cc-4bcc-3738-84f9-b9f8312bf4c5/3-reasons-to-buy-uber-stock.html","publisher":"Motley Fool","publishedAt":"2025-12-25T02:20:00.000Z","relatedTickers":["DASH","GRAB","LYFT","UBER"],"mainIdea":"3 Reasons to Buy Uber Stock Like There's No Tomorrow","summary":"Motley Fool: 3 Reasons to Buy Uber Stock Like There's No Tomorrow. Investors may not appreciate all of the tailwinds that could drive Uber stock higher. Related tickers mentioned: DASH, GRAB, LYFT, UBER."},{"id":"7a73b397-4798-3997-b7bd-518c6021af3f","title":"General Electric (GE): Rethinking Valuation After a Strong Multi-Year Share Price Run","url":"https://finance.yahoo.com/news/general-electric-ge-rethinking-valuation-015212690.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T01:52:12.000Z","relatedTickers":[],"mainIdea":"General Electric (GE): Rethinking Valuation After a Strong Multi-Year Share Price Run","summary":"Simply Wall St.: General Electric (GE): Rethinking Valuation After a Strong Multi-Year Share Price Run. General Electric (GE) has quietly added to its gains, with the stock edging up about 9% over the past week and roughly 8% in the past month, extending a strong year to date move. See our latest analysis for General Electric. At a share price of $316.75 and with an 87.88% year to date share price return alongside a 3 year total shareholder return above 500%, GE’s recent surge suggests momentum is still firmly building as investors reassess its growth and risk profile. If GE’s run has you..."},{"id":"62b2085c-ecb8-33d9-85f9-745cd771a908","title":"Aerospace Leader Howmet Poised To Hit New Buy Point","url":"https://finance.yahoo.com/m/62b2085c-ecb8-33d9-85f9-745cd771a908/aerospace-leader-howmet.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T16:39:21.000Z","relatedTickers":["BA","EADSF","HWM","LMT","SWK"],"mainIdea":"Aerospace Leader Howmet Poised To Hit New Buy Point","summary":"Investor's Business Daily: Aerospace Leader Howmet Poised To Hit New Buy Point. Howmet Stock: The aerospace leader is approaching a new buy point following strong gains in recent sessions. Related tickers mentioned: BA, EADSF, HWM, LMT, SWK."}]}
