{"symbol":"LLY","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:22:49.372Z","asOfDate":"2025-12-24","articles":[{"id":"8c4e07e4-1a88-338e-8b66-f25389da9c15","title":"NVO's First Oral Obesity Pill Approval: What Does it Mean for Lilly?","url":"https://finance.yahoo.com/news/nvos-first-oral-obesity-pill-154900283.html","publisher":"Zacks","publishedAt":"2025-12-24T15:49:00.000Z","relatedTickers":["NONOF","NVO"],"mainIdea":"NVO's First Oral Obesity Pill Approval: What Does it Mean for Lilly?","summary":"Zacks: NVO's First Oral Obesity Pill Approval: What Does it Mean for Lilly?. NVO secures FDA approval for its first oral obesity pill, Wegovy, giving it a first-to-market edge and raising questions about Lilly's next move. Related tickers mentioned: NONOF, NVO."},{"id":"7f5ee1a3-cf05-3d63-adc1-94389706829c","title":"Obesity Medicine Association Releases Position Statement: A New Era for Medicare & Medicaid Obesity Medication Coverage","url":"https://finance.yahoo.com/news/obesity-medicine-association-releases-position-130000696.html","publisher":"Newsfile","publishedAt":"2025-12-24T13:00:00.000Z","relatedTickers":["NVO"],"mainIdea":"Obesity Medicine Association Releases Position Statement: A New Era for Medicare & Medicaid Obesity Medication Coverage","summary":"Newsfile: Obesity Medicine Association Releases Position Statement: A New Era for Medicare & Medicaid Obesity Medication Coverage. Centennial, Colorado--(Newsfile Corp. - December 24, 2025) - The Obesity Medicine Association (OMA) released its Position Statement on Medicare and Medicaid Coverage and Expanded Access to Obesity Medications, detailing the association's recommendations and support for emerging federal policies expected to dramatically improve treatment access for millions of Americans living with obesity. The OMA commends the Centers for Medicare and Medicaid Services (CMS) and pharmaceutical partners,... Related tickers mentioned: NVO."},{"id":"32ff7c57-3c10-38da-bfb6-75d922b27898","title":"3 Stocks That Investors Might Be Undervaluing By Up To 32.3%","url":"https://finance.yahoo.com/news/3-stocks-investors-might-undervaluing-113756614.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T11:37:56.000Z","relatedTickers":["BLFS","CLFD","COLB","CWBC","DDOG","FLY","SMA","SRAD","UMBF","VRT","^GSPC"],"mainIdea":"3 Stocks That Investors Might Be Undervaluing By Up To 32.3%","summary":"Simply Wall St.: 3 Stocks That Investors Might Be Undervaluing By Up To 32.3%. As the S&P 500 closes at a record high, buoyed by stronger-than-expected economic growth and a tech stock rally, investors are keenly observing which sectors might lead the market next year. Amidst this optimistic environment, identifying undervalued stocks becomes crucial as they may offer potential opportunities for those looking to capitalize on market inefficiencies. Related tickers mentioned: BLFS, CLFD, COLB, CWBC, DDOG, FLY, SMA, SRAD, UMBF, VRT, ^GSPC."},{"id":"e7b323ac-4b41-316a-8559-4c67222cb9ee","title":"How Early Zugo-cel Data and Lilly Partnership Could Impact CRISPR Therapeutics (CRSP) Investors","url":"https://finance.yahoo.com/news/early-zugo-cel-data-lilly-031024162.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T03:10:24.000Z","relatedTickers":["CRSP"],"mainIdea":"How Early Zugo-cel Data and Lilly Partnership Could Impact CRISPR Therapeutics (CRSP) Investors","summary":"Simply Wall St.: How Early Zugo-cel Data and Lilly Partnership Could Impact CRISPR Therapeutics (CRSP) Investors. Earlier this week, CRISPR Therapeutics reported encouraging early-stage clinical data for its allogeneic CD19 CAR T therapy, zugo-cel, in aggressive B-cell lymphoma and autoimmune diseases, and disclosed a new collaboration with Eli Lilly to test zugo-cel alongside pirtobrutinib. By pairing strong initial response rates and a favorable safety profile with Lilly’s kinase inhibitor, CRISPR Therapeutics is broadening zugo-cel’s potential role across both oncology and autoimmune... Related tickers mentioned: CRSP."},{"id":"0cf99f11-7227-3016-8e09-bca101da013a","title":"The U.S. Offered Putin’s Closest Ally Sanctions Relief—and a Weight-Loss Drug","url":"https://finance.yahoo.com/m/0cf99f11-7227-3016-8e09-bca101da013a/the-u.s.-offered-putin%E2%80%99s.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-24T02:00:00.000Z","relatedTickers":["META"],"mainIdea":"The U.S. Offered Putin’s Closest Ally Sanctions Relief—and a Weight-Loss Drug","summary":"The Wall Street Journal: The U.S. Offered Putin’s Closest Ally Sanctions Relief—and a Weight-Loss Drug. Engaging one of the world’s most repressive regimes, Trump envoy bonded with Belarusian dictator over Zepbound and obtained the release of hundreds of prisoners. Related tickers mentioned: META."},{"id":"4e201570-f1a0-3c58-a43f-becb623e7e7d","title":"Novo Nordisk says FDA approved Wegovy pill to reduce body weight","url":"https://finance.yahoo.com/news/novo-nordisk-says-fda-approved-230036512.html","publisher":"TipRanks","publishedAt":"2025-12-23T23:00:36.000Z","relatedTickers":["NONOF","NVO"],"mainIdea":"Novo Nordisk says FDA approved Wegovy pill to reduce body weight","summary":"TipRanks: Novo Nordisk says FDA approved Wegovy pill to reduce body weight. Novo Nordisk (NVO) “announced that the FDA has approved the Wegovy pill (once-daily oral semaglutide 25 mg) to reduce excess body weight and maintain weight reduction long term and to reduce the risk of major adverse cardiovascular events. The Wegovy pill is the first oral glucagon-like peptide-1, GLP-1, receptor agonist therapy approved for weight management. The approval is based on the OASIS trial programme and the SELECT trial2. In the OASIS 4 trial, oral semaglutide 25 mg taken once daily d Related tickers mentioned: NONOF, NVO."}]}
