{"symbol":"^ADD","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:17.807Z","asOfDate":"2025-12-23","articles":[{"id":"aee87482-d7c3-3a73-8307-f83c16e2a2f5","title":"How Recent Developments Are Reshaping The SuRo Capital Investment Story","url":"https://finance.yahoo.com/news/recent-developments-reshaping-suro-capital-080933212.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:09:33.000Z","relatedTickers":["SSSS"],"mainIdea":"How Recent Developments Are Reshaping The SuRo Capital Investment Story","summary":"Simply Wall St.: How Recent Developments Are Reshaping The SuRo Capital Investment Story. SuRo Capital's latest narrative pivot centers on a raised price target anchored by an unchanged fair value of $11.15, even as the discount rate nudged down from 8.91% to 8.86% and revenue growth expectations remain stuck near -18.29%. Bulls see this as confirmation that improving portfolio momentum and clearer post Q3 visibility are not yet fully reflected in the share price, while bears argue the incremental move underscores lingering macro and liquidity risks around private exits. Stay... Related tickers mentioned: SSSS."},{"id":"78dc7ab1-19e5-36ab-bb0d-ebbe48aebcfa","title":"Swedish Businesses Shift from AI Curiosity to Action, Says Dstny Sweden","url":"https://finance.yahoo.com/news/swedish-businesses-shift-ai-curiosity-080000007.html","publisher":"PR Newswire","publishedAt":"2025-12-23T08:00:00.000Z","relatedTickers":[],"mainIdea":"Swedish Businesses Shift from AI Curiosity to Action, Says Dstny Sweden","summary":"PR Newswire: Swedish Businesses Shift from AI Curiosity to Action, Says Dstny Sweden. Swedish businesses have moved decisively from AI curiosity to implementation throughout 2025, with AI now representing 20% of new sales at Dstny Sweden, expected to reach 30% in 2026."},{"id":"dec7eb7b-a0ab-3828-8cec-c8c66bd7dc36","title":"UPS and 11 Other Stocks With Sky-High Dividends and No Clear Answers","url":"https://finance.yahoo.com/m/dec7eb7b-a0ab-3828-8cec-c8c66bd7dc36/ups-and-11-other-stocks-with.html","publisher":"Barrons.com","publishedAt":"2025-12-23T07:30:00.000Z","relatedTickers":["CPB","F","UPS","VZ","^GSPC"],"mainIdea":"UPS and 11 Other Stocks With Sky-High Dividends and No Clear Answers","summary":"Barrons.com: UPS and 11 Other Stocks With Sky-High Dividends and No Clear Answers. United Parcel Service has had a devil of a year. While UPS’s dividend yield, one of the highest in the looks tantalizing, Wolfe Research strategist Chris Senyek points out that being in the highest-yielding club doesn’t typically add up to stock market success. Related tickers mentioned: CPB, F, UPS, VZ, ^GSPC."}]}
