{"symbol":"BLK","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:40:14.017Z","asOfDate":"2025-12-24","articles":[{"id":"f774a74c-f1e8-39c5-a72c-a90e169783cc","title":"Fed 2026 outlook: New Fed chair, Trump's push for lower rates","url":"https://finance.yahoo.com/video/fed-2026-outlook-fed-chair-183003792.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-24T18:30:03.000Z","relatedTickers":[],"mainIdea":"Fed 2026 outlook: New Fed chair, Trump's push for lower rates","summary":"Yahoo Finance Video: Fed 2026 outlook: New Fed chair, Trump's push for lower rates. The Federal Reserve is expected to have an eventful 2026, with the central bank's officials divided on how to handle interest rates and President Trump set to nominate someone to replace Fed Chair Jerome Powell when his term is up in May. Yahoo Finance Fed Correspondent Jennifer Schonberger outlines the details. Make sure to check out Jennifer Schonberger's profiles on each of the possible candidates to be the next Fed chair: former Fed Governor Kevin Warsh, the supposed frontrunner and National Economic Council director Kevin Hassett, Fed Governor Chris Waller, Fed Vice Chair of Supervision Michelle Bowman, and BlackRock's (BLK) head of fixed income Rick Rieder. Also watch Jennifer Schonberger's full interview with Kevin Hassett. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Domination Overtime."},{"id":"c86facdd-8694-3687-bfd4-c5d657a980d8","title":"Umicore - Transparency notification by BlackRock, Inc.","url":"https://finance.yahoo.com/news/umicore-transparency-notification-blackrock-inc-173000941.html","publisher":"GlobeNewswire","publishedAt":"2025-12-24T17:30:00.000Z","relatedTickers":["UMICF","UMICY"],"mainIdea":"Umicore - Transparency notification by BlackRock, Inc.","summary":"GlobeNewswire: Umicore - Transparency notification by BlackRock, Inc.. Transparency notification by BlackRock, Inc. In accordance with article 14, § 1 of the law of 2 May 2007 on the disclosure of major holdings, Umicore was recently notified by BlackRock, Inc. that it has crossed the legal threshold of 5% for the direct voting rights and equivalent financial instruments upwards on 22 December 2025. The total holding of direct voting rights and equivalent financial instruments of BlackRock, Inc. stands at 5.20% on 22 December 2025. Summary of the move: Date on whic Related tickers mentioned: UMICF, UMICY."},{"id":"5d588c0d-21cc-3b6b-a4aa-09d23bdb1d0d","title":"Trump’s Fed Chair Pick Puts Bessent in the Crosshairs","url":"https://finance.yahoo.com/m/5d588c0d-21cc-3b6b-a4aa-09d23bdb1d0d/trump%E2%80%99s-fed-chair-pick-puts.html","publisher":"Barrons.com","publishedAt":"2025-12-24T15:27:00.000Z","relatedTickers":[],"mainIdea":"Trump’s Fed Chair Pick Puts Bessent in the Crosshairs","summary":"Barrons.com: Trump’s Fed Chair Pick Puts Bessent in the Crosshairs. Scott Bessent has offered up candidates who share his vision of lower rates and cooperation with the White House. It could all backfire."},{"id":"568bed6e-f61a-3744-a445-46b29fe3e1e6","title":"Phoenix Tower International Closes on the Acquisition of Approximately 3,700 Sites from Bouygues Telecom and SFR","url":"https://finance.yahoo.com/news/phoenix-tower-international-closes-acquisition-142600436.html","publisher":"PR Newswire","publishedAt":"2025-12-24T14:26:00.000Z","relatedTickers":[],"mainIdea":"Phoenix Tower International Closes on the Acquisition of Approximately 3,700 Sites from Bouygues Telecom and SFR","summary":"PR Newswire: Phoenix Tower International Closes on the Acquisition of Approximately 3,700 Sites from Bouygues Telecom and SFR. Phoenix Tower International (\"PTI\") is pleased to announce the company successfully closed the acquisition of Infracos, the joint venture owned by Bouygues Telecom and SFR that manages approximately 3,700 wireless sites located in medium dense areas across France. This strategic investment brings PTI's French portfolio to nearly 10,000 nationwide sites, including committed Build-to-Suit (BTS) deployments."},{"id":"c1f2cede-900a-38e6-ab7b-30cca1bd40c9","title":"Transaction in Own Shares","url":"https://finance.yahoo.com/news/transaction-own-shares-070100657.html","publisher":"GlobeNewswire","publishedAt":"2025-12-24T07:01:00.000Z","relatedTickers":["DEC"],"mainIdea":"Transaction in Own Shares","summary":"GlobeNewswire: Transaction in Own Shares. DIVERSIFIED ENERGY COMPANY (\"Diversified\", or the \"Company\") DIVERSIFIED ENERGY COMPANY (NYSE:DEC; LSE:DEC) announces that, in accordance with the terms of its share buyback program announced on March 20, 2025, the Company has purchased 54,988 shares of common stock, par value $0.01 per share of the Company (the \"Shares\") in the market at a volume-weighted average price of $13.9712 per Share through Mizuho Securities USA LLC (MSUSA). The Shares acquired will, in due course, be cancelled. Aggrega Related tickers mentioned: DEC."},{"id":"e5a775e9-ced8-374d-8f90-0581029160b3","title":"Tech groups shift $120bn of AI data centre debt off balance sheets","url":"https://finance.yahoo.com/news/tech-groups-shift-120bn-ai-050029816.html","publisher":"Financial Times","publishedAt":"2025-12-24T05:00:29.000Z","relatedTickers":["CRWV","JPM","META","ORCL","XAAI.PVT"],"mainIdea":"Tech groups shift $120bn of AI data centre debt off balance sheets","summary":"Financial Times: Tech groups shift $120bn of AI data centre debt off balance sheets. Tech companies have moved more than $120bn of data centre spending off their balance sheets using special purpose vehicles funded by Wall Street... Related tickers mentioned: CRWV, JPM, META, ORCL, XAAI.PVT."}]}
