{"symbol":"META","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:27:29.290Z","asOfDate":"2025-12-25","articles":[{"id":"0f99e8a9-bf6b-32fb-8dbe-98b7ac3d4e4c","title":"Billionaires Are Buying an AI Stock That Could Be the Apple of the 2030s","url":"https://finance.yahoo.com/m/0f99e8a9-bf6b-32fb-8dbe-98b7ac3d4e4c/billionaires-are-buying-an-ai.html","publisher":"Motley Fool","publishedAt":"2025-12-25T09:15:00.000Z","relatedTickers":["AAPL"],"mainIdea":"Billionaires Are Buying an AI Stock That Could Be the Apple of the 2030s","summary":"Motley Fool: Billionaires Are Buying an AI Stock That Could Be the Apple of the 2030s. Mark Zuckerberg believes smart glasses will be our primary computing devices in the future, and Meta currently dominates the market. Related tickers mentioned: AAPL."},{"id":"990f222a-8582-31db-a1c7-f11a7029eba0","title":"Nebius Group (NBIS) Is Up 20.8% After Blackwell AI Cloud Deal Wins With Microsoft And Meta – Has The Bull Case Changed?","url":"https://finance.yahoo.com/news/nebius-group-nbis-20-8-051047431.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T05:10:47.000Z","relatedTickers":["MSFT","NBIS","NVDA"],"mainIdea":"Nebius Group (NBIS) Is Up 20.8% After Blackwell AI Cloud Deal Wins With Microsoft And Meta – Has The Bull Case Changed?","summary":"Simply Wall St.: Nebius Group (NBIS) Is Up 20.8% After Blackwell AI Cloud Deal Wins With Microsoft And Meta – Has The Bull Case Changed?. Earlier this month, Nebius Group launched Nebius AI Cloud 3.1, rolling out NVIDIA Blackwell Ultra-based infrastructure, real-time capacity tools, and stricter security and governance features for its full-stack AI cloud platform. These upgrades, combined with very large multi-year AI infrastructure agreements with Microsoft and Meta, deepen Nebius’s role as an AI infrastructure provider while heightening execution and funding demands. With Nebius now deploying Blackwell Ultra systems in... Related tickers mentioned: MSFT, NBIS, NVDA."},{"id":"259f6d49-5500-32a2-bdf2-ec6de238cb7b","title":"Elon Musk Backs Demis Hassabis In Dispute With Meta's Yann LeCun Over 'General Intelligence,' Says Google DeepMind CEO Is 'Right'","url":"https://finance.yahoo.com/news/elon-musk-backs-demis-hassabis-213112960.html","publisher":"Benzinga","publishedAt":"2025-12-24T21:31:12.000Z","relatedTickers":["GOOG","TSLA"],"mainIdea":"Elon Musk Backs Demis Hassabis In Dispute With Meta's Yann LeCun Over 'General Intelligence,' Says Google DeepMind CEO Is 'Right'","summary":"Benzinga: Elon Musk Backs Demis Hassabis In Dispute With Meta's Yann LeCun Over 'General Intelligence,' Says Google DeepMind CEO Is 'Right'. On Monday, Tesla Inc. (NASDAQ:TSLA) CEO Elon Musk weighed in on an AI debate, siding with Alphabet Inc.'s (NASDAQ:GOOG) (NASDAQ:GOOGL) Google DeepMind CEO Demis Hassabis after Meta Platforms, Inc.'s (NASDAQ:META) outgoing AI chief Yann LeCun dismissed the idea of \"general intelligence\" as an illusion. Musk Weighs In On AGI Debate Musk amplified Hassabis' rebuttal to LeCun in a post on X, writing simply, \"Demis is right,\" throwing his support behind the DeepMind chief in a widening public dispute Related tickers mentioned: GOOG, TSLA."}]}
