{"symbol":"ISRG","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:18:33.576Z","asOfDate":"2025-12-24","articles":[{"id":"c9ddbb9d-1d58-3eb6-bce5-f5630f975e57","title":"Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals","url":"https://finance.yahoo.com/m/c9ddbb9d-1d58-3eb6-bce5-f5630f975e57/dow-jones-futures%3A-s%26p-500.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-24T03:35:07.000Z","relatedTickers":["AMZN","GOOG","GOOGL","KLAC","NVDA","TSM","^DJI","^GSPC","^IXIC"],"mainIdea":"Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals","summary":"Investor's Business Daily: Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals. Market breadth was narrow Tuesday, but the S&P 500 set a record close as Nvidia and Google made bullish moves. Related tickers mentioned: AMZN, GOOG, GOOGL, KLAC, NVDA, TSM, ^DJI, ^GSPC, ^IXIC."},{"id":"4f1690ba-669b-38a8-ad55-9fd36e53a816","title":"How FDA Clearance Expanding da Vinci SP into General Surgery Will Impact Intuitive Surgical (ISRG) Investors","url":"https://finance.yahoo.com/news/fda-clearance-expanding-da-vinci-170821919.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T17:08:21.000Z","relatedTickers":[],"mainIdea":"How FDA Clearance Expanding da Vinci SP into General Surgery Will Impact Intuitive Surgical (ISRG) Investors","summary":"Simply Wall St.: How FDA Clearance Expanding da Vinci SP into General Surgery Will Impact Intuitive Surgical (ISRG) Investors. Earlier this month, Intuitive Surgical announced that the U.S. Food and Drug Administration cleared its da Vinci Single Port surgical system for inguinal hernia repair, cholecystectomy, and appendectomy, broadening its existing U.S. indications beyond urology, colorectal, thoracic, and transoral procedures. This clearance meaningfully extends the da Vinci SP platform into higher-volume general surgery, potentially deepening its role in minimally invasive care across more hospitals and..."},{"id":"e35e9ba5-f0ed-3c0c-86e6-e87e0a9ff52a","title":"BWAY Shares Gain on Optum Expanding Deep TMS Coverage for Teens","url":"https://finance.yahoo.com/news/bway-shares-gain-optum-expanding-170700463.html","publisher":"Zacks","publishedAt":"2025-12-23T17:07:00.000Z","relatedTickers":["BSX","BWAY","^GSPC"],"mainIdea":"BWAY Shares Gain on Optum Expanding Deep TMS Coverage for Teens","summary":"Zacks: BWAY Shares Gain on Optum Expanding Deep TMS Coverage for Teens. BrainsWay stock rises after Optum expands Deep TMS coverage for adolescents, boosting reimbursement visibility. Related tickers mentioned: BSX, BWAY, ^GSPC."}]}
