{"symbol":"BMY","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:32.666Z","asOfDate":"2025-12-24","articles":[{"id":"b69aacb0-2423-3dfd-b821-5ca64a1c4d47","title":"Is Bristol Myers Squibb (BMY) Still Undervalued After Its Recent Share Price Rebound?","url":"https://finance.yahoo.com/news/bristol-myers-squibb-bmy-still-031341603.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T03:13:41.000Z","relatedTickers":[],"mainIdea":"Is Bristol Myers Squibb (BMY) Still Undervalued After Its Recent Share Price Rebound?","summary":"Simply Wall St.: Is Bristol Myers Squibb (BMY) Still Undervalued After Its Recent Share Price Rebound?. Bristol-Myers Squibb (BMY) has quietly staged a comeback, with the stock up about 17% over the past month and roughly 23% in the past 3 months, catching the attention of value focused investors. See our latest analysis for Bristol-Myers Squibb. That rebound sits against a more muted backdrop, with the share price still showing a slightly negative year to date return and a modest 1 year total shareholder return. This suggests sentiment has only recently started to improve as investors reassess..."},{"id":"c969e3ec-7e0c-3c35-9edd-c270b87ff7e9","title":"Bristol-Myers (BMY) Offers Eliquis Free to Medicaid Patients Under New Pricing Pact","url":"https://finance.yahoo.com/news/bristol-myers-bmy-offers-eliquis-222335062.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:23:35.000Z","relatedTickers":[],"mainIdea":"Bristol-Myers (BMY) Offers Eliquis Free to Medicaid Patients Under New Pricing Pact","summary":"Insider Monkey: Bristol-Myers (BMY) Offers Eliquis Free to Medicaid Patients Under New Pricing Pact. Bristol-Myers Squibb Company (NYSE:BMY) is included among the Best Stocks for a Dividend Achievers List. Several of the largest US and European drugmakers struck agreements with President Donald Trump on December 19 to voluntarily lower the prices of certain medicines. The move comes as the administration pushes to tie US drug prices more closely to […]"},{"id":"c3618b22-c259-3b5d-8c97-07b84b79431b","title":"Will the Recent Pricing Deal With the Government Impact BMY's Sales?","url":"https://finance.yahoo.com/news/recent-pricing-deal-government-impact-190900119.html","publisher":"Zacks","publishedAt":"2025-12-23T19:09:00.000Z","relatedTickers":["JNJ","MRK","PFE"],"mainIdea":"Will the Recent Pricing Deal With the Government Impact BMY's Sales?","summary":"Zacks: Will the Recent Pricing Deal With the Government Impact BMY's Sales?. BMY has agreed to supply Eliquis free of charge to Medicaid starting in 2026 and will also donate seven tons of the active pharmaceutical ingredient used in Eliquis. Related tickers mentioned: JNJ, MRK, PFE."}]}
