{"symbol":"BMY","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:19.064Z","asOfDate":"2025-12-27","articles":[{"id":"090d9a3a-cf36-321f-acb8-a19a9ed21249","title":"This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year","url":"https://finance.yahoo.com/m/090d9a3a-cf36-321f-acb8-a19a9ed21249/this-beaten-down-pharma-stock.html","publisher":"Barrons.com","publishedAt":"2025-12-27T07:30:00.000Z","relatedTickers":["PFE"],"mainIdea":"This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year","summary":"Barrons.com: This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year. Bristol Myers Squibb could become the pharmaceutical industry’s turnaround story for 2026. Shares are off 9% in 2025 after a series of drug pipeline disappointments, while major patent expirations, like one for cancer drug Revlimid, could cause earnings to fall 5% in 2026 and another 5% in 2027. At the current price, investors are paying little for Bristol Myers’ pipeline, led by Cobenfy, a schizophrenia drug being tested as a treatment for psychosis among Alzheimer’s patients, and Milvexian, a treatment of atrial fibrillation and strokes. Related tickers mentioned: PFE."},{"id":"727ca8e3-ac25-33d3-8de8-b180eb99424d","title":"Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever","url":"https://finance.yahoo.com/m/727ca8e3-ac25-33d3-8de8-b180eb99424d/got-%241%2C000%3F-2-high-yield.html","publisher":"Motley Fool","publishedAt":"2025-12-24T22:46:00.000Z","relatedTickers":["MDT","PFE"],"mainIdea":"Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever","summary":"Motley Fool: Got $1,000? 2 High-Yield Healthcare Stocks to Buy and Hold Forever. If you are looking for high yields, this drug maker and this device maker are both worth a deep dive today. Related tickers mentioned: MDT, PFE."},{"id":"1df89f70-ce2c-3f4a-a84e-55a0f846e0dc","title":"Office Introverts Want to Be Understood","url":"https://finance.yahoo.com/m/1df89f70-ce2c-3f4a-a84e-55a0f846e0dc/office-introverts-want-to-be.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-24T15:55:00.000Z","relatedTickers":[],"mainIdea":"Office Introverts Want to Be Understood","summary":"The Wall Street Journal: Office Introverts Want to Be Understood. Office introverts want the boss to understand their plight. As quieter employees push workplaces to be more flexible and provide more resources, companies are making more space for introverts, sometimes literally: Bristol-Myers Squibb created a room where introverts can recharge. Companies often cut jobs around the holidays, so you should plan just in case, writes Callum Borchers."}]}
