{"symbol":"ORCL","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:14.795Z","asOfDate":"2025-12-26","articles":[{"id":"e4baaa7e-202c-30a0-ab9f-70bae3539a52","title":"We asked 10 investors which single stock they'd gift this Christmas. One name kept coming up.","url":"https://finance.yahoo.com/m/e4baaa7e-202c-30a0-ab9f-70bae3539a52/we-asked-10-investors-which.html","publisher":"Business Insider","publishedAt":"2025-12-25T18:30:01.000Z","relatedTickers":[],"mainIdea":"We asked 10 investors which single stock they'd gift this Christmas. One name kept coming up.","summary":"Business Insider: We asked 10 investors which single stock they'd gift this Christmas. One name kept coming up.. In a twist on a traditional stock-picking exercise, we asked 10 market pros what's the top stock they'd gift this holiday season and why."},{"id":"59c8c41f-e1b0-34d1-a798-938ede3a1661","title":"Novo, Lilly race to cement lead in India’s obesity drug market, Reuters says","url":"https://finance.yahoo.com/news/novo-lilly-race-cement-lead-114028860.html","publisher":"TipRanks","publishedAt":"2025-12-25T11:40:28.000Z","relatedTickers":["LLY","NONOF","NVO"],"mainIdea":"Novo, Lilly race to cement lead in India’s obesity drug market, Reuters says","summary":"TipRanks: Novo, Lilly race to cement lead in India’s obesity drug market, Reuters says. Eli Lilly (LLY) and Novo Nordisk (NVO) are racing to cement their lead in India’s obesity drug market before cheaper generic version enter stores in March, Rishika Sadam of Reuters reports. Novo’s strategy focuses on price cuts and accelerated launches while Lilly’s products benefitted from entering the market early. Both companies have outreached to doctors, advertised heavily, provided incentives to patients, and entered distribution deals with local drugmakers, doctors, analysis, and others i Related tickers mentioned: LLY, NONOF, NVO."},{"id":"20b585d1-c5ed-3f4b-a60f-07f79df90ac7","title":"This Beaten-Down Tech Giant Is About to Roar Back","url":"https://finance.yahoo.com/m/20b585d1-c5ed-3f4b-a60f-07f79df90ac7/this-beaten-down-tech-giant.html","publisher":"Motley Fool","publishedAt":"2025-12-24T19:30:00.000Z","relatedTickers":[],"mainIdea":"This Beaten-Down Tech Giant Is About to Roar Back","summary":"Motley Fool: This Beaten-Down Tech Giant Is About to Roar Back. Focusing on companies with long-term revenue visibility and disciplined cost management can prove a winning strategy for retail investors."}]}
