{"symbol":"SNAP","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:27.071Z","asOfDate":"2025-12-26","articles":[{"id":"87ecb90f-70a2-3926-8db1-a6f771a29daa","title":"'No winner': Kosovo snap poll unlikely to end damaging deadlock","url":"https://finance.yahoo.com/m/87ecb90f-70a2-3926-8db1-a6f771a29daa/%27no-winner%27%3A-kosovo-snap-poll.html","publisher":"AFP","publishedAt":"2025-12-26T06:19:44.000Z","relatedTickers":[],"mainIdea":"'No winner': Kosovo snap poll unlikely to end damaging deadlock","summary":"AFP: 'No winner': Kosovo snap poll unlikely to end damaging deadlock. Before the first vote is even cast in Kosovo's snap election on Sunday, experts predict it is unlikely to end the political crisis that has been gripping Europe's youngest country for almost a year. Two national polls and a local election have cost one of Europe's poorest nations at least 30 million euros ($35 million) this year."},{"id":"bd51bb6f-37e8-3e8a-9fbc-49a27ffb65c7","title":"Culture being strangled by Kosovo's political crisis","url":"https://finance.yahoo.com/m/bd51bb6f-37e8-3e8a-9fbc-49a27ffb65c7/culture-being-strangled-by.html","publisher":"AFP","publishedAt":"2025-12-26T06:16:55.000Z","relatedTickers":[],"mainIdea":"Culture being strangled by Kosovo's political crisis","summary":"AFP: Culture being strangled by Kosovo's political crisis. Kosovo's oldest cinema has been dark and silent for years as the famous theatre slowly disintegrates under a leaky roof.\"The city deserves to have the cinema renovated and preserved."},{"id":"f877b845-e55b-33db-97f6-ad8a82bca0de","title":"Main contenders in Kosovo's snap election","url":"https://finance.yahoo.com/m/f877b845-e55b-33db-97f6-ad8a82bca0de/main-contenders-in-kosovo%27s.html","publisher":"AFP","publishedAt":"2025-12-26T06:14:16.000Z","relatedTickers":[],"mainIdea":"Main contenders in Kosovo's snap election","summary":"AFP: Main contenders in Kosovo's snap election. Kosovo is heading for early elections Sunday after months of political deadlock and failure to form a government -- the only solution its deeply divided parties could agree on to break the stalemate.However, in February's election, his party fell short of the numbers needed to govern alone and failed to secure a coalition partner, triggering months of deadlock that ultimately led to Sunday's snap vote."}]}
