{"symbol":"SNAP","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:30.507Z","asOfDate":"2025-12-23","articles":[{"id":"fd0e2525-a11c-32c4-93eb-ccff214b9607","title":"Snap (SNAP) Stock Dips While Market Gains: Key Facts","url":"https://finance.yahoo.com/news/snap-snap-stock-dips-while-230003152.html","publisher":"Zacks","publishedAt":"2025-12-23T23:00:03.000Z","relatedTickers":["^DJI","^GSPC"],"mainIdea":"Snap (SNAP) Stock Dips While Market Gains: Key Facts","summary":"Zacks: Snap (SNAP) Stock Dips While Market Gains: Key Facts. Snap (SNAP) reached $7.81 at the closing of the latest trading day, reflecting a -1.64% change compared to its last close. Related tickers mentioned: ^DJI, ^GSPC."},{"id":"771a9433-f39f-338a-8afe-8120ae397289","title":"Distribution Solutions Group (DSGR): Reassessing Valuation After Recent Share Price Rebound","url":"https://finance.yahoo.com/news/distribution-solutions-group-dsgr-reassessing-220936612.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T22:09:36.000Z","relatedTickers":["DSGR"],"mainIdea":"Distribution Solutions Group (DSGR): Reassessing Valuation After Recent Share Price Rebound","summary":"Simply Wall St.: Distribution Solutions Group (DSGR): Reassessing Valuation After Recent Share Price Rebound. Distribution Solutions Group (DSGR) has been quietly grinding through a mixed stretch, with the stock down over the past year but showing a small rebound in the past month, which invites a closer look. See our latest analysis for Distribution Solutions Group. With the share price now at $28.20, DSGR’s recent 1 month share price return of 4.41 percent contrasts with a weaker year to date share price performance and a much stronger 3 year total shareholder return of 57.23 percent, which hints... Related tickers mentioned: DSGR."},{"id":"96e0197c-7570-3f1f-bfb1-108d4f423577","title":"Billionaire Mark Cuban Says 'Name And Shame' Big Employers Who Pay So Little Their Workers Get Medicaid—'Taxpayers Are Subsidizing' Their Profits","url":"https://finance.yahoo.com/news/billionaire-mark-cuban-says-name-213043648.html","publisher":"Benzinga","publishedAt":"2025-12-23T21:30:43.000Z","relatedTickers":["AMZN","CVS","DG","DLTR","GM","HD","LOW","MCD","UBER","WBA","WEN","WMT","XAAI.PVT"],"mainIdea":"Billionaire Mark Cuban Says 'Name And Shame' Big Employers Who Pay So Little Their Workers Get Medicaid—'Taxpayers Are Subsidizing' Their Profits","summary":"Benzinga: Billionaire Mark Cuban Says 'Name And Shame' Big Employers Who Pay So Little Their Workers Get Medicaid—'Taxpayers Are Subsidizing' Their Profits. In June, self-made billionaire Mark Cuban lit up X with a series of posts that didn't call for sweeping legislation, but something simpler: accountability. \"When a large employer pays so little that their full-time employees qualify for Medicaid, or any public assistance, we the taxpayers are effectively subsidizing that big company. That's wrong,\" he wrote. Cuban wasn't pitching policy reform—he was drawing a line between capitalism and corporate freeloading. \"The best way to reduce the cost of Related tickers mentioned: AMZN, CVS, DG, DLTR, GM, HD, LOW, MCD, UBER, WBA, WEN, WMT, XAAI.PVT."},{"id":"56d5571b-b57b-3927-865a-d631d7ec725e","title":"Oil Edges Lower Amid Thin Trading, US Pressure on Venezuelan Oil","url":"https://finance.yahoo.com/news/oil-holds-four-day-gain-062902749.html","publisher":"Bloomberg","publishedAt":"2025-12-23T15:41:56.000Z","relatedTickers":["CL=F"],"mainIdea":"Oil Edges Lower Amid Thin Trading, US Pressure on Venezuelan Oil","summary":"Bloomberg: Oil Edges Lower Amid Thin Trading, US Pressure on Venezuelan Oil. Most Read from Bloomberg New York's Congestion Pricing Is Working. Five Charts Show How With Mamdani, the Humble Bus Gets Its Due As Zipcar Leaves London, Car-Share Boosters Are Looking for a New Ride ICE Plans Detention Expansion With Deal to Design 'Mega Centers' When It Comes to US Transportation, 2025 Had Some Wins, Too Volumes are trending lower ahead of the December holidays, with many traders away, contributing to exaggerated price swings. Trump has said the US will keep the oil from the seized tanker. Related tickers mentioned: CL=F."},{"id":"3d6e0857-44ab-346d-986c-41df24ab2a98","title":"BC-Most Active Stocks","url":"https://finance.yahoo.com/news/bc-most-active-stocks-153019642.html","publisher":"Associated Press Finance","publishedAt":"2025-12-23T15:30:19.000Z","relatedTickers":["AIRE","BYND","DVLT","HIHO","IVP","NVDA","ONDS","PLUG","SIDU","TIVC","VIVK","VMAR","WOK","^IXIC"],"mainIdea":"BC-Most Active Stocks","summary":"Associated Press Finance: BC-Most Active Stocks. Haoxin Holdings Ltd. 4,433,880 0.82 Related tickers mentioned: AIRE, BYND, DVLT, HIHO, IVP, NVDA, ONDS, PLUG, SIDU, TIVC, VIVK, VMAR, WOK, ^IXIC."},{"id":"4088039a-0fe1-3aa2-9352-75d45fc79c20","title":"Gensmo, Fabrique Drop AI Styling Tool for Curating Complete Outfits","url":"https://finance.yahoo.com/m/4088039a-0fe1-3aa2-9352-75d45fc79c20/gensmo%2C-fabrique-drop-ai.html","publisher":"Sourcing Journal","publishedAt":"2025-12-23T15:29:40.000Z","relatedTickers":[],"mainIdea":"Gensmo, Fabrique Drop AI Styling Tool for Curating Complete Outfits","summary":"Sourcing Journal: Gensmo, Fabrique Drop AI Styling Tool for Curating Complete Outfits. Gensmo and Fabrique teamed on an AI-powered styling experience aimed at giving shoppers clearer visual context across the collective’s assortment."},{"id":"ce4c85b2-b242-35b3-86f7-587788c7b5b8","title":"META stock: Analyst frames bull vs. bear debate into the New Year","url":"https://finance.yahoo.com/news/meta-stock-analyst-frames-bull-152611999.html","publisher":"Investing.com","publishedAt":"2025-12-23T15:26:11.000Z","relatedTickers":["META"],"mainIdea":"META stock: Analyst frames bull vs. bear debate into the New Year","summary":"Investing.com: META stock: Analyst frames bull vs. bear debate into the New Year. Investing.com -- Meta Platforms presents both risks and opportunities heading into 2026, according to Baird, which frames the stock as a “battleground” following recent underperformance. Related tickers mentioned: META."},{"id":"6c675bc5-74fb-3eba-b829-d4101de492e1","title":"Could Meta Platforms Stock Help You Become a Millionaire?","url":"https://finance.yahoo.com/m/6c675bc5-74fb-3eba-b829-d4101de492e1/could-meta-platforms-stock.html","publisher":"Motley Fool","publishedAt":"2025-12-23T04:20:00.000Z","relatedTickers":["META"],"mainIdea":"Could Meta Platforms Stock Help You Become a Millionaire?","summary":"Motley Fool: Could Meta Platforms Stock Help You Become a Millionaire?. The dominant tech titan continuously puts up impressive growth and profits. Related tickers mentioned: META."},{"id":"9d94bc90-8fca-309c-8241-c17892d379a7","title":"Why Firefly Aerospace Stock Skyrocketed on Monday","url":"https://finance.yahoo.com/m/9d94bc90-8fca-309c-8241-c17892d379a7/why-firefly-aerospace-stock.html","publisher":"Motley Fool","publishedAt":"2025-12-23T00:59:00.000Z","relatedTickers":["FLY"],"mainIdea":"Why Firefly Aerospace Stock Skyrocketed on Monday","summary":"Motley Fool: Why Firefly Aerospace Stock Skyrocketed on Monday. At a stroke, the company's shares now have significantly more visibility. Related tickers mentioned: FLY."},{"id":"7d30e0d3-d88e-34b2-b91e-ca12bfc9b99e","title":"John Harbaugh breaks down Derrick Henry's lack low snap share in the fourth quarter in loss vs. Patriots in Week 16","url":"https://finance.yahoo.com/m/7d30e0d3-d88e-34b2-b91e-ca12bfc9b99e/john-harbaugh-breaks-down.html","publisher":"NFL Highlights","publishedAt":"2025-12-22T23:20:38.000Z","relatedTickers":[],"mainIdea":"John Harbaugh breaks down Derrick Henry's lack low snap share in the fourth quarter in loss vs. Patriots in Week 16","summary":"NFL Highlights: John Harbaugh breaks down Derrick Henry's lack low snap share in the fourth quarter in loss vs. Patriots in Week 16. Baltimore Ravens head coach John Harbaugh discusses running back Derrick Henry's low snap count in the fourth quarter in loss against the New England Patriots after scoring two touchdowns."}]}
