{"symbol":"DE","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:14.700Z","asOfDate":"2025-12-27","articles":[{"id":"47de9753-0cd5-3952-bf04-e0e1ba71cb5c","title":"Why Is Deere (DE) Down 0.5% Since Last Earnings Report?","url":"https://finance.yahoo.com/news/why-deere-down-0-5-163002759.html","publisher":"Zacks","publishedAt":"2025-12-26T16:30:02.000Z","relatedTickers":["^GSPC"],"mainIdea":"Why Is Deere (DE) Down 0.5% Since Last Earnings Report?","summary":"Zacks: Why Is Deere (DE) Down 0.5% Since Last Earnings Report?. Deere (DE) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues. Related tickers mentioned: ^GSPC."},{"id":"def31d8d-d1de-3d62-812c-985fd1c0f7ea","title":"Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?","url":"https://finance.yahoo.com/news/deere-precision-agriculture-push-justifying-021205376.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T02:12:05.000Z","relatedTickers":[],"mainIdea":"Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?","summary":"Simply Wall St.: Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?. If you are wondering whether Deere is still a buy after its long run, you are not alone. This breakdown will help you decide if the current price makes sense or if patience might pay off. Despite a solid long term track record, with shares up 86.8% over five years and 13.2% over three, the stock has cooled recently, slipping 2.8% over the last week and 4.1% over the past month, while still sitting 11.8% higher year to date and 9.5% over the last year. Recent headlines have focused on Deere's..."},{"id":"c2dc0775-4bfc-3927-898f-0901f69a90a4","title":"Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout","url":"https://finance.yahoo.com/news/deere-scale-customer-focused-mixed-184000658.html","publisher":"Zacks","publishedAt":"2025-12-24T18:40:00.000Z","relatedTickers":["CR","FLS","WTS"],"mainIdea":"Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout","summary":"Zacks: Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout. DE plans to scale its mixed-fleet strategy with the Tenna acquisition, expanding customer-focused construction technology offerings. Related tickers mentioned: CR, FLS, WTS."}]}
