{"symbol":"DE","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:19.186Z","asOfDate":"2025-12-26","articles":[{"id":"def31d8d-d1de-3d62-812c-985fd1c0f7ea","title":"Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?","url":"https://finance.yahoo.com/news/deere-precision-agriculture-push-justifying-021205376.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T02:12:05.000Z","relatedTickers":[],"mainIdea":"Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?","summary":"Simply Wall St.: Is Deere’s Precision Agriculture Push Justifying the Current Share Price in 2025?. If you are wondering whether Deere is still a buy after its long run, you are not alone. This breakdown will help you decide if the current price makes sense or if patience might pay off. Despite a solid long term track record, with shares up 86.8% over five years and 13.2% over three, the stock has cooled recently, slipping 2.8% over the last week and 4.1% over the past month, while still sitting 11.8% higher year to date and 9.5% over the last year. Recent headlines have focused on Deere's..."},{"id":"c2dc0775-4bfc-3927-898f-0901f69a90a4","title":"Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout","url":"https://finance.yahoo.com/news/deere-scale-customer-focused-mixed-184000658.html","publisher":"Zacks","publishedAt":"2025-12-24T18:40:00.000Z","relatedTickers":["CR","FLS","WTS"],"mainIdea":"Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout","summary":"Zacks: Deere to Scale Customer-Focused Mixed-Fleet Business with Tenna Buyout. DE plans to scale its mixed-fleet strategy with the Tenna acquisition, expanding customer-focused construction technology offerings. Related tickers mentioned: CR, FLS, WTS."},{"id":"4ce9e3e8-58f2-3c7f-b2ed-90eb7c475b0c","title":"Forget FMC: Instead Buy This Unstoppable Farming Titan That's Up 11% in 2025 and Still Running","url":"https://finance.yahoo.com/m/4ce9e3e8-58f2-3c7f-b2ed-90eb7c475b0c/forget-fmc%3A-instead-buy-this.html","publisher":"Motley Fool","publishedAt":"2025-12-24T15:10:00.000Z","relatedTickers":["FMC","^GSPC"],"mainIdea":"Forget FMC: Instead Buy This Unstoppable Farming Titan That's Up 11% in 2025 and Still Running","summary":"Motley Fool: Forget FMC: Instead Buy This Unstoppable Farming Titan That's Up 11% in 2025 and Still Running. There's a better option available for investors bullish on the agricultural sector. Related tickers mentioned: FMC, ^GSPC."}]}
