{"symbol":"DE","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:28.356Z","asOfDate":"2025-12-24","articles":[{"id":"41c228ec-ae8f-38a0-b966-91ac28962aab","title":"The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider","url":"https://finance.yahoo.com/m/41c228ec-ae8f-38a0-b966-91ac28962aab/the-bill-gates-portfolio%3A-3.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-23T16:40:38.000Z","relatedTickers":["DHR","MCD","MSFT"],"mainIdea":"The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider","summary":"24/7 Wall St.: The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider. Microsoft (NASDAQ:MSFT) founder Bill gates is best-known for his founding of the most valuable company in the world (on multiple occasions, just not now). And rightfully so. That said, over the years, Bill Gates has adjusted his portfolio holdings, choosing to divest in a range of companies via his own personal portfolio but also via his ... The Bill Gates Portfolio: 3 Of His Ancor Holdings Every Investor Should Consider Related tickers mentioned: DHR, MCD, MSFT."},{"id":"5a11dbcf-d51e-3c80-a550-16c3251b01e5","title":"Deere (DE) Is Considered a Good Investment by Brokers: Is That True?","url":"https://finance.yahoo.com/news/deere-considered-good-investment-brokers-143004777.html","publisher":"Zacks","publishedAt":"2025-12-23T14:30:04.000Z","relatedTickers":[],"mainIdea":"Deere (DE) Is Considered a Good Investment by Brokers: Is That True?","summary":"Zacks: Deere (DE) Is Considered a Good Investment by Brokers: Is That True?. Based on the average brokerage recommendation (ABR), Deere (DE) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?"},{"id":"fb63e7be-85aa-3928-ab21-bcd648f6b800","title":"How Recent Shifts in Tech and Cycles Are Rewriting the Story for Deere","url":"https://finance.yahoo.com/news/recent-shifts-tech-cycles-rewriting-130832881.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T13:08:32.000Z","relatedTickers":[],"mainIdea":"How Recent Shifts in Tech and Cycles Are Rewriting the Story for Deere","summary":"Simply Wall St.: How Recent Shifts in Tech and Cycles Are Rewriting the Story for Deere. Deere's fair value estimate has nudged higher to about $526.91 per share, reflecting a slightly less negative revenue growth outlook and a marginally higher discount rate that together point to a more resilient long term narrative. This subtle upward shift is being driven by growing conviction in the earnings power tied to Precision Ag adoption and Deere's technology ecosystem, even as analysts remain mindful of cyclical and used equipment pressures. Stay tuned to see how investors can track..."}]}
