{"symbol":"ZM","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:17:12.412Z","asOfDate":"2025-12-24","articles":[{"id":"80d18d09-7871-32c0-9e6a-4d66301b1947","title":"Zoom Communications (ZM) is a Top-Ranked Growth Stock: Should You Buy?","url":"https://finance.yahoo.com/news/zoom-communications-zm-top-ranked-144505618.html","publisher":"Zacks","publishedAt":"2025-12-23T14:45:05.000Z","relatedTickers":[],"mainIdea":"Zoom Communications (ZM) is a Top-Ranked Growth Stock: Should You Buy?","summary":"Zacks: Zoom Communications (ZM) is a Top-Ranked Growth Stock: Should You Buy?. Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."},{"id":"0a3c6cf5-205c-373d-b61d-c9934c2c89ae","title":"3 Inflated  Stocks with Open Questions","url":"https://finance.yahoo.com/news/3-inflated-stocks-open-questions-043759473.html","publisher":"StockStory","publishedAt":"2025-12-23T04:37:59.000Z","relatedTickers":["EXPE","FCF"],"mainIdea":"3 Inflated Stocks with Open Questions","summary":"StockStory: 3 Inflated Stocks with Open Questions. Each stock in this article is trading near its 52-week high. These elevated prices usually indicate some degree of investor confidence, business improvements, or favorable market conditions. Related tickers mentioned: EXPE, FCF."},{"id":"cb709ce5-c053-3418-ba71-14ebb2a61373","title":"Does Zoom Still Offer Upside After AI Expansion and Recent Share Price Rebound?","url":"https://finance.yahoo.com/news/does-zoom-still-offer-upside-031154608.html","publisher":"Simply Wall St.","publishedAt":"2025-12-21T03:11:54.000Z","relatedTickers":[],"mainIdea":"Does Zoom Still Offer Upside After AI Expansion and Recent Share Price Rebound?","summary":"Simply Wall St.: Does Zoom Still Offer Upside After AI Expansion and Recent Share Price Rebound?. If you have ever wondered whether Zoom Communications is still a bargain or if the easy money is long gone, you are exactly who this breakdown is for. Despite a bruising 5 year journey with the share price down 76.1%, the stock has quietly climbed 0.3% over the last week, 14.2% over the past month, and 10.1% year to date, leaving it 4.9% higher than a year ago. Recent headlines have focused on Zoom pushing beyond its pandemic image, with the company investing heavily in AI driven..."}]}
