{"symbol":"DFS","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:57:46.784Z","asOfDate":"2025-12-22","articles":[{"id":"36b592f9-5292-30e5-ac2e-4e1e36b5b943","title":"LithiumBank Signs Development Agreement with Leading Energy Services and Technology Supplier That Includes Binding DLE Licensing Terms to Advance Boardwalk to Commercial Production with Project Execution Targeted for 2027","url":"https://finance.yahoo.com/news/lithiumbank-signs-development-agreement-leading-130000348.html","publisher":"Newsfile","publishedAt":"2025-12-22T13:00:00.000Z","relatedTickers":["LBNKF"],"mainIdea":"LithiumBank Signs Development Agreement with Leading Energy Services and Technology Supplier That Includes Binding DLE Licensing Terms to Advance Boardwalk to Commercial Production with Project Execution Targeted for 2027","summary":"Newsfile: LithiumBank Signs Development Agreement with Leading Energy Services and Technology Supplier That Includes Binding DLE Licensing Terms to Advance Boardwalk to Commercial Production with Project Execution Targeted for 2027. Vancouver, British Columbia--(Newsfile Corp. - December 22, 2025) - LithiumBank Resources Corp. (TSXV: LBNK) (OTCQX: LBNKF) (\"LithiumBank\" or the \"Company\") is pleased to announce it has entered into a Development Agreement (\"DA\") dated December 21st, 2025, with a Leading Energy Services and Technology Supplier (\"LESTS\") (together the \"Parties\") to provide technical services required to bring the Boardwalk lithium brine project (\"Boardwalk\"), located in northwest Alberta, Canada, to production.. Related tickers mentioned: LBNKF."},{"id":"47080dfb-5a23-3823-ae7f-3e4273c3a1fd","title":"Lithium Royalty Corp. Enters into Agreement to Acquire Cash Flowing Goulamina Royalty Operated by Ganfeng Lithium","url":"https://finance.yahoo.com/news/lithium-royalty-corp-enters-agreement-123000009.html","publisher":"Business Wire","publishedAt":"2025-12-22T12:30:00.000Z","relatedTickers":["LITRF","WX0.BE"],"mainIdea":"Lithium Royalty Corp. Enters into Agreement to Acquire Cash Flowing Goulamina Royalty Operated by Ganfeng Lithium","summary":"Business Wire: Lithium Royalty Corp. Enters into Agreement to Acquire Cash Flowing Goulamina Royalty Operated by Ganfeng Lithium. TORONTO, December 22, 2025--Lithium Royalty Corp. (TSX: LIRC) (\"LRC\" or the \"Company\") is pleased to announce that it has entered into a definitive agreement to acquire a 1.5% Trailing Product Sales Fee (TPSF) royalty on the Goulamina lithium project in Mali from Leo Lithium Limited. The Goulamina project is operated by Ganfeng Lithium Co. Ltd., one of the world Related tickers mentioned: LITRF, WX0.BE."},{"id":"9386df47-4d36-3c9e-8254-555d3a33ef1f","title":"Atlas Lithium Advances Neves Project with Final Stage of Project Management and Construction Supervision Contracting","url":"https://finance.yahoo.com/news/atlas-lithium-advances-neves-project-123000406.html","publisher":"Newsfile","publishedAt":"2025-12-22T12:30:00.000Z","relatedTickers":["ATLX"],"mainIdea":"Atlas Lithium Advances Neves Project with Final Stage of Project Management and Construction Supervision Contracting","summary":"Newsfile: Atlas Lithium Advances Neves Project with Final Stage of Project Management and Construction Supervision Contracting. Boca Raton, Florida--(Newsfile Corp. - December 22, 2025) - Atlas Lithium Corporation (NASDAQ: ATLX) (\"Atlas Lithium\" or \"Company\"), a lithium development company advancing toward production at its flagship Neves Project in Brazil Related tickers mentioned: ATLX."}]}
