{"symbol":"GEV","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:01.903Z","asOfDate":"2025-12-26","articles":[{"id":"27110918-91c4-3ebe-b724-8f452b8a9b4c","title":"GE Vernova (GEV) Is Up 8.7% After Dividend Hike, Buybacks And Grid Wins - What's Changed","url":"https://finance.yahoo.com/news/ge-vernova-gev-8-7-200350826.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T20:03:50.000Z","relatedTickers":[],"mainIdea":"GE Vernova (GEV) Is Up 8.7% After Dividend Hike, Buybacks And Grid Wins - What's Changed","summary":"Simply Wall St.: GE Vernova (GEV) Is Up 8.7% After Dividend Hike, Buybacks And Grid Wins - What's Changed. In recent weeks, GE Vernova raised its multi-year financial outlook, doubled its quarterly dividend, expanded its share repurchase authorization to US$10.00 billion, and secured multi‑gigawatt HVDC grid contracts in India and Germany that deepen its Electrification backlog. Together with plans to acquire full ownership of transformer maker Prolec GE, these moves suggest GE Vernova is positioning its portfolio tightly around accelerating global grid constraints, data center power needs, and..."},{"id":"c40c62e1-2a05-3341-b072-3b8d8254886f","title":"This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains","url":"https://finance.yahoo.com/m/c40c62e1-2a05-3341-b072-3b8d8254886f/this-tech-investor-likes.html","publisher":"Barrons.com","publishedAt":"2025-12-24T19:36:00.000Z","relatedTickers":["AVGO","BE","CRWV","NVDA"],"mainIdea":"This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains","summary":"Barrons.com: This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains. Paul Wick of Seligman Investments has piloted his winning fund through numerous technology cycles. How he is playing AI, and why he is skeptical of quantum computing stocks. Related tickers mentioned: AVGO, BE, CRWV, NVDA."},{"id":"ef940e8e-c66e-369e-8982-695d224c5828","title":"The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line","url":"https://finance.yahoo.com/news/zacks-analyst-blog-highlights-mastercard-143700418.html","publisher":"Zacks","publishedAt":"2025-12-24T14:37:00.000Z","relatedTickers":["GE","MA","MU","VALU"],"mainIdea":"The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line","summary":"Zacks: The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line. Zacks' Analyst Blog spotlights Mastercard, GE Aerospace, Micron and Value Line, highlighting strong performance drivers and key risks shaping outlooks. Related tickers mentioned: GE, MA, MU, VALU."}]}
