{"symbol":"AXP","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:45.767Z","asOfDate":"2025-12-27","articles":[{"id":"bac67ac6-ee5d-38ab-9511-be6f403dc3d0","title":"US Lukoil Gas Station Owners Left in Limbo Over Russia Sanctions","url":"https://finance.yahoo.com/news/us-lukoil-gas-station-owners-150000297.html","publisher":"Bloomberg","publishedAt":"2025-12-27T15:00:00.000Z","relatedTickers":["BCBP","CL=F","COP","LKOH.ME","PKBK","PSX"],"mainIdea":"US Lukoil Gas Station Owners Left in Limbo Over Russia Sanctions","summary":"Bloomberg: US Lukoil Gas Station Owners Left in Limbo Over Russia Sanctions. The Trump administration just weeks earlier had announced sanctions on two Russian oil giants, the latest measures designed to clamp down on Moscow’s crude sales and deprive the Kremlin of revenue it needs to wage its ongoing war in Ukraine. While the White House has temporarily exempted the gas stations from the sanctions, banks and credit-card companies have been spooked, in some cases forcing operators to accept cash only. Many are wondering how they’ll stay afloat under a tarnished corporate name, while uncertainty surrounds Lukoil’s efforts to meet an April deadline to offload the outlets. Related tickers mentioned: BCBP, CL=F, COP, LKOH.ME, PKBK, PSX."},{"id":"e01d6635-2b6d-3a55-94f8-95bea72ff9e6","title":"Has Amex’s 237% Five Year Rally Outrun Its Premium Card Expansion Story?","url":"https://finance.yahoo.com/news/amex-237-five-rally-outrun-010704350.html","publisher":"Simply Wall St.","publishedAt":"2025-12-26T01:07:04.000Z","relatedTickers":[],"mainIdea":"Has Amex’s 237% Five Year Rally Outrun Its Premium Card Expansion Story?","summary":"Simply Wall St.: Has Amex’s 237% Five Year Rally Outrun Its Premium Card Expansion Story?. If you are wondering whether American Express is still attractive after its huge run, or if you are late to the party, this breakdown will help you decide whether the current price makes long term sense. The stock has climbed 1.8% over the last week, 5.3% in the past month, and is now up 28.4% year to date, capping a powerful multiyear rally of 237.0% over five years. Recent headlines have focused on American Express expanding premium card perks and deepening co branded partnerships. This..."},{"id":"3094a19a-f393-3a48-8410-23e0e5a2dd9e","title":"2 Warren Buffett Stocks To Buy Hand Over Fist and 1 To Avoid","url":"https://finance.yahoo.com/m/3094a19a-f393-3a48-8410-23e0e5a2dd9e/2-warren-buffett-stocks-to.html","publisher":"Motley Fool","publishedAt":"2025-12-25T14:56:00.000Z","relatedTickers":["BRK.A","GOOG","UNH"],"mainIdea":"2 Warren Buffett Stocks To Buy Hand Over Fist and 1 To Avoid","summary":"Motley Fool: 2 Warren Buffett Stocks To Buy Hand Over Fist and 1 To Avoid. This may be your last chance to step into a name you know is 100% Buffett-approved. Just know that the Oracle of Omaha's approval alone still isn't a guarantee of success. Related tickers mentioned: BRK.A, GOOG, UNH."}]}
