{"symbol":"AXP","provider":"yahoo-finance","fetchedAt":"2025-12-24T09:18:05.851Z","asOfDate":"2025-12-24","articles":[{"id":"39533f43-13d6-3344-8e87-73e25c1e4706","title":"What to Expect From American Express' Q4 2025 Earnings Report","url":"https://finance.yahoo.com/m/39533f43-13d6-3344-8e87-73e25c1e4706/what-to-expect-from-american.html","publisher":"Barchart","publishedAt":"2025-12-23T13:46:08.000Z","relatedTickers":[],"mainIdea":"What to Expect From American Express' Q4 2025 Earnings Report","summary":"Barchart: What to Expect From American Express' Q4 2025 Earnings Report. American Express is set to deliver its fourth-quarter results next month, and analysts project double-digit earnings growth."},{"id":"295283da-d1a1-3867-b8a2-544ea1284294","title":"1 S&P 500 Stock with Exciting Potential and 2 Facing Headwinds","url":"https://finance.yahoo.com/news/1-p-500-stock-exciting-043256526.html","publisher":"StockStory","publishedAt":"2025-12-23T04:32:56.000Z","relatedTickers":["AOS","PRU","^GSPC"],"mainIdea":"1 S&P 500 Stock with Exciting Potential and 2 Facing Headwinds","summary":"StockStory: 1 S&P 500 Stock with Exciting Potential and 2 Facing Headwinds. While the S&P 500 (^GSPC) includes industry leaders, not every stock in the index is a winner. Some companies are past their prime, weighed down by poor execution, weak financials, or structural headwinds. Related tickers mentioned: AOS, PRU, ^GSPC."},{"id":"538ddd83-08c7-3746-856f-11ad20c288ec","title":"Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?","url":"https://finance.yahoo.com/news/american-express-axp-overpriced-recent-042336904.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T04:23:36.000Z","relatedTickers":[],"mainIdea":"Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?","summary":"Simply Wall St.: Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?. American Express (AXP) has quietly outperformed the broader market over the past year, and that kind of steady climb tends to get investors asking whether the stock still offers attractive upside from here. See our latest analysis for American Express. With the share price now around $380.85 and a strong 30 day share price return alongside an impressive five year total shareholder return, American Express still looks like it has meaningful momentum behind it rather than fatigue. If that kind..."}]}
