{"symbol":"AXP","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:22:23.107Z","asOfDate":"2025-12-23","articles":[{"id":"538ddd83-08c7-3746-856f-11ad20c288ec","title":"Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?","url":"https://finance.yahoo.com/news/american-express-axp-overpriced-recent-042336904.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T04:23:36.000Z","relatedTickers":[],"mainIdea":"Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?","summary":"Simply Wall St.: Is American Express (AXP) Overpriced After Its Recent Steady Share Price Climb?. American Express (AXP) has quietly outperformed the broader market over the past year, and that kind of steady climb tends to get investors asking whether the stock still offers attractive upside from here. See our latest analysis for American Express. With the share price now around $380.85 and a strong 30 day share price return alongside an impressive five year total shareholder return, American Express still looks like it has meaningful momentum behind it rather than fatigue. If that kind..."},{"id":"e346419f-e444-3349-af5f-b5e97ab1a17b","title":"How Investors Are Reacting To American Express (AXP) Holiday Spending Strength And Reaffirmed Dividend Commitment","url":"https://finance.yahoo.com/news/investors-reacting-american-express-axp-030952417.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T03:09:52.000Z","relatedTickers":[],"mainIdea":"How Investors Are Reacting To American Express (AXP) Holiday Spending Strength And Reaffirmed Dividend Commitment","summary":"Simply Wall St.: How Investors Are Reacting To American Express (AXP) Holiday Spending Strength And Reaffirmed Dividend Commitment. American Express’ board recently declared a regular quarterly dividend of US$0.82 per share, payable on February 10, 2026, to shareholders of record as of January 2, 2026, reinforcing its pattern of returning cash to investors. Management’s update on very strong Thanksgiving-through-Cyber-Monday spending growth, especially among affluent Platinum card users, highlights how American Express’ premium customer base may be supporting both revenue resilience and its ongoing dividend..."},{"id":"ed8e4562-c627-3c33-91bb-beffdc7cbcb2","title":"This Michael Burry Stock Spiked on a $1B Activist Stake. How Our Top Analyst Found the Trade Early.","url":"https://finance.yahoo.com/m/ed8e4562-c627-3c33-91bb-beffdc7cbcb2/this-michael-burry-stock.html","publisher":"Barchart","publishedAt":"2025-12-22T23:15:02.000Z","relatedTickers":["LULU"],"mainIdea":"This Michael Burry Stock Spiked on a $1B Activist Stake. How Our Top Analyst Found the Trade Early.","summary":"Barchart: This Michael Burry Stock Spiked on a $1B Activist Stake. How Our Top Analyst Found the Trade Early.. When Lululemon stock spiked on Elliott’s activist stake, John Rowland was already in position for a bull trade. Here’s how it took shape. Related tickers mentioned: LULU."}]}
