{"symbol":"LOW","provider":"yahoo-finance","fetchedAt":"2025-12-23T15:57:55.029Z","asOfDate":"2025-12-23","articles":[{"id":"6b3bdea0-e2bd-3669-a31d-0892e9dcfa88","title":"ServiceNow shares edge lower as Armis deal confirmed","url":"https://finance.yahoo.com/news/servicenow-shares-edge-lower-armis-145741401.html","publisher":"Investing.com","publishedAt":"2025-12-23T14:57:41.000Z","relatedTickers":["NOW"],"mainIdea":"ServiceNow shares edge lower as Armis deal confirmed","summary":"Investing.com: ServiceNow shares edge lower as Armis deal confirmed. Investing.com -- ServiceNow shares edged 0.4% lower premarket on Tuesday after the company confirmed it will acquire cybersecurity firm Armis for $7.75 billion in cash. Related tickers mentioned: NOW."},{"id":"b06d5c25-8fac-381c-8afe-d238d9258646","title":"Scott Purkis Highlights Stronger Investor Communication Standards to Help Public Companies Compete","url":"https://finance.yahoo.com/news/scott-purkis-highlights-stronger-investor-144500198.html","publisher":"ACCESS Newswire","publishedAt":"2025-12-23T14:45:00.000Z","relatedTickers":[],"mainIdea":"Scott Purkis Highlights Stronger Investor Communication Standards to Help Public Companies Compete","summary":"ACCESS Newswire: Scott Purkis Highlights Stronger Investor Communication Standards to Help Public Companies Compete. Financial media leader urges companies to adopt clearer, data-driven messaging as investor trust hits a 10-year low TORONTO, ON / ACCESS Newswire / December 23, 2025 / Financial media executive Scott Purkis, Founder & CEO of SimplyPRO Media, is calling ..."},{"id":"60e4c41c-3a49-3014-8fd9-c9b219bd8335","title":"Sector Update: Financial Stocks Lean Lower Pre-Bell Tuesday","url":"https://finance.yahoo.com/news/sector-financial-stocks-lean-lower-140616371.html","publisher":"MT Newswires","publishedAt":"2025-12-23T14:06:16.000Z","relatedTickers":["DEFT","FAS","FAZ","TPG","XLF"],"mainIdea":"Sector Update: Financial Stocks Lean Lower Pre-Bell Tuesday","summary":"MT Newswires: Sector Update: Financial Stocks Lean Lower Pre-Bell Tuesday. Financial stocks were leaning lower pre-bell Tuesday, with the State Street Financial Select Sector Related tickers mentioned: DEFT, FAS, FAZ, TPG, XLF."},{"id":"78d96d11-5a86-3a71-a02d-a86c95f4c6d9","title":"ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness","url":"https://finance.yahoo.com/news/zeekr-intelligent-technology-holding-nyse-081123347.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T08:11:23.000Z","relatedTickers":["ZK"],"mainIdea":"ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness","summary":"Simply Wall St.: ZEEKR Intelligent Technology Holding (NYSE:ZK): Revisiting Valuation After Recent Share Price Weakness. ZEEKR Intelligent Technology Holding (NYSE:ZK) has been drifting slightly lower over the past 3 months, even as revenue and net income have grown at a solid clip. That mismatch raises some interesting valuation questions. See our latest analysis for ZEEKR Intelligent Technology Holding. At the latest share price of $26.73, ZEEKR’s 90 day share price return of negative 7.06 percent and 1 year total shareholder return of negative 10.09 percent suggest momentum has cooled as investors reassess... Related tickers mentioned: ZK."},{"id":"e4c83672-4120-3987-ac2f-334c72f29741","title":"Discover 3 UK Penny Stocks With Market Caps Over £50M","url":"https://finance.yahoo.com/news/discover-3-uk-penny-stocks-070459726.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T07:04:59.000Z","relatedTickers":["ALLIF","FSG.L","IDGXF","IPXAF","MJWNY","NWINF","OOBHF","QTX.L","SYS1.L","TRTPF","WPNTF","^FTSE"],"mainIdea":"Discover 3 UK Penny Stocks With Market Caps Over £50M","summary":"Simply Wall St.: Discover 3 UK Penny Stocks With Market Caps Over £50M. The UK market has recently faced challenges, with the FTSE 100 index closing lower due to weak trade data from China, highlighting the interconnectedness of global economies. Amid these broader market fluctuations, investors often seek opportunities in areas that may offer growth potential despite economic headwinds. Penny stocks, though sometimes considered a relic of past eras, continue to attract attention for their affordability and potential for growth when backed by strong financials... Related tickers mentioned: ALLIF, FSG.L, IDGXF, IPXAF, MJWNY, NWINF, OOBHF, QTX.L, SYS1.L, TRTPF, WPNTF, ^FTSE."},{"id":"67a50199-8d5c-3e56-8e7e-8e86ff82f87c","title":"OSB GROUP PLC - Transaction in Own Shares","url":"https://finance.yahoo.com/news/osb-group-plc-transaction-own-070000405.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T07:00:00.000Z","relatedTickers":["CBOE","OSBGF"],"mainIdea":"OSB GROUP PLC - Transaction in Own Shares","summary":"GlobeNewswire: OSB GROUP PLC - Transaction in Own Shares. OSB GROUP PLC ISIN: GB00BLDRH36023 December 2025 LEI number: 213800ZBKL9BHSL2K459 OSB GROUP PLC (the “Company”) Transaction in Own Shares The Company announces that on 22 December 2025 it had purchased a total of 168,283 of its ordinary shares of £0.01 each (the \"ordinary shares\") on the London Stock Exchange, CBOE BXE and CBOE CXE, through the Company's broker Citigroup Global Markets Limited as detailed below. The repurchased ordinary shares will be cancelled. London Stock ExchangeCBOE BXECBOE Related tickers mentioned: CBOE, OSBGF."}]}
