{"symbol":"LOW","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:55.480Z","asOfDate":"2025-12-25","articles":[{"id":"21bfa90d-ad3a-3dd8-8a82-5a902325c968","title":"How New Data and Valuation Shifts Are Rewriting the Narrative for Inventiva","url":"https://finance.yahoo.com/news/data-valuation-shifts-rewriting-narrative-080658679.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T08:06:58.000Z","relatedTickers":["IVA","IVEVF"],"mainIdea":"How New Data and Valuation Shifts Are Rewriting the Narrative for Inventiva","summary":"Simply Wall St.: How New Data and Valuation Shifts Are Rewriting the Narrative for Inventiva. Inventiva's latest update brings a slightly lower fair value estimate, nudging the target from €8.20 to €7.85 as revenue growth assumptions ease from 118.22% to 117.94% amid a more measured outlook. At the same time, a small cut in the discount rate from 6.61% to 6.58% underscores growing confidence in lanifibranor's potential to outperform in MASH, anchoring a still bullish long term narrative despite the wait for pivotal NATiV3 data in 2H26. Read on to see how investors can track these... Related tickers mentioned: IVA, IVEVF."},{"id":"beba4b51-c01d-3502-99ef-e3b8ec8814b7","title":"NovoCure (NVCR): Assessing Valuation After a Recent Rebound From Multi‑Month Lows","url":"https://finance.yahoo.com/news/novocure-nvcr-assessing-valuation-recent-080551281.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T08:05:51.000Z","relatedTickers":["NVCR"],"mainIdea":"NovoCure (NVCR): Assessing Valuation After a Recent Rebound From Multi‑Month Lows","summary":"Simply Wall St.: NovoCure (NVCR): Assessing Valuation After a Recent Rebound From Multi‑Month Lows. NovoCure (NVCR) has quietly bounced off its lows, with the stock up about 9% over the past week and roughly 7% over the past month, even as longer term returns remain deeply negative. See our latest analysis for NovoCure. At around $13.44 per share, NovoCure’s recent 7 day and 30 day share price returns suggest a tentative shift in sentiment, even though the year to date share price return and longer term total shareholder returns remain deeply negative, so momentum is stabilising rather than... Related tickers mentioned: NVCR."},{"id":"33fad955-76a3-34aa-bec4-22c88f9a5a57","title":"What Analysts Think Gives Donaldson Company A Changing Story In The AI Infrastructure Era","url":"https://finance.yahoo.com/news/analysts-think-gives-donaldson-company-070808611.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T07:08:08.000Z","relatedTickers":["DCI"],"mainIdea":"What Analysts Think Gives Donaldson Company A Changing Story In The AI Infrastructure Era","summary":"Simply Wall St.: What Analysts Think Gives Donaldson Company A Changing Story In The AI Infrastructure Era. Donaldson Company shares are entering a new phase of their story, with fair value edging up from $89.80 to $91.60 per share as analysts build in slightly stronger long term revenue growth, now assumed at roughly 4.24% a year versus about 4.18% previously. A marginally lower discount rate of around 8.43%, down from 8.44%, signals that the market sees a touch less risk in this AI and data center driven earnings profile, even as expectations remain measured. Stay tuned to see how you can track... Related tickers mentioned: DCI."}]}
