{"symbol":"T","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:31.087Z","asOfDate":"2025-12-26","articles":[{"id":"21d675b5-93b3-3a9c-925a-99a86bd379bd","title":"This Dividend Giant Yielding 4.5% Is Wall Street’s Top Telecom Pick for 2026","url":"https://finance.yahoo.com/m/21d675b5-93b3-3a9c-925a-99a86bd379bd/this-dividend-giant-yielding.html","publisher":"Barchart","publishedAt":"2025-12-26T00:30:02.000Z","relatedTickers":["JPM"],"mainIdea":"This Dividend Giant Yielding 4.5% Is Wall Street’s Top Telecom Pick for 2026","summary":"Barchart: This Dividend Giant Yielding 4.5% Is Wall Street’s Top Telecom Pick for 2026. JPMorgan just released a list of its 47 top stock picks for 2026, but only one comes from the telecom industry, a stock that features an attractive yield and improving cash flow outlook. Related tickers mentioned: JPM."},{"id":"1cc2f975-ad6b-348c-b50b-60e579b6245a","title":"Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026","url":"https://finance.yahoo.com/m/1cc2f975-ad6b-348c-b50b-60e579b6245a/dogs-of-the-dow-beat-the.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-25T14:50:50.000Z","relatedTickers":["TMUS","VZ"],"mainIdea":"Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026","summary":"24/7 Wall St.: Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026. Keeping things simple when investing is often best, which is why buying an index fund can be the optimal strategy. Because the market has returned about 10% annually on average for the past 100 years, just buying an exchange-traded fund (ETF) could set an investor up for life. Yet you can do better than just ... Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026 Related tickers mentioned: TMUS, VZ."},{"id":"34fcc719-1845-37fc-a06a-1467eef2aae4","title":"AT&T (T): Reassessing Valuation After Recent Share Price Pullback and One-Year Total Return","url":"https://finance.yahoo.com/news/t-t-reassessing-valuation-recent-110732127.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T11:07:32.000Z","relatedTickers":["T-PA"],"mainIdea":"AT&T (T): Reassessing Valuation After Recent Share Price Pullback and One-Year Total Return","summary":"Simply Wall St.: AT&T (T): Reassessing Valuation After Recent Share Price Pullback and One-Year Total Return. AT&T (T) has quietly outperformed over the past year, even as its stock has slipped about 4% this month and 13% in the past 3 months, raising questions about what comes next. See our latest analysis for AT&T. Those recent pullbacks sit against a sturdier backdrop, with AT&T’s share price still up year to date and a 12.3% one year total shareholder return suggesting steady income plus modest capital gains rather than fading momentum. If AT&T’s mix of resilience and income has your attention,... Related tickers mentioned: T-PA."}]}
