{"symbol":"GS","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:26.787Z","asOfDate":"2025-12-23","articles":[{"id":"55d855c3-bd6f-320d-8fe1-68627a25821f","title":"Jim Cramer Says “I Own Apple, and I Say Own it, Don’t Trade It”","url":"https://finance.yahoo.com/news/jim-cramer-says-own-apple-051613926.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T05:16:13.000Z","relatedTickers":["AAPL","CRWD","HOOD","NVDA"],"mainIdea":"Jim Cramer Says “I Own Apple, and I Say Own it, Don’t Trade It”","summary":"Insider Monkey: Jim Cramer Says “I Own Apple, and I Say Own it, Don’t Trade It”. Apple Inc. (NASDAQ:AAPL) is one of the stocks Jim Cramer answered questions about. Playing the round of “Am I Diversified?”, a caller mentioned that their top five holdings are NVDA, CRWD, AAPL, GS, and HOOD. Cramer remarked: “Interesting… We’ll do some, set some time on this. Alright, CrowdStrike, we know… amazing cybersecurity company. NVIDIA… That’s […] Related tickers mentioned: AAPL, CRWD, HOOD, NVDA."},{"id":"d6e3f170-0934-3780-9e69-394bad8b5b66","title":"What a $79 Million Bet on a Nasdaq Income ETF Signals About This Investor's Strategy","url":"https://finance.yahoo.com/m/d6e3f170-0934-3780-9e69-394bad8b5b66/what-a-%2479-million-bet-on-a.html","publisher":"Motley Fool","publishedAt":"2025-12-22T22:10:59.000Z","relatedTickers":[],"mainIdea":"What a $79 Million Bet on a Nasdaq Income ETF Signals About This Investor's Strategy","summary":"Motley Fool: What a $79 Million Bet on a Nasdaq Income ETF Signals About This Investor's Strategy. A quiet portfolio allocation reveals how one manager is thinking about risk, income, and tech exposure at the same time."},{"id":"5d6eae51-ac48-319f-90e6-25d5b783e169","title":"Bond Markets Clear Path for Stock Rally by Ignoring a Near-Term Risk","url":"https://finance.yahoo.com/m/5d6eae51-ac48-319f-90e6-25d5b783e169/bond-markets-clear-path-for.html","publisher":"Barrons.com","publishedAt":"2025-12-22T21:51:00.000Z","relatedTickers":["JPM"],"mainIdea":"Bond Markets Clear Path for Stock Rally by Ignoring a Near-Term Risk","summary":"Barrons.com: Bond Markets Clear Path for Stock Rally by Ignoring a Near-Term Risk. Bond markets are doing their part to deliver a Santa Claus rally for stocks as investors up the ante on more Federal Reserve rate cuts in the new year and brush off inflation worries in the world’s biggest economy. A softer-than-expected inflation reading for the month of November, published last week, along with the expected new leadership at the Fed pushing for deeper rate cuts, have driven short-term Treasury bond yields sharply lower over the past two weeks. Further pressure has been building on shorter-term Treasury bill yields as the Fed begins its monthslong effort to ease liquidity concerns in the banking sector through a program of regular monthly purchases expected to last until late spring. Related tickers mentioned: JPM."}]}
