{"symbol":"BAC","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:56:06.840Z","asOfDate":"2025-12-23","articles":[{"id":"8150cf67-442f-34d1-b7de-1dfead7a2b32","title":"UPS Volume Outlook Improves Modestly in Bank of America Update","url":"https://finance.yahoo.com/news/ups-volume-outlook-improves-modestly-224230584.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:42:30.000Z","relatedTickers":["UPS"],"mainIdea":"UPS Volume Outlook Improves Modestly in Bank of America Update","summary":"Insider Monkey: UPS Volume Outlook Improves Modestly in Bank of America Update. United Parcel Service, Inc. (NYSE:UPS) is included among the Best Stocks for a Dividend Achievers List. On December 18, Bank of America analyst Ken Hoexter raised the firm’s price target on United Parcel Service, Inc. (NYSE:UPS) to $99 from $95. The firm kept an Underperform rating on the shares.UPS told investors that peak season unfolded largely […] Related tickers mentioned: UPS."},{"id":"c5feefc0-7db1-35e2-909d-958f4a002803","title":"Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint","url":"https://finance.yahoo.com/news/wells-fargo-eyes-options-clearing-164100964.html","publisher":"Zacks","publishedAt":"2025-12-23T16:41:00.000Z","relatedTickers":["GS","WFC"],"mainIdea":"Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint","summary":"Zacks: Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint. WFC plans to enter options clearing as client demand rises, enabled by the lifted asset cap, with market makers targeted for 2H26. Related tickers mentioned: GS, WFC."},{"id":"29d571ba-05dd-3f7c-bf20-fda480ce2463","title":"Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio","url":"https://finance.yahoo.com/news/why-1-finance-stock-could-143002009.html","publisher":"Zacks","publishedAt":"2025-12-23T14:30:02.000Z","relatedTickers":[],"mainIdea":"Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio","summary":"Zacks: Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio. The Zacks Focus List offers investors a way to easily find top-rated stocks and build a winning investment portfolio. Here's why you should take advantage."},{"id":"2ac7a15e-5c56-31e5-ac08-bcf7fd644a14","title":"Buffett’s $24 Billion Selling Spree: The 6 Stocks Berkshire Hathaway Dumped","url":"https://finance.yahoo.com/m/2ac7a15e-5c56-31e5-ac08-bcf7fd644a14/buffett%E2%80%99s-%2424-billion-selling.html","publisher":"24/7 Wall St.","publishedAt":"2025-12-23T14:02:07.000Z","relatedTickers":["AAPL","BRK-B","BRK.A","DHI","DVA","NUE","VRSN","^GSPC"],"mainIdea":"Buffett’s $24 Billion Selling Spree: The 6 Stocks Berkshire Hathaway Dumped","summary":"24/7 Wall St.: Buffett’s $24 Billion Selling Spree: The 6 Stocks Berkshire Hathaway Dumped. Investors began to notice that Warren Buffett began being more conservative with the stock market three years ago, and that streak has continued even as the S&P 500 hit new peaks and beyond. He sold Apple (NASDAQ:AAPL), Bank of America (NYSE:BAC), VeriSign (NASDAQ:VRSN), DaVita (NYSE:DVA), D.R. Horton (NYSE:DHI), and Nucor (NYSE:NUE) as of Q3 2025. ... Buffett’s $24 Billion Selling Spree: The 6 Stocks Berkshire Hathaway Dumped Related tickers mentioned: AAPL, BRK-B, BRK.A, DHI, DVA, NUE, VRSN, ^GSPC."},{"id":"93ecd3c7-73e2-3fb6-9f76-6e53e3dbcd9d","title":"Citigroup or Bank of America: Which Big Bank is the Better 2026 Bet?","url":"https://finance.yahoo.com/news/citigroup-bank-america-big-bank-124700493.html","publisher":"Zacks","publishedAt":"2025-12-23T12:47:00.000Z","relatedTickers":["C"],"mainIdea":"Citigroup or Bank of America: Which Big Bank is the Better 2026 Bet?","summary":"Zacks: Citigroup or Bank of America: Which Big Bank is the Better 2026 Bet?. Will Citigroup's global business revamp, rising earnings and valuation edge give it the upper hand over Bank of America in 2026? Let's find out. Related tickers mentioned: C."},{"id":"8240c8f3-13f3-33c3-96fd-95762fea99e8","title":"Sector Update: Financial Stocks Rise Late Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-rise-afternoon-205037147.html","publisher":"MT Newswires","publishedAt":"2025-12-22T20:50:37.000Z","relatedTickers":["BTC-USD","JPM","XLF","XLRE"],"mainIdea":"Sector Update: Financial Stocks Rise Late Afternoon","summary":"MT Newswires: Sector Update: Financial Stocks Rise Late Afternoon. Financial stocks were higher in late Monday afternoon trading, with the NYSE Financial Index and the Related tickers mentioned: BTC-USD, JPM, XLF, XLRE."},{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["C","GS","JPM","MS","MS-PQ","WFC","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve's current interest rate environment. Also catch Yahoo Finance Senior Banking Reporter David Hollerith and Hennion & Walsh CIO Kevin Mahn discuss the 2026 outlook for regional banks. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: C, GS, JPM, MS, MS-PQ, WFC, XLF."},{"id":"2d1c3715-4c7e-3151-b995-91574f7bcb4f","title":"BofA CEO Moynihan on Economic Outlook, AI and Fed Rate Cuts","url":"https://finance.yahoo.com/video/bofa-ceo-moynihan-economic-outlook-191621293.html","publisher":"Bloomberg","publishedAt":"2025-12-22T19:16:21.000Z","relatedTickers":[],"mainIdea":"BofA CEO Moynihan on Economic Outlook, AI and Fed Rate Cuts","summary":"Bloomberg: BofA CEO Moynihan on Economic Outlook, AI and Fed Rate Cuts. Bank of America Chair and CEO Brian Moynihan says the US consumer is in \"pretty good shape\" going into 2026. Speaking with David Westin on Bloomberg Television, Moynihan also says the Federal Reserve will have room to cut rates next year."}]}
