{"symbol":"BAC","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:27:27.522Z","asOfDate":"2025-12-25","articles":[{"id":"965ebe08-ab65-3f8c-a961-95568cc3770b","title":"Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook","url":"https://finance.yahoo.com/news/truist-raises-bofa-bac-profit-081251278.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:12:51.000Z","relatedTickers":["TFC"],"mainIdea":"Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook","summary":"Insider Monkey: Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook. Bank of America Corporation (NYSE:BAC) is one of the best high volume stocks to buy right now. On December 18, Truist raised the firm’s price target on Bank of America to $58 from $56 and maintained a Buy rating on the shares. This sentiment was posted as part of the firm’s broader research note that […] Related tickers mentioned: TFC."},{"id":"da0f6e37-fa93-3b73-976b-3757e37a20ee","title":"BofA Sees Advanced Packaging Potential for Intel Foundry (INTC) Despite Manufacturing Headwinds","url":"https://finance.yahoo.com/news/bofa-sees-advanced-packaging-potential-080929412.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:09:29.000Z","relatedTickers":["INTC"],"mainIdea":"BofA Sees Advanced Packaging Potential for Intel Foundry (INTC) Despite Manufacturing Headwinds","summary":"Insider Monkey: BofA Sees Advanced Packaging Potential for Intel Foundry (INTC) Despite Manufacturing Headwinds. Intel Corporation (NASDAQ:INTC) is one of the best high volume stocks to buy right now. On December 16, Bank of America raised the firm’s price target on Intel to $40 from $34, while keeping an Underperform rating on the shares. The firm highlighted a growing opportunity for Intel Foundry to secure external wins in advanced […] Related tickers mentioned: INTC."},{"id":"a165e8e4-c740-3801-bf2b-141bcb8015b5","title":"Life-space's Patented Strain LPB27 Featured in Nature Supplement, Highlighting World-Class R&D Strength","url":"https://finance.yahoo.com/news/life-spaces-patented-strain-lpb27-021400353.html","publisher":"PR Newswire","publishedAt":"2025-12-25T02:14:00.000Z","relatedTickers":[],"mainIdea":"Life-space's Patented Strain LPB27 Featured in Nature Supplement, Highlighting World-Class R&D Strength","summary":"PR Newswire: Life-space's Patented Strain LPB27 Featured in Nature Supplement, Highlighting World-Class R&D Strength. The Nature supplement highlights research exploring the potential of LPB27 and Bifidobacterium breve 207-1 in supporting digestive and metabolic health. Both strains have already been successfully integrated into multiple Life-space products and are highly favored by consumers globally."}]}
