{"symbol":"WFC","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:35.115Z","asOfDate":"2025-12-23","articles":[{"id":"24e6a9b7-a978-3165-bd88-b6e1ea69b5f0","title":"Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN","url":"https://finance.yahoo.com/news/wells-fargo-sees-prolonged-trough-223519801.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:35:19.000Z","relatedTickers":["EMN"],"mainIdea":"Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN","summary":"Insider Monkey: Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN. Eastman Chemical Company (NYSE:EMN) is included among the Best Stocks for a Dividend Achievers List. On December 19, Wells Fargo downgraded Eastman Chemical Company (NYSE:EMN) to Equal Weight from Overweight. The firm kept its price target unchanged at $70. The move was part of a broader reset across the chemicals sector. Wells Fargo downgraded four […] Related tickers mentioned: EMN."},{"id":"9ce69988-e244-34dd-b73b-79a2aa59c04d","title":"AppLovin Stock Today: Why This Bull Put Spread Earns $160","url":"https://finance.yahoo.com/m/9ce69988-e244-34dd-b73b-79a2aa59c04d/applovin-stock-today%3A-why.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-23T18:56:34.000Z","relatedTickers":["APP"],"mainIdea":"AppLovin Stock Today: Why This Bull Put Spread Earns $160","summary":"Investor's Business Daily: AppLovin Stock Today: Why This Bull Put Spread Earns $160. AppLovin stock is holding nicely above a rising 21-day exponential moving average and is currently in a buy zone. As a reminder, a bull put spread is a defined risk strategy, so you always know the worst-case scenario in advance. This type of trade will profit if AppLovin stock trades sideways or higher and even sometimes if it trades slightly lower, offering flexibility in uncertain markets. Related tickers mentioned: APP."},{"id":"c5feefc0-7db1-35e2-909d-958f4a002803","title":"Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint","url":"https://finance.yahoo.com/news/wells-fargo-eyes-options-clearing-164100964.html","publisher":"Zacks","publishedAt":"2025-12-23T16:41:00.000Z","relatedTickers":["BAC","GS"],"mainIdea":"Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint","summary":"Zacks: Wells Fargo Eyes Options Clearing to Strengthen Wall Street Footprint. WFC plans to enter options clearing as client demand rises, enabled by the lifted asset cap, with market makers targeted for 2H26. Related tickers mentioned: BAC, GS."},{"id":"47d9ee25-0db2-3a42-9189-92a00cf1c5fd","title":"Tracking the Evolving Cummins Narrative After Shifting Analyst Views","url":"https://finance.yahoo.com/news/tracking-evolving-cummins-narrative-shifting-120959475.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T12:09:59.000Z","relatedTickers":["CMI","TFC"],"mainIdea":"Tracking the Evolving Cummins Narrative After Shifting Analyst Views","summary":"Simply Wall St.: Tracking the Evolving Cummins Narrative After Shifting Analyst Views. Cummins stock has seen a modest uptick in its fair value estimate to about $532 per share as analysts grow more confident in the durability of earnings and the long term boost from data center power demand. A slightly lower discount rate and essentially unchanged revenue growth assumptions together signal a fine tuning of expectations rather than a wholesale rethink of the story. Stay tuned to see how you can track these subtle but important narrative shifts as they unfold over time. Analyst... Related tickers mentioned: CMI, TFC."},{"id":"eb7e7499-ba53-3f2f-a283-b4f9e1174512","title":"Bloom Energy Signs Deal With Wells Fargo for $600 Million Credit Facility","url":"https://finance.yahoo.com/news/bloom-energy-signs-deal-wells-114632840.html","publisher":"MT Newswires","publishedAt":"2025-12-23T11:46:32.000Z","relatedTickers":["BE"],"mainIdea":"Bloom Energy Signs Deal With Wells Fargo for $600 Million Credit Facility","summary":"MT Newswires: Bloom Energy Signs Deal With Wells Fargo for $600 Million Credit Facility. Bloom Energy (BE) said Tuesday it has signed an agreement with Wells Fargo (WFC) to secure a $600 mi Related tickers mentioned: BE."},{"id":"b3a75110-df3b-3eb3-a884-0c397e0bb377","title":"Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?","url":"https://finance.yahoo.com/news/invesco-large-cap-value-etf-112003155.html","publisher":"Zacks","publishedAt":"2025-12-23T11:20:03.000Z","relatedTickers":["PWV"],"mainIdea":"Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?","summary":"Zacks: Is Invesco Large Cap Value ETF (PWV) a Strong ETF Right Now?. Smart Beta ETF report for PWV Related tickers mentioned: PWV."},{"id":"22c9abaa-29fd-37b7-bd9f-959becd61552","title":"Analyst Report: Wells Fargo & Company","url":"https://finance.yahoo.com/m/22c9abaa-29fd-37b7-bd9f-959becd61552/analyst-report%3A-wells-fargo-%26.html","publisher":"Morningstar Research","publishedAt":"2025-12-23T01:32:35.000Z","relatedTickers":[],"mainIdea":"Analyst Report: Wells Fargo & Company","summary":"Morningstar Research: Analyst Report: Wells Fargo & Company. Wells Fargo is one of the largest banks in the United States, with approximately $2.0 trillion in balance-sheet assets. The company has four primary segments: consumer banking, commercial banking, corporate and investment banking, and wealth and investment management. It is almost entirely focused on the US market."},{"id":"8240c8f3-13f3-33c3-96fd-95762fea99e8","title":"Sector Update: Financial Stocks Rise Late Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-rise-afternoon-205037147.html","publisher":"MT Newswires","publishedAt":"2025-12-22T20:50:37.000Z","relatedTickers":["BTC-USD","JPM","XLF","XLRE"],"mainIdea":"Sector Update: Financial Stocks Rise Late Afternoon","summary":"MT Newswires: Sector Update: Financial Stocks Rise Late Afternoon. Financial stocks were higher in late Monday afternoon trading, with the NYSE Financial Index and the Related tickers mentioned: BTC-USD, JPM, XLF, XLRE."},{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","C","GS","JPM","MS","MS-PQ","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve's current interest rate environment. Also catch Yahoo Finance Senior Banking Reporter David Hollerith and Hennion & Walsh CIO Kevin Mahn discuss the 2026 outlook for regional banks. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, C, GS, JPM, MS, MS-PQ, XLF."}]}
