{"symbol":"WFC","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:21:46.274Z","asOfDate":"2025-12-24","articles":[{"id":"d380e985-c023-33c8-af93-eacb182846db","title":"Big US banks add $600bn in value as deregulation spurs gains","url":"https://finance.yahoo.com/news/big-us-banks-add-600bn-145815652.html","publisher":"Financial Times","publishedAt":"2025-12-24T14:58:15.000Z","relatedTickers":["BAC","GS","JPM"],"mainIdea":"Big US banks add $600bn in value as deregulation spurs gains","summary":"Financial Times: Big US banks add $600bn in value as deregulation spurs gains. America’s six largest banks added $600bn in market value in 2025, spurred on by the Trump administration’s push to deregulate the industry and... Related tickers mentioned: BAC, GS, JPM."},{"id":"2a92fcbd-196b-3487-8224-9ac7d91f318c","title":"Senator McConnell Buys The Same Stock Every Quarter: Here's Why","url":"https://finance.yahoo.com/news/senator-mcconnell-buys-same-stock-023109301.html","publisher":"Benzinga","publishedAt":"2025-12-24T02:31:09.000Z","relatedTickers":[],"mainIdea":"Senator McConnell Buys The Same Stock Every Quarter: Here's Why","summary":"Benzinga: Senator McConnell Buys The Same Stock Every Quarter: Here's Why. When it comes to tracking the trading activity of member of Congress, frequent purchases of the same stocks could be an area to watch. In the case of Sen. Mitch McConnell (R-Ky.) the frequent purchases of one stock might have a more boring reason why. McConnell Buys More Wells Fargo A recent disclosure from McConnell shows the purchase of $1,000 to $15,000 in Wells Fargo & Co (NYSE:WFC) shares on Dec. 1, according to the Benzinga Government Trades page. Don't Miss: This Jeff Bezos-backed startup"},{"id":"baaa1d7b-e08d-335c-8ed9-c1b4a995789f","title":"Arcellx (ACLX) Valuation Check After Wells Fargo Launches Coverage on Its Multiple Myeloma CAR‑T Program","url":"https://finance.yahoo.com/news/arcellx-aclx-valuation-check-wells-001435700.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T00:14:35.000Z","relatedTickers":["ACLX"],"mainIdea":"Arcellx (ACLX) Valuation Check After Wells Fargo Launches Coverage on Its Multiple Myeloma CAR‑T Program","summary":"Simply Wall St.: Arcellx (ACLX) Valuation Check After Wells Fargo Launches Coverage on Its Multiple Myeloma CAR‑T Program. Wells Fargo just kicked off coverage on Arcellx (ACLX), zeroing in on its experimental CAR T therapy for multiple myeloma as a potential future treatment backbone and putting the company more firmly on investors radar. See our latest analysis for Arcellx. That call from Wells Fargo lands after a choppy stretch, with a 1 month share price return of minus 27.36% and a year to date share price return of minus 16.81%. However, the 3 year total shareholder return is still up 121.17%, suggesting... Related tickers mentioned: ACLX."},{"id":"24e6a9b7-a978-3165-bd88-b6e1ea69b5f0","title":"Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN","url":"https://finance.yahoo.com/news/wells-fargo-sees-prolonged-trough-223519801.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:35:19.000Z","relatedTickers":["EMN"],"mainIdea":"Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN","summary":"Insider Monkey: Wells Fargo Sees Prolonged Trough Conditions for Chemicals, Downgrades EMN. Eastman Chemical Company (NYSE:EMN) is included among the Best Stocks for a Dividend Achievers List. On December 19, Wells Fargo downgraded Eastman Chemical Company (NYSE:EMN) to Equal Weight from Overweight. The firm kept its price target unchanged at $70. The move was part of a broader reset across the chemicals sector. Wells Fargo downgraded four […] Related tickers mentioned: EMN."}]}
