{"symbol":"WFC","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:52.803Z","asOfDate":"2025-12-23","articles":[{"id":"22c9abaa-29fd-37b7-bd9f-959becd61552","title":"Analyst Report: Wells Fargo & Company","url":"https://finance.yahoo.com/m/22c9abaa-29fd-37b7-bd9f-959becd61552/analyst-report%3A-wells-fargo-%26.html","publisher":"Morningstar Research","publishedAt":"2025-12-23T01:32:35.000Z","relatedTickers":[],"mainIdea":"Analyst Report: Wells Fargo & Company","summary":"Morningstar Research: Analyst Report: Wells Fargo & Company. Wells Fargo is one of the largest banks in the United States, with approximately $2.0 trillion in balance-sheet assets. The company has four primary segments: consumer banking, commercial banking, corporate and investment banking, and wealth and investment management. It is almost entirely focused on the US market."},{"id":"8240c8f3-13f3-33c3-96fd-95762fea99e8","title":"Sector Update: Financial Stocks Rise Late Afternoon","url":"https://finance.yahoo.com/news/sector-financial-stocks-rise-afternoon-205037147.html","publisher":"MT Newswires","publishedAt":"2025-12-22T20:50:37.000Z","relatedTickers":["BTC-USD","JPM","XLF","XLRE"],"mainIdea":"Sector Update: Financial Stocks Rise Late Afternoon","summary":"MT Newswires: Sector Update: Financial Stocks Rise Late Afternoon. Financial stocks were higher in late Monday afternoon trading, with the NYSE Financial Index and the Related tickers mentioned: BTC-USD, JPM, XLF, XLRE."},{"id":"e119294c-29a4-3a70-82cc-5a9f178dcdd3","title":"2026 outlook: Big Banks are getting back their 'earnings mojo'","url":"https://finance.yahoo.com/video/2026-outlook-big-banks-getting-201500029.html","publisher":"Yahoo Finance Video","publishedAt":"2025-12-22T20:15:00.000Z","relatedTickers":["BAC","C","GS","JPM","MS","MS-PQ","XLF"],"mainIdea":"2026 outlook: Big Banks are getting back their 'earnings mojo'","summary":"Yahoo Finance Video: 2026 outlook: Big Banks are getting back their 'earnings mojo'. Major bank stocks are poised to close 2025 with serious gains; most notably, Citigroup shares (C) are already up 67% while Goldman Sachs (GS) has surged 57% (or nearly $330) year-to-date. Whalen Global Advisors founder and chairman Chris Whalen — alongside TPW Advisory founder Jay Pelosky — speaks with Market Catalysts host Julie Hyman about his consensus on the banking sector heading into 2026, citing various corporate credit risks amid the Federal Reserve's current interest rate environment. Also catch Yahoo Finance Senior Banking Reporter David Hollerith and Hennion & Walsh CIO Kevin Mahn discuss the 2026 outlook for regional banks. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Market Catalysts. Related tickers mentioned: BAC, C, GS, JPM, MS, MS-PQ, XLF."}]}
