{"symbol":"HMC","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:22:15.793Z","asOfDate":"2025-12-23","articles":[{"id":"d060cc99-693e-3cbe-940f-57a4f0744fd9","title":"Generative Renaissance Comes Alive: SIGGRAPH Asia 2025 Closes in Hong Kong","url":"https://finance.yahoo.com/news/generative-renaissance-comes-alive-siggraph-010000718.html","publisher":"PR Newswire","publishedAt":"2025-12-23T01:00:00.000Z","relatedTickers":["ADBE","TCEHY"],"mainIdea":"Generative Renaissance Comes Alive: SIGGRAPH Asia 2025 Closes in Hong Kong","summary":"PR Newswire: Generative Renaissance Comes Alive: SIGGRAPH Asia 2025 Closes in Hong Kong. SIGGRAPH Asia 2025, themed \"Generative Renaissance,\" has successfully come to a close at the Hong Kong Convention and Exhibition Centre. Over 6,000 attendees from 60 countries gathered to explore the latest innovations in computer graphics and interactive techniques. Related tickers mentioned: ADBE, TCEHY."},{"id":"70067b72-afbf-3566-a5fc-aa25bcd65339","title":"Wingtech Demands $8B Redress as Dutch Court Freezes Control of Nexperia","url":"https://finance.yahoo.com/news/wingtech-demands-8b-redress-dutch-175231821.html","publisher":"GuruFocus.com","publishedAt":"2025-12-22T17:52:31.000Z","relatedTickers":["HNDAF"],"mainIdea":"Wingtech Demands $8B Redress as Dutch Court Freezes Control of Nexperia","summary":"GuruFocus.com: Wingtech Demands $8B Redress as Dutch Court Freezes Control of Nexperia. Chairwoman Ruby Yang warns chip supply risks will persist unless control of Dutch unit is reinstated Related tickers mentioned: HNDAF."},{"id":"e4231c03-e52e-3f0f-87cc-13814e9afc82","title":"Asian Undervalued Small Caps With Insider Action For December 2025","url":"https://finance.yahoo.com/news/asian-undervalued-small-caps-insider-223621520.html","publisher":"Simply Wall St.","publishedAt":"2025-12-21T22:36:21.000Z","relatedTickers":["0450.HK","BWP.AX","CFTLF","DDR.AX","HMCLF","OMLAF","PGC.AX","VLS.AX"],"mainIdea":"Asian Undervalued Small Caps With Insider Action For December 2025","summary":"Simply Wall St.: Asian Undervalued Small Caps With Insider Action For December 2025. As 2025 draws to a close, Asian markets are navigating a complex landscape, with Japan's recent interest rate hike marking the highest level in 30 years and China's economic indicators reflecting tepid growth. In this environment, small-cap stocks in Asia are capturing attention as investors seek opportunities amidst shifting market dynamics and broader economic sentiment. Identifying promising stocks often involves evaluating factors such as financial health, industry position, and potential... Related tickers mentioned: 0450.HK, BWP.AX, CFTLF, DDR.AX, HMCLF, OMLAF, PGC.AX, VLS.AX."}]}
