{"symbol":"HMC","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:27:54.986Z","asOfDate":"2025-12-25","articles":[{"id":"f0ea8389-4cfe-350e-81ad-e26a1dbe7b0b","title":"Honda Motor (TSE:7267): Reassessing Valuation After a Steady Share Price Grind Higher","url":"https://finance.yahoo.com/news/honda-motor-tse-7267-reassessing-170359202.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T17:03:59.000Z","relatedTickers":[],"mainIdea":"Honda Motor (TSE:7267): Reassessing Valuation After a Steady Share Price Grind Higher","summary":"Simply Wall St.: Honda Motor (TSE:7267): Reassessing Valuation After a Steady Share Price Grind Higher. Honda Motor (TSE:7267) has been quietly grinding higher this month, and that steady move is catching investor attention as they reassess what they are actually paying for its earnings power and cash generation. See our latest analysis for Honda Motor. That gentle climb has come after a choppier few months, with the 1 year total shareholder return of 8.8 percent and a powerful 3 year total shareholder return of roughly 74 percent suggesting long term momentum is still very much intact, even as..."},{"id":"0216bc1a-db52-34db-b054-9e6191f369ef","title":"Honda to acquire LG Battery assets for $2.9B, Bloomberg reports","url":"https://finance.yahoo.com/news/honda-acquire-lg-battery-assets-111009005.html","publisher":"TipRanks","publishedAt":"2025-12-25T11:10:09.000Z","relatedTickers":["HNDAF"],"mainIdea":"Honda to acquire LG Battery assets for $2.9B, Bloomberg reports","summary":"TipRanks: Honda to acquire LG Battery assets for $2.9B, Bloomberg reports. Honda (HMC) will acquire LG Energy Solution’s facilities and other assets from their joint battery plant in Ohio for approximately $2.9B, Bloomberg’s Hyonhee Shin reports. The sale, to a Honda unit in the U.S., is scheduled to be finalized by the end of February.Claim 70% Off TipRanks This Holiday SeasonUnlock hedge fund-level data and powerful investing tools for smarter, sharper decisions Stay ahead of the market with the latest news and analysis and maximize your portfolio's potential Publish Related tickers mentioned: HNDAF."},{"id":"1b680d7c-2404-30f6-b8cb-d4d7b00596cc","title":"Sector Update: Consumer Stocks Rise in Afternoon Trading","url":"https://finance.yahoo.com/news/sector-consumer-stocks-rise-afternoon-171225095.html","publisher":"MT Newswires","publishedAt":"2025-12-24T17:12:25.000Z","relatedTickers":["373220.KS","AAPL","NKE","TSLA","XLP","XLY"],"mainIdea":"Sector Update: Consumer Stocks Rise in Afternoon Trading","summary":"MT Newswires: Sector Update: Consumer Stocks Rise in Afternoon Trading. Consumer stocks were higher in Wednesday early afternoon trading, with the State Street Consumer Sta Related tickers mentioned: 373220.KS, AAPL, NKE, TSLA, XLP, XLY."},{"id":"f2d19e7d-f0ba-34b2-bf10-86346b195528","title":"Honda to Buy Out LG Energy's Ohio EV Battery Plant Assets for $2.9 Billion","url":"https://finance.yahoo.com/news/honda-buy-lg-energys-ohio-164519253.html","publisher":"GuruFocus.com","publishedAt":"2025-12-24T16:45:19.000Z","relatedTickers":["373220.KS","F","HNDAF"],"mainIdea":"Honda to Buy Out LG Energy's Ohio EV Battery Plant Assets for $2.9 Billion","summary":"GuruFocus.com: Honda to Buy Out LG Energy's Ohio EV Battery Plant Assets for $2.9 Billion. Deal follows EV demand slowdown in the US, with transaction set to close by end-February. Related tickers mentioned: 373220.KS, F, HNDAF."},{"id":"5b2a686d-a3b5-3834-abdc-18720570c9c0","title":"Tesla Stock Drops as U.S. Auto Regulator Probes Alleged Model 3 Door Defects","url":"https://finance.yahoo.com/m/5b2a686d-a3b5-3834-abdc-18720570c9c0/tesla-stock-drops-as-u.s..html","publisher":"Barrons.com","publishedAt":"2025-12-24T15:14:00.000Z","relatedTickers":["F","HNDAF","TSLA"],"mainIdea":"Tesla Stock Drops as U.S. Auto Regulator Probes Alleged Model 3 Door Defects","summary":"Barrons.com: Tesla Stock Drops as U.S. Auto Regulator Probes Alleged Model 3 Door Defects. The U.S. auto safety regulator has opened an investigation into the mechanical door release on the 2022 Tesla Model 3. The probe, launched Tuesday by the Office of Defects Investigation at the National Highway Traffic Safety Administration, or NHTSA, covers an estimated 179,071 vehicles. Tesla didn’t immediately respond to Barron’s request for comment. Related tickers mentioned: F, HNDAF, TSLA."}]}
