{"symbol":"TFC","provider":"yahoo-finance","fetchedAt":"2025-12-25T09:26:34.462Z","asOfDate":"2025-12-25","articles":[{"id":"12aeb837-7823-350f-8402-867d447a3dfa","title":"Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike","url":"https://finance.yahoo.com/news/deutsche-bank-analysis-q4-2025-081334228.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:13:34.000Z","relatedTickers":["TSLA"],"mainIdea":"Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike","summary":"Insider Monkey: Deutsche Bank’s Analysis of Q4 2025 Deliveries Drives Tesla (TSLA) Price Target Hike. Tesla Inc. (NASDAQ:TSLA) is one of the best high volume stocks to buy right now. On December 19, Deutsche Bank raised the firm’s price target on Tesla to $500 from $470 with a Buy rating on the shares. This upward adjustment was driven by the firm’s latest analysis of Tesla’s Q4 2025 delivery performance. On […] Related tickers mentioned: TSLA."},{"id":"965ebe08-ab65-3f8c-a961-95568cc3770b","title":"Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook","url":"https://finance.yahoo.com/news/truist-raises-bofa-bac-profit-081251278.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:12:51.000Z","relatedTickers":["BAC"],"mainIdea":"Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook","summary":"Insider Monkey: Truist Raises BofA (BAC) Profit Estimates on Robust Fee Growth Outlook. Bank of America Corporation (NYSE:BAC) is one of the best high volume stocks to buy right now. On December 18, Truist raised the firm’s price target on Bank of America to $58 from $56 and maintained a Buy rating on the shares. This sentiment was posted as part of the firm’s broader research note that […] Related tickers mentioned: BAC."},{"id":"3a5d73f6-4b9c-3fe5-adc4-6ddc17ce09bb","title":"Truist Financial (TFC): Reassessing Valuation After Recent Share Price Momentum","url":"https://finance.yahoo.com/news/truist-financial-tfc-reassessing-valuation-081023195.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T08:10:23.000Z","relatedTickers":[],"mainIdea":"Truist Financial (TFC): Reassessing Valuation After Recent Share Price Momentum","summary":"Simply Wall St.: Truist Financial (TFC): Reassessing Valuation After Recent Share Price Momentum. Truist Financial (TFC) has quietly been grinding higher, and recent returns suggest investors are warming back up to this regional banking heavyweight as credit fears ease and revenue growth stabilizes. See our latest analysis for Truist Financial. That steady climb has added up, with an 11.5% 1 month share price return, a 17.1% year to date share price return, and a 21.0% 1 year total shareholder return showing momentum is clearly building as investors reassess regional bank risk. If..."}]}
