{"symbol":"TFC","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:52.833Z","asOfDate":"2025-12-23","articles":[{"id":"67cd906c-b8e3-3bc3-91e0-a1bb9475001f","title":"Why DraftKings (DKNG) Stock Is Down Today","url":"https://finance.yahoo.com/news/why-draftkings-dkng-stock-down-165548058.html","publisher":"StockStory","publishedAt":"2025-12-23T16:55:48.000Z","relatedTickers":["DKNG"],"mainIdea":"Why DraftKings (DKNG) Stock Is Down Today","summary":"StockStory: Why DraftKings (DKNG) Stock Is Down Today. Shares of fantasy sports and betting company DraftKings (NASDAQ:DKNG) fell 2.8% in the morning session after Truist Securities lowered its price target on the stock due to costs associated with the launch of its new prediction app. Related tickers mentioned: DKNG."},{"id":"397e0bac-766b-305e-8b82-7424a3078ab8","title":"Stifel and Truist Rate CAVA Group (CAVA) Buy on Strong Outlook","url":"https://finance.yahoo.com/news/stifel-truist-rate-cava-group-162217115.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T16:22:17.000Z","relatedTickers":["CAVA","SF"],"mainIdea":"Stifel and Truist Rate CAVA Group (CAVA) Buy on Strong Outlook","summary":"Insider Monkey: Stifel and Truist Rate CAVA Group (CAVA) Buy on Strong Outlook. CAVA Group, Inc. (NYSE:CAVA) is one of the 13 Best Fast Food Stocks to Buy. On December 12, Stifel reaffirmed its Buy rating on CAVA Group, Inc. (NYSE:CAVA) with a $75 price target after talks with the company’s leadership about 2026 sales drivers and operational performance. Stifel pointed out that even with some recent softness […] Related tickers mentioned: CAVA, SF."},{"id":"f28feaf3-43e0-3d7e-9d03-9b273a453149","title":"Truist announces fourth quarter 2025 earnings call details","url":"https://finance.yahoo.com/news/truist-announces-fourth-quarter-2025-140000563.html","publisher":"PR Newswire","publishedAt":"2025-12-23T14:00:00.000Z","relatedTickers":[],"mainIdea":"Truist announces fourth quarter 2025 earnings call details","summary":"PR Newswire: Truist announces fourth quarter 2025 earnings call details. Truist Financial Corporation (NYSE: TFC) will report fourth quarter 2025 financial results before the market opens on Wednesday, January 21, 2026. Chairman and Chief Executive Officer Bill Rogers and Chief Financial Officer Mike Maguire will host a conference call to review the company's financial results at 8 a.m. ET."},{"id":"47d9ee25-0db2-3a42-9189-92a00cf1c5fd","title":"Tracking the Evolving Cummins Narrative After Shifting Analyst Views","url":"https://finance.yahoo.com/news/tracking-evolving-cummins-narrative-shifting-120959475.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T12:09:59.000Z","relatedTickers":["CMI","WFC"],"mainIdea":"Tracking the Evolving Cummins Narrative After Shifting Analyst Views","summary":"Simply Wall St.: Tracking the Evolving Cummins Narrative After Shifting Analyst Views. Cummins stock has seen a modest uptick in its fair value estimate to about $532 per share as analysts grow more confident in the durability of earnings and the long term boost from data center power demand. A slightly lower discount rate and essentially unchanged revenue growth assumptions together signal a fine tuning of expectations rather than a wholesale rethink of the story. Stay tuned to see how you can track these subtle but important narrative shifts as they unfold over time. Analyst... Related tickers mentioned: CMI, WFC."},{"id":"f0439565-b3be-39a3-836d-4e209ce8c5f6","title":"Truist Flags Autonomous Driving Volatility Despite Higher Tesla (TSLA) Price Target","url":"https://finance.yahoo.com/news/truist-flags-autonomous-driving-volatility-075304895.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T07:53:04.000Z","relatedTickers":["TSLA"],"mainIdea":"Truist Flags Autonomous Driving Volatility Despite Higher Tesla (TSLA) Price Target","summary":"Insider Monkey: Truist Flags Autonomous Driving Volatility Despite Higher Tesla (TSLA) Price Target. Tesla, Inc. (NASDAQ:TSLA) is one of the AI Stocks in the Spotlight for Investors. On December 19, Truist Securities raised its price target on the stock to $444.00 from $406.00 while maintaining a “Hold” rating. The firm believes that autonomous driving developments will lead to continued volatility in the stock despite long-term AI vision. A large […] Related tickers mentioned: TSLA."},{"id":"2d165f1a-b15c-3235-8f37-a0682b9ccd73","title":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","url":"https://finance.yahoo.com/news/truist-reaffirms-buy-nvidia-nvda-075136854.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T07:51:36.000Z","relatedTickers":["AMD","AVGO","NVDA","TTMI"],"mainIdea":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","summary":"Insider Monkey: Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside. NVIDIA Corporation (NASDAQ:NVDA) is one of the AI Stocks in the Spotlight for Investors. On December 19, Truist reiterated the stock at “Buy” and raised its price target to $275 per share from $255. The firm revised price targets in the semiconductor and artificial intelligence group after establishing 2027 projections. “In this construct, we favor […] Related tickers mentioned: AMD, AVGO, NVDA, TTMI."},{"id":"b7690570-c965-36ef-81bc-f4d25796f3d8","title":"Here’s What Analysts Think About Ralliant Corporation (RAL)","url":"https://finance.yahoo.com/news/analysts-think-ralliant-corporation-ral-055332779.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T05:53:32.000Z","relatedTickers":["RAL"],"mainIdea":"Here’s What Analysts Think About Ralliant Corporation (RAL)","summary":"Insider Monkey: Here’s What Analysts Think About Ralliant Corporation (RAL). Ralliant Corporation (NYSE:RAL) is one of the Best Young Tech Stocks to Buy. On December 15, Ian Zaffino from Oppenheimer reiterated a Buy rating on Ralliant Corporation (NYSE:RAL) and raised the price target from $55 to $60. Earlier, on December 12, Truist Financial initiated the stock with a Buy rating and $62 price target. Zaffino […] Related tickers mentioned: RAL."}]}
