{"symbol":"FSLY","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:21:40.005Z","asOfDate":"2025-12-23","articles":[{"id":"cd1780cd-b96d-3ebc-9ccd-305e27cc284e","title":"New Study Sponsored by Fastly Reveals Modern Application Security Programs Deliver 3x Better Business Outcomes","url":"https://finance.yahoo.com/news/study-sponsored-fastly-reveals-modern-130000548.html","publisher":"Business Wire","publishedAt":"2025-12-22T13:00:00.000Z","relatedTickers":[],"mainIdea":"New Study Sponsored by Fastly Reveals Modern Application Security Programs Deliver 3x Better Business Outcomes","summary":"Business Wire: New Study Sponsored by Fastly Reveals Modern Application Security Programs Deliver 3x Better Business Outcomes. SAN FRANCISCO, December 22, 2025--Fastly, Inc. (NASDAQ: FSLY), a leading global edge cloud platform, and IDC today released a new study, \"From Code to Production: How Modern AppSec Programs Yield 3x Better Business Outcomes,\" commissioned by Fastly. The study reveals a strong correlation between modern Application Security (AppSec) programs and significantly improved business outcomes, with the most advanced programs delivering more than three times better results in developer productivity, user"},{"id":"a4bcbacc-4cea-341d-8da6-e65290eba732","title":"3 Unprofitable Stocks with Questionable Fundamentals","url":"https://finance.yahoo.com/news/3-unprofitable-stocks-questionable-fundamentals-043806868.html","publisher":"StockStory","publishedAt":"2025-12-22T04:38:06.000Z","relatedTickers":["BILL","CHGG"],"mainIdea":"3 Unprofitable Stocks with Questionable Fundamentals","summary":"StockStory: 3 Unprofitable Stocks with Questionable Fundamentals. Running at a loss can be a red flag. Many of these businesses face mounting challenges as competition increases and funding becomes harder to secure. Related tickers mentioned: BILL, CHGG."},{"id":"387df6a1-5e8f-318e-ad1f-04126bc7f8c8","title":"Fastly Threat Insights Report Reveals Organizations are Fighting Back Against the Rise of the Bots","url":"https://finance.yahoo.com/news/fastly-threat-insights-report-reveals-130000954.html","publisher":"Business Wire","publishedAt":"2025-12-18T13:00:00.000Z","relatedTickers":[],"mainIdea":"Fastly Threat Insights Report Reveals Organizations are Fighting Back Against the Rise of the Bots","summary":"Business Wire: Fastly Threat Insights Report Reveals Organizations are Fighting Back Against the Rise of the Bots. SAN FRANCISCO, December 18, 2025--Fastly, Inc. (NASDAQ: FSLY), a leader in global edge cloud platforms, today released its latest Threat Insights Report, offering a detailed analysis of the evolving bot landscape and its implications for businesses. Drawing from trillions of application and API requests across Fastly’s global network, the report highlights how automated traffic is reshaping industries, forcing organizations to adapt their strategies to manage both the risks and opportunities bot"}]}
