{"symbol":"FOXA","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:46:22.544Z","asOfDate":"2025-12-27","articles":[{"id":"daf006aa-afd0-387f-af3f-6accbfdadbaa","title":"Has Fox’s 2025 Surge and Sports Focus Already Been Priced In?","url":"https://finance.yahoo.com/news/fox-2025-surge-sports-focus-021242324.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T02:12:42.000Z","relatedTickers":["FOX"],"mainIdea":"Has Fox’s 2025 Surge and Sports Focus Already Been Priced In?","summary":"Simply Wall St.: Has Fox’s 2025 Surge and Sports Focus Already Been Priced In?. Wondering if Fox is still a buy after its big run, or if the easy money has already been made? You are not alone, and that is exactly what we are going to unpack here. The stock has been on a tear, climbing 4.8% over the last week, 12.2% over the past month, and 50.5% year to date, with multi year returns of 150.6% over 3 years and 171.1% over 5 years reshaping investor expectations. Behind those gains, investors have been reacting to Fox's strategic push into live sports and news... Related tickers mentioned: FOX."},{"id":"1682409f-0be0-3b77-882b-161522aba773","title":"Fox Corporation (FOXA) Hit a 52 Week High, Can the Run Continue?","url":"https://finance.yahoo.com/news/fox-corporation-foxa-hit-52-141502000.html","publisher":"Zacks","publishedAt":"2025-12-23T14:15:02.000Z","relatedTickers":["FOX"],"mainIdea":"Fox Corporation (FOXA) Hit a 52 Week High, Can the Run Continue?","summary":"Zacks: Fox Corporation (FOXA) Hit a 52 Week High, Can the Run Continue?. Fox (FOXA) is at a 52-week high, but can investors hope for more gains in the future? We take a look at the company's fundamentals for clues. Related tickers mentioned: FOX."},{"id":"b38b8a61-f00f-3e28-9f07-0c6a4c3758d3","title":"Why FOX (FOXA) Stock Is Up Today","url":"https://finance.yahoo.com/news/why-fox-foxa-stock-today-200135011.html","publisher":"StockStory","publishedAt":"2025-12-22T20:01:35.000Z","relatedTickers":["FOX"],"mainIdea":"Why FOX (FOXA) Stock Is Up Today","summary":"StockStory: Why FOX (FOXA) Stock Is Up Today. Shares of cable news and media network Fox (NASDAQ:FOXA) jumped 2.8% in the afternoon session after Guggenheim raised its price target for the company's shares to $85.00 from $75.00, maintaining its \"Buy\" rating. Related tickers mentioned: FOX."}]}
