{"symbol":"JPM","provider":"yahoo-finance","fetchedAt":"2025-12-24T01:49:53.814Z","asOfDate":"2025-12-23","articles":[{"id":"bd9572d2-2ba5-3e19-92a4-246f5e477fc3","title":"Regency Centers (REG) Rating Adjusted in JPMorgan’s 2026 Outlook","url":"https://finance.yahoo.com/news/regency-centers-reg-rating-adjusted-221856718.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:18:56.000Z","relatedTickers":["REG","REGCO","REGCP"],"mainIdea":"Regency Centers (REG) Rating Adjusted in JPMorgan’s 2026 Outlook","summary":"Insider Monkey: Regency Centers (REG) Rating Adjusted in JPMorgan’s 2026 Outlook. Regency Centers Corporation (NASDAQ:REG) is included among the Best Stocks for a Dividend Achievers List. On December 18, JPMorgan analyst Michael Mueller downgraded Regency Centers Corporation (NASDAQ:REG) to Neutral from Overweight. The price target moved down to $76 from $81. Mueller framed the move as tactical. He called it “simply a ‘stock call’ as we […] Related tickers mentioned: REG, REGCO, REGCP."},{"id":"30c31140-e2a1-3d32-9943-7f93ed53c568","title":"General Dynamics Corporation (GD): A Dividend Aristocrat","url":"https://finance.yahoo.com/news/general-dynamics-corporation-gd-dividend-215457680.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T21:54:57.000Z","relatedTickers":["GD"],"mainIdea":"General Dynamics Corporation (GD): A Dividend Aristocrat","summary":"Insider Monkey: General Dynamics Corporation (GD): A Dividend Aristocrat. General Dynamics Corporation (NYSE:GD) is among the 7 Best Defense Dividend Stocks to Buy, with a dividend yield of 1.74% as of December 22. On December 19, JP Morgan lifted its price target on the stock to $385 from $380, while maintaining an Overweight rating on the shares. The revision came as part of the […] Related tickers mentioned: GD."},{"id":"85d2935d-833a-3998-83d7-bee0a01aadde","title":"JPMorgan Is Exploring Crypto Trading for Institutional Clients","url":"https://finance.yahoo.com/video/jpmorgan-exploring-crypto-trading-institutional-203634833.html","publisher":"Bloomberg","publishedAt":"2025-12-23T20:36:34.000Z","relatedTickers":[],"mainIdea":"JPMorgan Is Exploring Crypto Trading for Institutional Clients","summary":"Bloomberg: JPMorgan Is Exploring Crypto Trading for Institutional Clients. JPMorgan is considering offering cryptocurrency trading to its institutional clients, as large banks around the world deepen their involvement in the asset class. The Wall Street giant is assessing what products and services its markets division could offer to expand its footprint in cryptocurrencies, according to a person familiar with the plans. This could include spot and derivatives trading, said the person who asked not to be identified as the plans are not public. Bloomberg's Lauren Tara LaCapra reports on \"Bloomberg Crypto\"."},{"id":"c6ba9b77-b1aa-35cf-bb8c-076852a1f678","title":"Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio","url":"https://finance.yahoo.com/news/why-1-finance-stock-could-143003971.html","publisher":"Zacks","publishedAt":"2025-12-23T14:30:03.000Z","relatedTickers":[],"mainIdea":"Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio","summary":"Zacks: Why This 1 Finance Stock Could Be a Great Addition to Your Portfolio. Finding strong, market-beating stocks with a positive earnings outlook becomes easier with the Focus List, a top feature of the Zacks Premium portfolio service."},{"id":"867bc30c-8928-3628-9c33-dae23ab056e2","title":"Crypto exchanges brace for pressure as banks like JPMorgan enter spot trading","url":"https://finance.yahoo.com/m/867bc30c-8928-3628-9c33-dae23ab056e2/crypto-exchanges-brace-for.html","publisher":"CoinDesk","publishedAt":"2025-12-23T14:00:00.000Z","relatedTickers":[],"mainIdea":"Crypto exchanges brace for pressure as banks like JPMorgan enter spot trading","summary":"CoinDesk: Crypto exchanges brace for pressure as banks like JPMorgan enter spot trading. The national banks regulator OCC released a statement signaling a shift in rules that will have significant crypto market consequences across the United States."},{"id":"b1c4b17e-eb4a-34dc-941e-2607b0ef6d35","title":"LivaNova to Present at J.P. Morgan Healthcare Conference in January","url":"https://finance.yahoo.com/news/livanova-present-j-p-morgan-140000299.html","publisher":"Business Wire","publishedAt":"2025-12-23T14:00:00.000Z","relatedTickers":["LIVN"],"mainIdea":"LivaNova to Present at J.P. Morgan Healthcare Conference in January","summary":"Business Wire: LivaNova to Present at J.P. Morgan Healthcare Conference in January. LONDON, December 23, 2025--LivaNova PLC (Nasdaq: LIVN), a market-leading medical technology company, today announced it will present at the J.P. Morgan 44th Annual Healthcare Conference in San Francisco. Vladimir Makatsaria, Chief Executive Officer of LivaNova, and Alex Shvartsburg, Chief Financial Officer, will participate in a fireside chat on Wed., Jan. 14, 2026, at 1:30 p.m. Pacific Standard Time. Related tickers mentioned: LIVN."},{"id":"b98e2f74-4de8-35f6-ad94-2d2ffc8b0db9","title":"Kailera Therapeutics to Present at 44th Annual J.P. Morgan Healthcare Conference","url":"https://finance.yahoo.com/news/kailera-therapeutics-present-44th-annual-140000607.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T14:00:00.000Z","relatedTickers":[],"mainIdea":"Kailera Therapeutics to Present at 44th Annual J.P. Morgan Healthcare Conference","summary":"GlobeNewswire: Kailera Therapeutics to Present at 44th Annual J.P. Morgan Healthcare Conference. WALTHAM, Mass. and SAN DIEGO, Dec. 23, 2025 (GLOBE NEWSWIRE) -- Kailera Therapeutics, Inc., an advanced clinical-stage biotechnology company focused on elevating the next era of obesity care, today announced that Ron Renaud, President and Chief Executive Officer, will present at the 44th Annual J.P. Morgan Healthcare Conference in San Francisco, California, on Monday, January 12, 2025, at 11:00 a.m. PT. About Kailera TherapeuticsKailera Therapeutics (Kailera) is an advanced clinical-stage biotec"},{"id":"ac731bad-0fd2-32bf-b761-c63d9463482d","title":"Jim Cramer Highlights Alphabet’s Diverse Portfolio","url":"https://finance.yahoo.com/news/jim-cramer-highlights-alphabet-diverse-051610017.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T05:16:10.000Z","relatedTickers":["AVGO","BA","GOOG"],"mainIdea":"Jim Cramer Highlights Alphabet’s Diverse Portfolio","summary":"Insider Monkey: Jim Cramer Highlights Alphabet’s Diverse Portfolio. Alphabet Inc. (NASDAQ:GOOGL) is one of the stocks Jim Cramer answered questions about. Starting the round of “Am I Diversified?”, a caller mentioned that their top five portfolio holdings are JPM, GOOGL, BA, PG, and AVGO. Cramer commented: “Let’s go to work in a year of practical investing, it’s upcoming…. Okay, so Broadcom, we know […] Related tickers mentioned: AVGO, BA, GOOG."},{"id":"22cef689-6764-3f91-a5b6-17f65e4939d1","title":"Why Analysts See St. James's Place Undervalued As Its Investment Story Evolves","url":"https://finance.yahoo.com/news/why-analysts-see-st-jamess-050556451.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T05:05:56.000Z","relatedTickers":["STJPF"],"mainIdea":"Why Analysts See St. James's Place Undervalued As Its Investment Story Evolves","summary":"Simply Wall St.: Why Analysts See St. James's Place Undervalued As Its Investment Story Evolves. St. James's Place has seen its fair value estimate nudged higher to about £15.42 per share, as analysts grow more confident that the wealth manager can deliver on its earnings and capital generation plans. This modest uplift reflects a market narrative that is becoming more constructive, yet still mindful of regulatory and execution risks that could limit a more aggressive rerating. Stay tuned to see how investors can track these evolving price targets and the shifting story behind them over... Related tickers mentioned: STJPF."},{"id":"21796c13-2a49-3555-a10e-9b3c93bd3b57","title":"A Look at What Charlie Javice Charged JPMorgan in Legal Bills","url":"https://finance.yahoo.com/m/21796c13-2a49-3555-a10e-9b3c93bd3b57/a-look-at-what-charlie-javice.html","publisher":"The Wall Street Journal","publishedAt":"2025-12-22T23:12:09.000Z","relatedTickers":[],"mainIdea":"A Look at What Charlie Javice Charged JPMorgan in Legal Bills","summary":"The Wall Street Journal: A Look at What Charlie Javice Charged JPMorgan in Legal Bills. Charlie Javice was convicted of defrauding the bank when she sold her educational startup, Frank, for $175 million to JPMorgan Chase in 2021. But in a twist, the bank has been picking up the legal bills for Javice and Olivier Amar, another executive, because of a clause in that deal that said JPMorgan would shoulder all associated costs in the event of a dispute."}]}
