{"symbol":"UBER","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:59.636Z","asOfDate":"2025-12-27","articles":[{"id":"9ee5934f-7ab6-3fde-9091-017e82393370","title":"Why smart glasses should be on your Christmas list next year","url":"https://finance.yahoo.com/m/9ee5934f-7ab6-3fde-9091-017e82393370/why-smart-glasses-should-be.html","publisher":"Digital Trends","publishedAt":"2025-12-27T19:00:00.000Z","relatedTickers":[],"mainIdea":"Why smart glasses should be on your Christmas list next year","summary":"Digital Trends: Why smart glasses should be on your Christmas list next year. Smart glasses are no longer niche gizmos with a fading vanity factor. On the contrary, they now offer a peak into the future of wearable computing, but you can still pick options solely for work and play without breaking the bank. The post Why smart glasses should be on your Christmas list next year appeared first on Digital Trends."},{"id":"4dc024f7-bcff-3153-9f8e-58283e0e35c9","title":"Amazon Is Spending But Getting Results. 2026 Could Be Its Year.","url":"https://finance.yahoo.com/m/4dc024f7-bcff-3153-9f8e-58283e0e35c9/amazon-is-spending-but.html","publisher":"Barrons.com","publishedAt":"2025-12-27T07:00:00.000Z","relatedTickers":["AMZN","GOOG","META","NVDA","WMT"],"mainIdea":"Amazon Is Spending But Getting Results. 2026 Could Be Its Year.","summary":"Barrons.com: Amazon Is Spending But Getting Results. 2026 Could Be Its Year.. This year belonged to Alphabet It could be Amazon turn among the Mag Seven in 2026. Amazon, at around $232, has gained just 6% this year and trades for about 29 times projected 2026 earnings of $8 a share—we’re using a conservative estimate that includes stock compensation—a discount to a slower-growing Walmart at 38 times earnings. Investors are worried about Amazon’s $125 billion of capital spending this year, a slowdown at its industry-leading Amazon Web Services cloud platform, and whether it’s harnessing AI as well as some Mag Seven peers. Related tickers mentioned: AMZN, GOOG, META, NVDA, WMT."},{"id":"9c5961be-2751-3c8b-9b82-422d864df0f6","title":"Lucid Takes On Tesla: $50K Crossover Is Coming For The Model Y","url":"https://finance.yahoo.com/news/lucid-takes-tesla-50k-crossover-023106097.html","publisher":"Benzinga","publishedAt":"2025-12-27T02:31:06.000Z","relatedTickers":["LCID","TSLA"],"mainIdea":"Lucid Takes On Tesla: $50K Crossover Is Coming For The Model Y","summary":"Benzinga: Lucid Takes On Tesla: $50K Crossover Is Coming For The Model Y. Lucid Group, Inc. (NASDAQ:LCID) is shifting from ultra-luxury to the mass market, setting its sights on the Tesla, Inc. (NASDAQ:TSLA) Model Y with a new midsize crossover priced under $50,000. The shift toward a more affordable model comes at a critical time, as Lucid’s new Gravity SUV faces a rocky start. The Model Y Challenger Internally dubbed “Project Midsize”—and potentially named the Lucid Earth—the upcoming vehicle represents a do-or-die moment for the California-based automaker as it see Related tickers mentioned: LCID, TSLA."}]}
