{"symbol":"UBER","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:04.291Z","asOfDate":"2025-12-23","articles":[{"id":"e40fd558-9c55-3947-bcdf-8968e718ffd7","title":"NH charges Uber with deceptive practices","url":"https://finance.yahoo.com/m/e40fd558-9c55-3947-bcdf-8968e718ffd7/nh-charges-uber-with.html","publisher":"New Hampshire Union Leader, Manchester","publishedAt":"2025-12-22T23:47:00.000Z","relatedTickers":[],"mainIdea":"NH charges Uber with deceptive practices","summary":"New Hampshire Union Leader, Manchester: NH charges Uber with deceptive practices. New Hampshire has joined a multistate lawsuit charging owners of the Uber ridesharing business with engaging in deceptive billing and cancellation practices through its Uber One subscription service. NH joins lawsuit against Uber Attorney General John Formella said the state has joined a Federal Trade Commission lawsuit charging Uber's ownership with deceptive practices. “Consumers should not ..."},{"id":"56c75b3d-23ca-3c43-9e45-b8d8d93c3ee3","title":"Uber Stock Gains As It Races With Lyft To Test Baidu's Robotaxis In London","url":"https://finance.yahoo.com/m/56c75b3d-23ca-3c43-9e45-b8d8d93c3ee3/uber-stock-gains-as-it-races.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-22T21:36:14.000Z","relatedTickers":["BIDU","LYFT"],"mainIdea":"Uber Stock Gains As It Races With Lyft To Test Baidu's Robotaxis In London","summary":"Investor's Business Daily: Uber Stock Gains As It Races With Lyft To Test Baidu's Robotaxis In London. Uber stock gained after the tech giant said it would partner with Baidu to test robotaxis in London next year. Related tickers mentioned: BIDU, LYFT."},{"id":"8247f025-c3e7-3e1b-91b7-640090db20d0","title":"Watchdog Warns Uber Users To Take A Lyft Following NY Times Report That Uber Let Violent Felons, Rapists Drive, Background Check System Built To Fail, Says Consumer Watchdog","url":"https://finance.yahoo.com/news/watchdog-warns-uber-users-lyft-190400390.html","publisher":"PR Newswire","publishedAt":"2025-12-22T19:04:00.000Z","relatedTickers":[],"mainIdea":"Watchdog Warns Uber Users To Take A Lyft Following NY Times Report That Uber Let Violent Felons, Rapists Drive, Background Check System Built To Fail, Says Consumer Watchdog","summary":"PR Newswire: Watchdog Warns Uber Users To Take A Lyft Following NY Times Report That Uber Let Violent Felons, Rapists Drive, Background Check System Built To Fail, Says Consumer Watchdog. The nonprofit Consumer Watchdog warned Uber users to start using Lyft after a blockbuster New York Times report. The report found Uber's background check system let criminals convicted of crimes like child abuse, assault and stalking drive for Uber, as long as the conviction was more than seven years old. The report also found that the system has many gaps, often intentionally imposed, to allow for speed and to keep costs low. Lyft, by contrast, bans drivers convicted of violent felonies wheneve"}]}
