{"symbol":"UBER","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:28:43.855Z","asOfDate":"2025-12-25","articles":[{"id":"ee0b4bdd-1164-3363-aa03-58d6738990e3","title":"Your guide to gig work, whether it's your side hustle or main source of income","url":"https://finance.yahoo.com/m/ee0b4bdd-1164-3363-aa03-58d6738990e3/your-guide-to-gig-work%2C.html","publisher":"Business Insider","publishedAt":"2025-12-25T18:41:01.000Z","relatedTickers":[],"mainIdea":"Your guide to gig work, whether it's your side hustle or main source of income","summary":"Business Insider: Your guide to gig work, whether it's your side hustle or main source of income. Gig work for Uber, Lyft, DoorDash, and others has become widespread — and tricky to do profitably, gig workers have said."},{"id":"cba45803-95d1-32d1-aaff-811de730088b","title":"Uber and Lyft Partner With Baidu (BIDU) to Launch Driverless Taxi Trials in the UK","url":"https://finance.yahoo.com/news/uber-lyft-partner-baidu-bidu-170039303.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T17:00:39.000Z","relatedTickers":["BAIDF","BIDU","GOOG","LYFT"],"mainIdea":"Uber and Lyft Partner With Baidu (BIDU) to Launch Driverless Taxi Trials in the UK","summary":"Insider Monkey: Uber and Lyft Partner With Baidu (BIDU) to Launch Driverless Taxi Trials in the UK. Baidu, Inc. (NASDAQ:BIDU) is one of the best rising tech stocks to buy now. A significant escalation in the global race toward autonomous mobility occurred on December 22, 2025, when Uber and Lyft announced partnerships with Baidu, Inc. (NASDAQ:BIDU) to launch driverless taxi trials in the UK in 2026. This partnership will see Baidu’s Apollo […] Related tickers mentioned: BAIDF, BIDU, GOOG, LYFT."},{"id":"beef3cec-8fab-3b39-a760-8dcd4a17a595","title":"Is Joby Aviation Yesterday's News?","url":"https://finance.yahoo.com/m/beef3cec-8fab-3b39-a760-8dcd4a17a595/is-joby-aviation-yesterday%27s.html","publisher":"Motley Fool","publishedAt":"2025-12-25T14:50:00.000Z","relatedTickers":["ACHR","JOBY"],"mainIdea":"Is Joby Aviation Yesterday's News?","summary":"Motley Fool: Is Joby Aviation Yesterday's News?. The company has plenty of growth catalysts in 2026 and beyond. Related tickers mentioned: ACHR, JOBY."},{"id":"e8e93a9c-ab6c-3fb1-9dbb-3ec084779703","title":"How Dubai Robotaxis And New AV Partnerships At Uber Technologies (UBER) Have Changed Its Investment Story","url":"https://finance.yahoo.com/news/dubai-robotaxis-av-partnerships-uber-042122716.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T04:21:22.000Z","relatedTickers":["BIDU","WRD"],"mainIdea":"How Dubai Robotaxis And New AV Partnerships At Uber Technologies (UBER) Have Changed Its Investment Story","summary":"Simply Wall St.: How Dubai Robotaxis And New AV Partnerships At Uber Technologies (UBER) Have Changed Its Investment Story. In December 2025, WeRide and Uber, in partnership with Dubai’s Roads and Transport Authority, launched public Robotaxi passenger rides via the Uber app across the busy coastal districts of Umm Suqeim and Jumeirah, initially with on-board specialists ahead of a planned fully driverless service in early 2026. This rollout, alongside Uber’s broader push into autonomous partnerships such as Baidu robotaxi trials in London, highlights how third-party AV integrations could deepen platform usage... Related tickers mentioned: BIDU, WRD."},{"id":"7d7200ef-34e2-325b-b3c5-740264d1cad8","title":"Tesla's Austin Robotaxi Project Is Smaller Than Elon Musk's Claims: Report","url":"https://finance.yahoo.com/news/teslas-austin-robotaxi-project-smaller-023113864.html","publisher":"Benzinga","publishedAt":"2025-12-25T02:31:13.000Z","relatedTickers":["TSLA"],"mainIdea":"Tesla's Austin Robotaxi Project Is Smaller Than Elon Musk's Claims: Report","summary":"Benzinga: Tesla's Austin Robotaxi Project Is Smaller Than Elon Musk's Claims: Report. Tesla Inc.'s (NASDAQ:TSLA) pilot Robotaxi operations' scale in Austin could reportedly be smaller than what CEO Elon Musk has claimed. Tesla Robotaxi Tracker An engineering student at Texas A&M University has reverse-engineered the official Tesla Robotaxi app to track the service's availability, Electrek reported on Monday. The tracker details 32 Tesla Model Ys used in the Robotaxi network in Austin, which is far from Musk's earlier claims of having 1000 Robotaxis in Austin. Tesla didn’t immedia Related tickers mentioned: TSLA."},{"id":"2ae284cc-4bcc-3738-84f9-b9f8312bf4c5","title":"3 Reasons to Buy Uber Stock Like There's No Tomorrow","url":"https://finance.yahoo.com/m/2ae284cc-4bcc-3738-84f9-b9f8312bf4c5/3-reasons-to-buy-uber-stock.html","publisher":"Motley Fool","publishedAt":"2025-12-25T02:20:00.000Z","relatedTickers":["DASH","GE","GRAB","LYFT"],"mainIdea":"3 Reasons to Buy Uber Stock Like There's No Tomorrow","summary":"Motley Fool: 3 Reasons to Buy Uber Stock Like There's No Tomorrow. Investors may not appreciate all of the tailwinds that could drive Uber stock higher. Related tickers mentioned: DASH, GE, GRAB, LYFT."}]}
