{"symbol":"MET","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:56:02.005Z","asOfDate":"2025-12-22","articles":[{"id":"573f4153-51c0-37b5-8a2b-832fa41d4d8c","title":"Daura Gold Commences Exploration at Latin Metals’  Cerro Bayo Project, Santa Cruz Province, Argentina","url":"https://finance.yahoo.com/news/daura-gold-commences-exploration-latin-215100283.html","publisher":"GlobeNewswire","publishedAt":"2025-12-22T21:51:00.000Z","relatedTickers":["DGCOF","GC=F","LMSQF","SI=F"],"mainIdea":"Daura Gold Commences Exploration at Latin Metals’ Cerro Bayo Project, Santa Cruz Province, Argentina","summary":"GlobeNewswire: Daura Gold Commences Exploration at Latin Metals’ Cerro Bayo Project, Santa Cruz Province, Argentina. Announces $1.79 Million Option and Warrant ExerciseVANCOUVER, British Columbia, Dec. 22, 2025 (GLOBE NEWSWIRE) -- Latin Metals Inc. (\"Latin Metals\" or the \"Company\") (TSXV: LMS) (OTCQB: LMSQF) reports that option partner Daura Gold Corp. (\"Daura\") (TSXV: DGC) has commenced induced polarization (\"IP\") geophysical surveying across the Cerro Bayo gold-silver project (the \"Project\") (Figure 1) in the Deseado Massif, Santa Cruz Province, Argentina. Daura has an option (the \"Option\") to earn up to 80% Related tickers mentioned: DGCOF, GC=F, LMSQF, SI=F."},{"id":"b1017355-3cc2-315d-b97b-d6322a3084d8","title":"Outcry follows CBS pulling program on prison key to Trump deportations","url":"https://finance.yahoo.com/m/b1017355-3cc2-315d-b97b-d6322a3084d8/outcry-follows-cbs-pulling.html","publisher":"AFP","publishedAt":"2025-12-22T21:26:02.000Z","relatedTickers":[],"mainIdea":"Outcry follows CBS pulling program on prison key to Trump deportations","summary":"AFP: Outcry follows CBS pulling program on prison key to Trump deportations. The leadership of CBS News was facing accusations of political meddling on Monday over a last-minute decision to not air a report on the notorious Salvadoran prison where US President Donald Trump has sent deported migrants.CBS, which was purchased by the Trump-linked Ellison family earlier this year, said that the prison report needed \"additional reporting.\""},{"id":"9affd605-8827-38d5-bfc6-c19f8e88d8d5","title":"Fulgent Genetics Agrees to Acquire Bako Diagnostics and StrataDx","url":"https://finance.yahoo.com/news/fulgent-genetics-agrees-acquire-bako-211000787.html","publisher":"Business Wire","publishedAt":"2025-12-22T21:10:00.000Z","relatedTickers":["FLGT"],"mainIdea":"Fulgent Genetics Agrees to Acquire Bako Diagnostics and StrataDx","summary":"Business Wire: Fulgent Genetics Agrees to Acquire Bako Diagnostics and StrataDx. EL MONTE, Calif., December 22, 2025--Fulgent Genetics, Inc. (NASDAQ: FLGT) (\"Fulgent\"), a technology-based company with a well-established laboratory services business and a therapeutic development business, today announced that it has entered into a definitive agreement to acquire selected assets of Bako Diagnostics (\"Bako\"), a premier pathology laboratory headquartered in Alpharetta, GA and to acquire StrataDx, a premier dermatopathology laboratory located in Lexington, MA. Fulgent will acquir Related tickers mentioned: FLGT."}]}
