{"symbol":"MET","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:27:14.247Z","asOfDate":"2025-12-25","articles":[{"id":"0df9916f-4205-3909-ba67-597ebb9f14a6","title":"Is First American Financial Stock a Buy After Davis Asset Management Added Over 800,00 Shares to Its Position?","url":"https://finance.yahoo.com/m/0df9916f-4205-3909-ba67-597ebb9f14a6/is-first-american-financial.html","publisher":"Motley Fool","publishedAt":"2025-12-25T22:58:30.000Z","relatedTickers":["FAF"],"mainIdea":"Is First American Financial Stock a Buy After Davis Asset Management Added Over 800,00 Shares to Its Position?","summary":"Motley Fool: Is First American Financial Stock a Buy After Davis Asset Management Added Over 800,00 Shares to Its Position?. Davis Asset Management boosted its position by approximately $53 million in this provider of real estate-related services. Related tickers mentioned: FAF."},{"id":"ecca8531-8ee1-3a58-86e4-5087239cdc32","title":"CGTN: Why China's anti-corruption drive never stops","url":"https://finance.yahoo.com/news/cgtn-why-chinas-anti-corruption-223700059.html","publisher":"CNW Group","publishedAt":"2025-12-25T22:37:00.000Z","relatedTickers":[],"mainIdea":"CGTN: Why China's anti-corruption drive never stops","summary":"CNW Group: CGTN: Why China's anti-corruption drive never stops. The Political Bureau of the Communist Party of China (CPC) Central Committee met on Thursday to review discipline inspection work and set priorities for 2026, signaling once again that China's fight against corruption will neither pause nor retreat."},{"id":"39f00ea1-a5b4-3b43-a264-a7e236601455","title":"Bankruptcies hit US spirit makers as Americans drink and spend less","url":"https://finance.yahoo.com/m/39f00ea1-a5b4-3b43-a264-a7e236601455/bankruptcies-hit-us-spirit.html","publisher":"USA TODAY","publishedAt":"2025-12-25T22:35:25.000Z","relatedTickers":[],"mainIdea":"Bankruptcies hit US spirit makers as Americans drink and spend less","summary":"USA TODAY: Bankruptcies hit US spirit makers as Americans drink and spend less. With Americans drinking less alcohol and international trade affecting exports, some distilleries are filing for bankruptcy."},{"id":"9ea13474-effe-304a-bae1-6161622e5e50","title":"China's First Domestic Anti-CTLA-4 Monoclonal Antibody, Innovent's TABOSUN® (Ipilimumab N01 Injection) Received NMPA Approval","url":"https://finance.yahoo.com/news/chinas-first-domestic-anti-ctla-084400564.html","publisher":"PR Newswire","publishedAt":"2025-12-25T08:44:00.000Z","relatedTickers":["IVBIY","IVBXF"],"mainIdea":"China's First Domestic Anti-CTLA-4 Monoclonal Antibody, Innovent's TABOSUN® (Ipilimumab N01 Injection) Received NMPA Approval","summary":"PR Newswire: China's First Domestic Anti-CTLA-4 Monoclonal Antibody, Innovent's TABOSUN® (Ipilimumab N01 Injection) Received NMPA Approval. Innovent Biologics, Inc. (\"Innovent\") (HKEX: 01801), a world-class biopharmaceutical company that develops, manufactures and commercializes high quality medicines for the treatment of oncology, cardiovascular and metabolic, autoimmune, ophthalmology and other major diseases, announces that the New Drug Application (NDA) for TABOSUN® (ipilimumab N01 injection; R&D Code: IBI310), the first domestic cytotoxic lymphocyte-associated antigen-4 (CTLA-4) monoclonal antibody (mAb), has been approved by C Related tickers mentioned: IVBIY, IVBXF."},{"id":"10274d35-1533-3c06-bcc3-0725d0e4ccce","title":"Pope Leo expected to call for peace during first Christmas blessing","url":"https://finance.yahoo.com/m/10274d35-1533-3c06-bcc3-0725d0e4ccce/pope-leo-expected-to-call-for.html","publisher":"AFP","publishedAt":"2025-12-25T08:22:27.000Z","relatedTickers":[],"mainIdea":"Pope Leo expected to call for peace during first Christmas blessing","summary":"AFP: Pope Leo expected to call for peace during first Christmas blessing. Pope Leo XIV will deliver his first Christmas blessing from St Peter's Basilica on Thursday, after a year overshadowed by conflict, but also marked by hopes for peace in Gaza. However, the Pope's call this week for a one-day global truce went unheeded in Ukraine, where fighting continued, as the pontiff prepared to deliver his \"Urbi et Orbi\" blessing at 12:00 (1100 GMT) -- during which popes usually speak about conflicts around the world and urge peace."},{"id":"53baa1df-5ac2-31db-bb7e-53b910adabc4","title":"BofA Trims Pfizer (PFE) PT as COVID-19 Sales Slide and Obesity Focus Shifts to Metsera","url":"https://finance.yahoo.com/news/bofa-trims-pfizer-pfe-pt-081101740.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T08:11:01.000Z","relatedTickers":["MTSR","PFE"],"mainIdea":"BofA Trims Pfizer (PFE) PT as COVID-19 Sales Slide and Obesity Focus Shifts to Metsera","summary":"Insider Monkey: BofA Trims Pfizer (PFE) PT as COVID-19 Sales Slide and Obesity Focus Shifts to Metsera. Pfizer Inc. (NYSE:PFE) is one of the best high volume stocks to buy right now. On December 16, Bank of America analyst Jason Gerberry lowered the firm’s price target on Pfizer to $27 from $28 while keeping a Neutral rating on the shares. Pfizer’s 2026 guidance revealed a steeper erosion of its COVID-19 franchise than […] Related tickers mentioned: MTSR, PFE."}]}
