{"symbol":"BABA","provider":"yahoo-finance","fetchedAt":"2025-12-23T08:23:12.512Z","asOfDate":"2025-12-23","articles":[{"id":"71ca0b31-035b-3bd8-822b-0e2943f63563","title":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","url":"https://finance.yahoo.com/news/analysis-global-investors-turn-chinese-072806140.html","publisher":"Reuters","publishedAt":"2025-12-23T07:28:06.000Z","relatedTickers":["0981.HK","5310.TWO","688008.SS","688256.SS","688795.SS","AAPL","AMD","BIDU","GOOG","META","NVDA","OPAI.PVT","TCEHY","TSLA","^IXIC"],"mainIdea":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","summary":"Reuters: Analysis-Global investors turn to Chinese AI as Wall Street fears bubble. Foreigners see China closing ‌the tech gap with the U.S. as Beijing steps up support for AI chipmakers, spurring bets on Chinese companies just as worries grow over lofty valuations on U.S.-listed AI stocks. U.K.-based asset manager Ruffer, for example, said it has \"deliberately limited ‌exposure\" to the Magnificent Seven - the U.S. tech giants - and is looking to add positions in Alibaba for a bigger exposure to China's AI theme. \"While the U.S. remains the leader in frontier AI, China is rapidly narrowing the gap,\" said Gemma Cairns-Smith, Investment Specialist at Ruffer. Related tickers mentioned: 0981.HK, 5310.TWO, 688008.SS, 688256.SS, 688795.SS, AAPL, AMD, BIDU, GOOG, META, NVDA, OPAI.PVT, TCEHY, TSLA, ^IXIC."},{"id":"56cf5bdf-0756-3995-b55a-63f90164725d","title":"How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects","url":"https://finance.yahoo.com/news/investors-reacting-advanced-micro-devices-060913671.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T06:09:13.000Z","relatedTickers":["AMD"],"mainIdea":"How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects","summary":"Simply Wall St.: How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects. In mid-December 2025, Advanced Micro Devices appointed Emily Ellis as Corporate Vice President and Chief Accounting Officer, while oncology AI firm 4D Path announced a collaboration using AMD EPYC CPUs on Oracle Cloud Infrastructure to power its QPOR clinical trial platform. These developments highlight AMD’s push to pair leadership hires with deeper AI and healthcare workloads, reinforcing its role inside cloud-based, CPU-driven AI infrastructure. Now we’ll examine how a potential large... Related tickers mentioned: AMD."},{"id":"8fb0b09d-4808-38c7-83fb-ad8116dc56d0","title":"Alibaba Weighs Major AMD AI Chip Order","url":"https://finance.yahoo.com/news/alibaba-weighs-major-amd-ai-175939198.html","publisher":"GuruFocus.com","publishedAt":"2025-12-22T17:59:39.000Z","relatedTickers":["AMD","BABAF","INTC","NVDA"],"mainIdea":"Alibaba Weighs Major AMD AI Chip Order","summary":"GuruFocus.com: Alibaba Weighs Major AMD AI Chip Order. Potential deal highlights China's growing interest in U.S. chip technology. Related tickers mentioned: AMD, BABAF, INTC, NVDA."}]}
