{"symbol":"AMD","provider":"yahoo-finance","fetchedAt":"2025-12-23T16:04:18.407Z","asOfDate":"2025-12-23","articles":[{"id":"9a68cc45-9038-3feb-9d66-ffab1e178bb8","title":"Peak ETF Mania? Flows, Launches and Volume Shatter All Records","url":"https://finance.yahoo.com/news/peak-etf-mania-flows-launches-140300924.html","publisher":"Bloomberg","publishedAt":"2025-12-23T14:03:00.000Z","relatedTickers":[],"mainIdea":"Peak ETF Mania? Flows, Launches and Volume Shatter All Records","summary":"Bloomberg: Peak ETF Mania? Flows, Launches and Volume Shatter All Records. US-listed ETFs have attracted a staggering $1.4 trillion so far in 2025, shattering the annual flow record set just last year. Trading volume in the ETF market also hit a new yearly high. The last time all three measures hit a record in a single year was in 2021, according to Bloomberg Intelligence data."},{"id":"b03b2c12-d3bc-3dc2-a1a5-09707a62ebaa","title":"CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?","url":"https://finance.yahoo.com/news/cls-rides-steady-revenue-growth-135500007.html","publisher":"Zacks","publishedAt":"2025-12-23T13:55:00.000Z","relatedTickers":["AVGO","CLS","JBL"],"mainIdea":"CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?","summary":"Zacks: CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?. Celestica's revenues grow 27.8% to $3.19B, beating guidance as data center demand and AI infrastructure fuel strong cash flow momentum. Related tickers mentioned: AVGO, CLS, JBL."},{"id":"17a76c1b-babc-3e05-95cc-4f3a79b04229","title":"2025 was the year Xbox died","url":"https://finance.yahoo.com/m/17a76c1b-babc-3e05-95cc-4f3a79b04229/2025-was-the-year-xbox-died.html","publisher":"Engadget","publishedAt":"2025-12-23T13:00:00.000Z","relatedTickers":[],"mainIdea":"2025 was the year Xbox died","summary":"Engadget: 2025 was the year Xbox died. The Xbox brand effectively died this year. But can it be resurrected as a PC platform?"},{"id":"4ded2b2d-3ec0-3c1b-ad0c-5c2e4d58fe9b","title":"TSMC Extends Foundry Lead in Q3","url":"https://finance.yahoo.com/news/tsmc-extends-foundry-lead-q3-112055714.html","publisher":"GuruFocus.com","publishedAt":"2025-12-23T11:20:55.000Z","relatedTickers":["AVGO","NVDA","TSM","TSMWF"],"mainIdea":"TSMC Extends Foundry Lead in Q3","summary":"GuruFocus.com: TSMC Extends Foundry Lead in Q3. TSMC widens lead as demand surges Related tickers mentioned: AVGO, NVDA, TSM, TSMWF."},{"id":"2d165f1a-b15c-3235-8f37-a0682b9ccd73","title":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","url":"https://finance.yahoo.com/news/truist-reaffirms-buy-nvidia-nvda-075136854.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T07:51:36.000Z","relatedTickers":["AVGO","NVDA","TFC","TTMI"],"mainIdea":"Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside","summary":"Insider Monkey: Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside. NVIDIA Corporation (NASDAQ:NVDA) is one of the AI Stocks in the Spotlight for Investors. On December 19, Truist reiterated the stock at “Buy” and raised its price target to $275 per share from $255. The firm revised price targets in the semiconductor and artificial intelligence group after establishing 2027 projections. “In this construct, we favor […] Related tickers mentioned: AVGO, NVDA, TFC, TTMI."},{"id":"71ca0b31-035b-3bd8-822b-0e2943f63563","title":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","url":"https://finance.yahoo.com/news/analysis-global-investors-turn-chinese-072806140.html","publisher":"Reuters","publishedAt":"2025-12-23T07:28:06.000Z","relatedTickers":["0981.HK","5310.TWO","688008.SS","688256.SS","688795.SS","AAPL","BABA","BIDU","GOOG","META","NVDA","OPAI.PVT","TCEHY","TSLA","^IXIC"],"mainIdea":"Analysis-Global investors turn to Chinese AI as Wall Street fears bubble","summary":"Reuters: Analysis-Global investors turn to Chinese AI as Wall Street fears bubble. Foreigners see China closing ‌the tech gap with the U.S. as Beijing steps up support for AI chipmakers, spurring bets on Chinese companies just as worries grow over lofty valuations on U.S.-listed AI stocks. U.K.-based asset manager Ruffer, for example, said it has \"deliberately limited ‌exposure\" to the Magnificent Seven - the U.S. tech giants - and is looking to add positions in Alibaba for a bigger exposure to China's AI theme. \"While the U.S. remains the leader in frontier AI, China is rapidly narrowing the gap,\" said Gemma Cairns-Smith, Investment Specialist at Ruffer. Related tickers mentioned: 0981.HK, 5310.TWO, 688008.SS, 688256.SS, 688795.SS, AAPL, BABA, BIDU, GOOG, META, NVDA, OPAI.PVT, TCEHY, TSLA, ^IXIC."},{"id":"56cf5bdf-0756-3995-b55a-63f90164725d","title":"How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects","url":"https://finance.yahoo.com/news/investors-reacting-advanced-micro-devices-060913671.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T06:09:13.000Z","relatedTickers":["BABA"],"mainIdea":"How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects","summary":"Simply Wall St.: How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects. In mid-December 2025, Advanced Micro Devices appointed Emily Ellis as Corporate Vice President and Chief Accounting Officer, while oncology AI firm 4D Path announced a collaboration using AMD EPYC CPUs on Oracle Cloud Infrastructure to power its QPOR clinical trial platform. These developments highlight AMD’s push to pair leadership hires with deeper AI and healthcare workloads, reinforcing its role inside cloud-based, CPU-driven AI infrastructure. Now we’ll examine how a potential large... Related tickers mentioned: BABA."}]}
