{"symbol":"AMD","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:21:25.842Z","asOfDate":"2025-12-24","articles":[{"id":"83a4e073-f0f2-3088-92cf-343bfe8a20f0","title":"The New Year Could Bring Massive Upside for These Semiconductor Stocks","url":"https://finance.yahoo.com/m/83a4e073-f0f2-3088-92cf-343bfe8a20f0/the-new-year-could-bring.html","publisher":"Motley Fool","publishedAt":"2025-12-24T18:05:00.000Z","relatedTickers":["^SOX"],"mainIdea":"The New Year Could Bring Massive Upside for These Semiconductor Stocks","summary":"Motley Fool: The New Year Could Bring Massive Upside for These Semiconductor Stocks. The semiconductor sector is poised for stronger growth in 2026, positioning some of the top names in this sector for solid gains. Related tickers mentioned: ^SOX."},{"id":"fd491991-e686-3601-a1eb-9babc28e7d28","title":"Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership","url":"https://finance.yahoo.com/news/leak-hints-first-intel-nvidia-174745114.html","publisher":"GuruFocus.com","publishedAt":"2025-12-24T17:47:45.000Z","relatedTickers":["INTC","NVDA","TSM"],"mainIdea":"Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership","summary":"GuruFocus.com: Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership. Intel (INTC, Financials) and Nvidia (NVDA, Financials) may be preparing to ship their first jointly developed chip, according to leaked details about a laptop processor called Serpent Lake. The leak, shared by YouTube channel RedGamingTec, suggests the chip will combine Intel CPUs with Nvidia RTX graphics in a single design. Serpent Lake is expected to pair Intel's upcoming Titan Lake CPU architecture with Nvidia's RTX Rubin graphics, manufactured on TSMC's 3-nanometer process. Related tickers mentioned: INTC, NVDA, TSM."},{"id":"f7ac9adc-be0e-3164-a9ed-3c9297ecb49a","title":"Your next prebuilt PC might arrive with memory loss","url":"https://finance.yahoo.com/m/f7ac9adc-be0e-3164-a9ed-3c9297ecb49a/your-next-prebuilt-pc-might.html","publisher":"Digital Trends","publishedAt":"2025-12-24T17:42:44.000Z","relatedTickers":[],"mainIdea":"Your next prebuilt PC might arrive with memory loss","summary":"Digital Trends: Your next prebuilt PC might arrive with memory loss. Facing RAM shortages, Paradox Customs is offering prebuilts without memory, shifting compatibility and stability responsibilities to customers and blurring the line between prebuilt and DIY PCs. The post Your next prebuilt PC might arrive with memory loss appeared first on Digital Trends."},{"id":"549d4ec5-35d0-35f3-a6e6-d90ff2ffca08","title":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","url":"https://finance.yahoo.com/m/549d4ec5-35d0-35f3-a6e6-d90ff2ffca08/fidelity-contrafund%E2%80%99s-will.html","publisher":"Barrons.com","publishedAt":"2025-12-24T06:00:00.000Z","relatedTickers":["AAPL","AMZN","BRK-B","MCD","META"],"mainIdea":"Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins","summary":"Barrons.com: Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins. The legendary manager has taken on two co-managers to help him run the mammoth fund. Just don’t use the word “retirement.” Related tickers mentioned: AAPL, AMZN, BRK-B, MCD, META."},{"id":"0c17c5ac-da43-3731-8578-903d129e720f","title":"Has Intel’s 79.8% 2025 Surge Outrun Its Fundamentals?","url":"https://finance.yahoo.com/news/intel-79-8-2025-surge-021201736.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T02:12:01.000Z","relatedTickers":["INTC"],"mainIdea":"Has Intel’s 79.8% 2025 Surge Outrun Its Fundamentals?","summary":"Simply Wall St.: Has Intel’s 79.8% 2025 Surge Outrun Its Fundamentals?. If you are wondering whether Intel is still a bargain after its huge run, or if the easy money has already been made, you are in the right place to unpack what the current share price really implies. Despite a choppy week with the stock down about 2.6%, Intel is still up roughly 5.4% over the last month and an impressive 79.8% year to date, reshaping how the market is pricing its turnaround story. That surge has been fueled by renewed optimism in Intel's foundry ambitions, ongoing... Related tickers mentioned: INTC."},{"id":"54119a14-6c9f-3ae2-9602-a3959ae5d6a1","title":"First Atlantic Closes No-Warrant Private Placement Financing as Strategic Investor Exercises 9.9% Top-Up Right Under Investor Rights Agreement","url":"https://finance.yahoo.com/news/first-atlantic-closes-no-warrant-224100159.html","publisher":"GlobeNewswire","publishedAt":"2025-12-23T22:41:00.000Z","relatedTickers":["FANCF"],"mainIdea":"First Atlantic Closes No-Warrant Private Placement Financing as Strategic Investor Exercises 9.9% Top-Up Right Under Investor Rights Agreement","summary":"GlobeNewswire: First Atlantic Closes No-Warrant Private Placement Financing as Strategic Investor Exercises 9.9% Top-Up Right Under Investor Rights Agreement. Not for Distribution to U.S. Newswire Services or for Dissemination in the United States. VANCOUVER, British Columbia, Dec. 23, 2025 (GLOBE NEWSWIRE) -- First Atlantic Nickel Corp. (TSXV: FAN) (OTCQB: FANCF) (FSE: P21) (“FAN” or the “Company”) announces that it has closed its non-brokered private placement (the “Offering”) of flow-through common shares, issued without warrants, for aggregate gross proceeds of $2,619,316. In connection with the Offering, a strategic investor exercised its top-up Related tickers mentioned: FANCF."}]}
