{"symbol":"AMD","provider":"yahoo-finance","fetchedAt":"2025-12-26T04:27:06.458Z","asOfDate":"2025-12-25","articles":[{"id":"a67d7ab6-0aea-3869-8174-20f545a81294","title":"Veteran analyst has blunt message on Intel stock","url":"https://finance.yahoo.com/m/a67d7ab6-0aea-3869-8174-20f545a81294/veteran-analyst-has-blunt.html","publisher":"TheStreet","publishedAt":"2025-12-25T17:47:00.000Z","relatedTickers":["INTC","NVDA"],"mainIdea":"Veteran analyst has blunt message on Intel stock","summary":"TheStreet: Veteran analyst has blunt message on Intel stock. Intel stock is trading approximately 0.52% lower at $36.16 as of the time of writing. The stock is down, due to a Reuters report stating that Nvidia has decided not to manufacture its chips using Intel’s 18A node (manufacturing process) after conducting some testing. In response to this report, an ... Related tickers mentioned: INTC, NVDA."},{"id":"6f96e6fc-02b9-3748-a96a-317bf431f9b5","title":"Emerge's 2025 Story of the Year: How the AI Race Fractured the Global Tech Order","url":"https://finance.yahoo.com/m/6f96e6fc-02b9-3748-a96a-317bf431f9b5/emerge%27s-2025-story-of-the.html","publisher":"decrypt","publishedAt":"2025-12-25T17:01:03.000Z","relatedTickers":[],"mainIdea":"Emerge's 2025 Story of the Year: How the AI Race Fractured the Global Tech Order","summary":"decrypt: Emerge's 2025 Story of the Year: How the AI Race Fractured the Global Tech Order. 2025 saw the US-China rivalry weaponize every layer of the technology stack—from minerals to models to military doctrine."},{"id":"99216414-64c2-3ffc-b596-4d88ea14a8c5","title":"Harbor Capital Appreciation Fund Added Advanced Micro Devices (AMD) in Q3","url":"https://finance.yahoo.com/news/harbor-capital-appreciation-fund-added-154332308.html","publisher":"Insider Monkey","publishedAt":"2025-12-25T15:43:32.000Z","relatedTickers":["^GSPC"],"mainIdea":"Harbor Capital Appreciation Fund Added Advanced Micro Devices (AMD) in Q3","summary":"Insider Monkey: Harbor Capital Appreciation Fund Added Advanced Micro Devices (AMD) in Q3. Harbor Capital Appreciation Fund, an investment management company, released its Q3 2025 investor letter. A copy of the same can be downloaded here. The Harbor Capital Appreciation Fund primarily focuses on investing in equity securities, targeting U.S. companies that have a market capitalization of at least $1 billion at the time of investment. US equities […] Related tickers mentioned: ^GSPC."},{"id":"bb89de13-f7fc-315f-a1ac-2c4f02126a7f","title":"Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?","url":"https://finance.yahoo.com/news/amd-soaring-ai-fueled-share-063241187.html","publisher":"Simply Wall St.","publishedAt":"2025-12-25T06:32:41.000Z","relatedTickers":["NVDA"],"mainIdea":"Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?","summary":"Simply Wall St.: Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?. If you are wondering whether Advanced Micro Devices at around $215 a share is still a smart buy or if the big gains are largely behind it, you are not alone. This is exactly the question we are going to unpack. The stock is up 8.5% over the last week and 78.3% year to date, building on a 70.3% gain over the past year and a 243.7% return over three years that has reset expectations and risk perceptions for investors. Recent headlines have focused on AMD expanding its presence in artificial... Related tickers mentioned: NVDA."},{"id":"1edd4571-6a6a-39df-933c-2597a5f474f5","title":"Nvidia makes its biggest purchase ever","url":"https://finance.yahoo.com/m/1edd4571-6a6a-39df-933c-2597a5f474f5/nvidia-makes-its-biggest.html","publisher":"TheStreet","publishedAt":"2025-12-25T06:07:00.000Z","relatedTickers":["GROQ.PVT","NVDA"],"mainIdea":"Nvidia makes its biggest purchase ever","summary":"TheStreet: Nvidia makes its biggest purchase ever. According to CNBC, Nvidia has agreed to pay about $20 billion in cash for Groq, a specialist in AI accelerator chips used to power inference—the stage where trained AI models actually answer questions, generate text, or drive real-time applications. Alex Davis, CEO of investment firm Disruptive, ... Related tickers mentioned: GROQ.PVT, NVDA."},{"id":"2bd54928-4010-3b51-b6ac-54f36415c121","title":"US ETF Market Hits Triple Crown While BTC Bleeds and XRP Soars","url":"https://finance.yahoo.com/m/2bd54928-4010-3b51-b6ac-54f36415c121/us-etf-market-hits-triple.html","publisher":"BeInCrypto","publishedAt":"2025-12-25T02:55:38.000Z","relatedTickers":["^GSPC"],"mainIdea":"US ETF Market Hits Triple Crown While BTC Bleeds and XRP Soars","summary":"BeInCrypto: US ETF Market Hits Triple Crown While BTC Bleeds and XRP Soars. US ETF market hits triple crown in 2025, but crypto funds diverge—BTC and ETH bleed while XRP and SOL attract record inflows. Related tickers mentioned: ^GSPC."}]}
