{"symbol":"DIA","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:04.852Z","asOfDate":"2025-12-27","articles":[{"id":"14f280ec-f0c0-35ab-8f0f-878d11a1faf1","title":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","url":"https://finance.yahoo.com/news/silver-jumps-6-platinum-8-160108318.html","publisher":"Benzinga","publishedAt":"2025-12-27T16:01:08.000Z","relatedTickers":["PA=F","PL=F","SI=F"],"mainIdea":"Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?","summary":"Benzinga: Silver Jumps 6%, Platinum Up 8%, Palladium Up 11% As Metal Shock Erupts: What's Moving Markets Friday?. While Wall Street traded in a subdued session marked by thin liquidity and low volumes following the Christmas market closure, price action turned wild across precious and industrial metals. By midday trading in New York, silver prices — as tracked by the iShares Silver Trust (NYSE:SLV) — surged more than 6%, breaking above $76 an ounce, fueled by an intensifying supply crunch across Asian markets. The move pushed silver's year-to-date gains to roughly 164%, marking the metal's strongest annual Related tickers mentioned: PA=F, PL=F, SI=F."},{"id":"ce40ca5e-8fe5-34fc-a709-cb5732b86687","title":"Former “Lion King” child actor Imani Dia Smith killed in home stabbing","url":"https://finance.yahoo.com/m/ce40ca5e-8fe5-34fc-a709-cb5732b86687/former-%E2%80%9Clion-king%E2%80%9D-child.html","publisher":"ABC News Videos","publishedAt":"2025-12-27T10:03:19.000Z","relatedTickers":[],"mainIdea":"Former “Lion King” child actor Imani Dia Smith killed in home stabbing","summary":"ABC News Videos: Former “Lion King” child actor Imani Dia Smith killed in home stabbing. New Jersey prosecutors say Imani Dia Smith, a former Broadway child actor who appeared in “The Lion King,” was stabbed to death in her home Sunday."},{"id":"289186b6-2c3c-3e40-bbb7-92f0c94a44e8","title":"ChatGPT could soon get a power tool that will forever change how AI works for you","url":"https://finance.yahoo.com/m/289186b6-2c3c-3e40-bbb7-92f0c94a44e8/chatgpt-could-soon-get-a.html","publisher":"Digital Trends","publishedAt":"2025-12-27T04:00:00.000Z","relatedTickers":[],"mainIdea":"ChatGPT could soon get a power tool that will forever change how AI works for you","summary":"Digital Trends: ChatGPT could soon get a power tool that will forever change how AI works for you. ChatGPT could soon embrace an open standard that will let users create custom one-word shortcuts for repetitive tasks, and even use them with other AI chatbots, as well. The post ChatGPT could soon get a power tool that will forever change how AI works for you appeared first on Digital Trends."}]}
