{"symbol":"DOCU","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:57:44.915Z","asOfDate":"2025-12-22","articles":[{"id":"2bf675a6-b737-3235-9c26-642b6916be6c","title":"12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back","url":"https://finance.yahoo.com/m/2bf675a6-b737-3235-9c26-642b6916be6c/12-stocks-that-dropped-after.html","publisher":"Barrons.com","publishedAt":"2025-12-22T18:55:00.000Z","relatedTickers":["CARR","CMCSA","CMCSV","MSTR","STRC","STRD","STRF","STRK","UNH"],"mainIdea":"12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back","summary":"Barrons.com: 12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back. The sale of underperforming assets to lessen stockholders’ tax burden can render some stocks undervalued. An Evercore screen can help you find names that can bounce back. Related tickers mentioned: CARR, CMCSA, CMCSV, MSTR, STRC, STRD, STRF, STRK, UNH."},{"id":"4edbe158-8938-32ce-93b3-7c2848de5d84","title":"Reasons Why You Should Retain Docusign Stock in Your Portfolio","url":"https://finance.yahoo.com/news/reasons-why-retain-docusign-stock-161000076.html","publisher":"Zacks","publishedAt":"2025-12-22T16:10:00.000Z","relatedTickers":["LAW","^GSPC"],"mainIdea":"Reasons Why You Should Retain Docusign Stock in Your Portfolio","summary":"Zacks: Reasons Why You Should Retain Docusign Stock in Your Portfolio. DOCU shares climb 6.1% in a month with earnings and revenue growth fueled by rising demand for eSignature and its Intelligent Agreement Management platform. Related tickers mentioned: LAW, ^GSPC."},{"id":"ad307342-f3fb-3185-86f6-9e7866bff5f9","title":"Reassessing DocuSign (DOCU) Valuation After Upbeat Earnings, IAM Traction and Fresh AI Expansion News","url":"https://finance.yahoo.com/news/reassessing-docusign-docu-valuation-upbeat-070830236.html","publisher":"Simply Wall St.","publishedAt":"2025-12-21T07:08:30.000Z","relatedTickers":[],"mainIdea":"Reassessing DocuSign (DOCU) Valuation After Upbeat Earnings, IAM Traction and Fresh AI Expansion News","summary":"Simply Wall St.: Reassessing DocuSign (DOCU) Valuation After Upbeat Earnings, IAM Traction and Fresh AI Expansion News. DocuSign (DOCU) has been back on investors radar after a string of upbeat commentary tied to its stronger earnings print, early traction in Intelligent Agreement Management, and fresh AI heavy expansion in Europe. See our latest analysis for DocuSign. Despite the upbeat news flow, the 1 year total shareholder return of roughly negative 26 percent and year to date share price return around negative 23 percent show sentiment is still catching up, even as recent 1 month share price gains hint..."}]}
