{"symbol":"PRU","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:17.039Z","asOfDate":"2025-12-26","articles":[{"id":"e0ffe809-0feb-302b-913c-a46814f0c06d","title":"Prudential price target raised to $120 from $110 at Piper Sandler","url":"https://finance.yahoo.com/news/prudential-price-target-raised-120-115027162.html","publisher":"TipRanks","publishedAt":"2025-12-24T11:50:27.000Z","relatedTickers":[],"mainIdea":"Prudential price target raised to $120 from $110 at Piper Sandler","summary":"TipRanks: Prudential price target raised to $120 from $110 at Piper Sandler. Piper Sandler raised the firm’s price target on Prudential (PRU) to $120 from $110 and keeps a Neutral rating on the shares. The firm is generally above consensus across the board in lifecoland. The drop in rates has been more gradual than has otherwise been expected, which has been constructive for broader capital markets activity too. This likely causes some tailwind to fee and spread earnings in its coverage, Piper adds.Claim 70% Off TipRanks This Holiday SeasonUnlock hedge fund-level data an"},{"id":"82e4f60f-eb36-3bd2-b10d-074da97bf127","title":"Is It Too Late to Consider Perseus Mining After Its 128% Share Price Surge?","url":"https://finance.yahoo.com/news/too-consider-perseus-mining-128-001813472.html","publisher":"Simply Wall St.","publishedAt":"2025-12-24T00:18:13.000Z","relatedTickers":["GC=F","PMNXF"],"mainIdea":"Is It Too Late to Consider Perseus Mining After Its 128% Share Price Surge?","summary":"Simply Wall St.: Is It Too Late to Consider Perseus Mining After Its 128% Share Price Surge?. If you have been wondering whether Perseus Mining is still good value after its huge run, you are not alone. Investors are trying to work out if there is more upside, or if the easy gains are behind it. The stock has climbed 5.2% over the last week, 9.2% over the past month, and an eye catching 127.8% in the last year, with a staggering 388.5% gain over five years that has clearly changed how the market views its prospects and risks. Much of this momentum has lined up with stronger gold... Related tickers mentioned: GC=F, PMNXF."},{"id":"6137502b-13a4-3c5b-ad19-d36efe42470c","title":"Prudential (PRU) Starts at Neutral as Mizuho Launches Broad Insurance Coverage","url":"https://finance.yahoo.com/news/prudential-pru-starts-neutral-mizuho-222556442.html","publisher":"Insider Monkey","publishedAt":"2025-12-23T22:25:56.000Z","relatedTickers":[],"mainIdea":"Prudential (PRU) Starts at Neutral as Mizuho Launches Broad Insurance Coverage","summary":"Insider Monkey: Prudential (PRU) Starts at Neutral as Mizuho Launches Broad Insurance Coverage. Prudential Financial, Inc. (NYSE:PRU) is included among the Best Stocks for a Dividend Achievers List. On December 16, Mizuho analyst Yaron Kinar initiated coverage of Prudential Financial, Inc. (NYSE:PRU) with a Neutral rating and a $125 price target. The initiation was part of a broader launch covering 23 companies. This included six life insurers, 11 […]"}]}
