{"symbol":"LCID","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:55:55.807Z","asOfDate":"2025-12-22","articles":[{"id":"faaf6c24-ab41-3356-bcf0-d6b19ef0523f","title":"Sterling Infrastructure and Taylor Morrison Home have been highlighted as Zacks Bull and Bear of the Day","url":"https://finance.yahoo.com/news/sterling-infrastructure-taylor-morrison-home-143400966.html","publisher":"Zacks","publishedAt":"2025-12-22T14:34:00.000Z","relatedTickers":["F","STRL","TMHC","TSLA"],"mainIdea":"Sterling Infrastructure and Taylor Morrison Home have been highlighted as Zacks Bull and Bear of the Day","summary":"Zacks: Sterling Infrastructure and Taylor Morrison Home have been highlighted as Zacks Bull and Bear of the Day. Sterling Infrastructure earns Bull of the Day as AI data center demand, reshoring and infrastructure spending fuel explosive earnings growth. Related tickers mentioned: F, STRL, TMHC, TSLA."},{"id":"8aa12933-c34c-3436-8b8b-909ce4734712","title":"Is Lucid (LCID) Using Saudi-Backed Liquidity To Buy Time For Its Luxury EV Strategy?","url":"https://finance.yahoo.com/news/lucid-lcid-using-saudi-backed-011258569.html","publisher":"Simply Wall St.","publishedAt":"2025-12-21T01:12:58.000Z","relatedTickers":["UBER"],"mainIdea":"Is Lucid (LCID) Using Saudi-Backed Liquidity To Buy Time For Its Luxury EV Strategy?","summary":"Simply Wall St.: Is Lucid (LCID) Using Saudi-Backed Liquidity To Buy Time For Its Luxury EV Strategy?. Earlier this month, Lucid Group used a Nasdaq investor conference and subsequent media outreach to highlight its liquidity support from Saudi Arabia’s Public Investment Fund, expanded credit facilities, and the planned ramp-up of its Gravity SUV amid a softer luxury EV backdrop. These updates, together with new partnerships such as Uber and Nuro, awards for the Gravity and Air, and a certified pre-owned program, show Lucid leaning on financing flexibility and product breadth to offset... Related tickers mentioned: UBER."},{"id":"54dd2651-4d7a-3bed-a494-b84b3803bc4b","title":"Forget Lucid Stock and Look at This EV Stock Instead","url":"https://finance.yahoo.com/m/54dd2651-4d7a-3bed-a494-b84b3803bc4b/forget-lucid-stock-and-look.html","publisher":"Motley Fool","publishedAt":"2025-12-20T15:20:00.000Z","relatedTickers":["^GSPC"],"mainIdea":"Forget Lucid Stock and Look at This EV Stock Instead","summary":"Motley Fool: Forget Lucid Stock and Look at This EV Stock Instead. Why bother with Lucid when there Related tickers mentioned: ^GSPC."}]}
