{"symbol":"PFE","provider":"yahoo-finance","fetchedAt":"2025-12-22T21:55:57.124Z","asOfDate":"2025-12-22","articles":[{"id":"2dc54035-691e-35fa-af3d-c59a4fb8694a","title":"Bet on These Top-Ranked Healthcare ETFs Before 2025 Ends","url":"https://finance.yahoo.com/news/bet-top-ranked-healthcare-etfs-184300571.html","publisher":"Zacks","publishedAt":"2025-12-22T18:43:00.000Z","relatedTickers":["ABBV","BMY","IHE","JNJ","LLY","VHCIX","VHT","XLV","^GSPC"],"mainIdea":"Bet on These Top-Ranked Healthcare ETFs Before 2025 Ends","summary":"Zacks: Bet on These Top-Ranked Healthcare ETFs Before 2025 Ends. XLV and similar healthcare ETFs are gaining momentum as strength in biotech, increased AI adoption, and rising defensive demand position the sector for year-end leadership. Related tickers mentioned: ABBV, BMY, IHE, JNJ, LLY, VHCIX, VHT, XLV, ^GSPC."},{"id":"5bed4ebe-57b5-3d93-bd71-9a835377478b","title":"This Pharma Stock Had a Rough Year. Why One Analyst Thinks It Can Rise 250%.","url":"https://finance.yahoo.com/m/5bed4ebe-57b5-3d93-bd71-9a835377478b/this-pharma-stock-had-a-rough.html","publisher":"Barrons.com","publishedAt":"2025-12-22T13:19:00.000Z","relatedTickers":["MRK","PCVX"],"mainIdea":"This Pharma Stock Had a Rough Year. Why One Analyst Thinks It Can Rise 250%.","summary":"Barrons.com: This Pharma Stock Had a Rough Year. Why One Analyst Thinks It Can Rise 250%.. Vaxcyte stock kept its place as one of Mizuho’s top picks entering 2026, with the firm reiterating an Outperform rating and a $163 price target in a research note. Vaxcyte is advancing to phase 3 trials for its shot, VAX-31, in adults and phase 2 trials for infants. It could eventually be a leader in an $8 billion market, Mizuho argued. Related tickers mentioned: MRK, PCVX."},{"id":"8262610a-528e-3ca1-b486-1421dacadaf5","title":"Flagship Pioneering and Repertoire® Immune Medicines Announce Agreement to Identify T Cell-Targeted Immune Medicines for Prostate Cancer Under Strategic Partnership with Pfizer","url":"https://finance.yahoo.com/news/flagship-pioneering-repertoire-immune-medicines-130000322.html","publisher":"PR Newswire","publishedAt":"2025-12-22T13:00:00.000Z","relatedTickers":[],"mainIdea":"Flagship Pioneering and Repertoire® Immune Medicines Announce Agreement to Identify T Cell-Targeted Immune Medicines for Prostate Cancer Under Strategic Partnership with Pfizer","summary":"PR Newswire: Flagship Pioneering and Repertoire® Immune Medicines Announce Agreement to Identify T Cell-Targeted Immune Medicines for Prostate Cancer Under Strategic Partnership with Pfizer. Flagship Pioneering, a scientific innovation engine for transformative platforms and products, today announced a research program under its strategic collaboration with Pfizer whereby Flagship-founded Repertoire® Immune Medicines will identify and optimize TCR bispecifics for metastatic prostate cancer."}]}
