{"symbol":"PFE","provider":"yahoo-finance","fetchedAt":"2025-12-27T20:45:03.173Z","asOfDate":"2025-12-27","articles":[{"id":"76803831-390a-3db7-aefe-34c1dcaf53a5","title":"3 Superb High-Yield Dividend Stocks With Yields North of 5% That Make for No-Brainer Buys Right Now","url":"https://finance.yahoo.com/m/76803831-390a-3db7-aefe-34c1dcaf53a5/3-superb-high-yield-dividend.html","publisher":"Motley Fool","publishedAt":"2025-12-27T11:50:00.000Z","relatedTickers":["VZ"],"mainIdea":"3 Superb High-Yield Dividend Stocks With Yields North of 5% That Make for No-Brainer Buys Right Now","summary":"Motley Fool: 3 Superb High-Yield Dividend Stocks With Yields North of 5% That Make for No-Brainer Buys Right Now. High dividend yields don't matter if they aren't supported by quality businesses. Related tickers mentioned: VZ."},{"id":"090d9a3a-cf36-321f-acb8-a19a9ed21249","title":"This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year","url":"https://finance.yahoo.com/m/090d9a3a-cf36-321f-acb8-a19a9ed21249/this-beaten-down-pharma-stock.html","publisher":"Barrons.com","publishedAt":"2025-12-27T07:30:00.000Z","relatedTickers":["BMY"],"mainIdea":"This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year","summary":"Barrons.com: This Beaten-Down Pharma Stock Could Make a Turnaround in the New Year. Bristol Myers Squibb could become the pharmaceutical industry’s turnaround story for 2026. Shares are off 9% in 2025 after a series of drug pipeline disappointments, while major patent expirations, like one for cancer drug Revlimid, could cause earnings to fall 5% in 2026 and another 5% in 2027. At the current price, investors are paying little for Bristol Myers’ pipeline, led by Cobenfy, a schizophrenia drug being tested as a treatment for psychosis among Alzheimer’s patients, and Milvexian, a treatment of atrial fibrillation and strokes. Related tickers mentioned: BMY."},{"id":"c230000d-df7d-376d-a470-467c6c84e11f","title":"This Cancer-Fighting Biotech Surges Into Buy Zone As Earnings Soar 131%","url":"https://finance.yahoo.com/m/c230000d-df7d-376d-a470-467c6c84e11f/this-cancer-fighting-biotech.html","publisher":"Investor's Business Daily","publishedAt":"2025-12-26T16:07:25.000Z","relatedTickers":["ABBV","GMAB","GNMSF","JNJ"],"mainIdea":"This Cancer-Fighting Biotech Surges Into Buy Zone As Earnings Soar 131%","summary":"Investor's Business Daily: This Cancer-Fighting Biotech Surges Into Buy Zone As Earnings Soar 131%. Investors gave been rotating away from technology. This biotech stock has rallied into a buy zone amid sharp earnings growth. Related tickers mentioned: ABBV, GMAB, GNMSF, JNJ."}]}
