{"symbol":"HCA","provider":"yahoo-finance","fetchedAt":"2025-12-26T10:11:09.743Z","asOfDate":"2025-12-26","articles":[{"id":"64410733-7fea-3bdb-b5ac-cde586afb0ff","title":"What HCA Healthcare (HCA)'s Upbeat 2025 Guidance and Buybacks Mean For Shareholders","url":"https://finance.yahoo.com/news/hca-healthcare-hca-upbeat-2025-210851088.html","publisher":"Simply Wall St.","publishedAt":"2025-12-23T21:08:51.000Z","relatedTickers":[],"mainIdea":"What HCA Healthcare (HCA)'s Upbeat 2025 Guidance and Buybacks Mean For Shareholders","summary":"Simply Wall St.: What HCA Healthcare (HCA)'s Upbeat 2025 Guidance and Buybacks Mean For Shareholders. HCA Healthcare recently prepared to release its fiscal fourth-quarter results, following a year in which it raised 2025 guidance to US$75.00–US$76.50 billion in revenue and US$27–US$28 earnings per share after repeatedly beating earnings estimates. Behind those numbers, an aggressive share repurchase program that has cut the share count by about 44% since 2015 has helped earnings per share grow faster than revenue, reinforcing investor attention on how HCA deploys its growing free cash..."},{"id":"19b64cb8-1225-3e77-afd8-2953471d0d16","title":"What to Expect From HCA Healthcare's Next Quarterly Earnings Report","url":"https://finance.yahoo.com/m/19b64cb8-1225-3e77-afd8-2953471d0d16/what-to-expect-from-hca.html","publisher":"Barchart","publishedAt":"2025-12-23T13:48:30.000Z","relatedTickers":[],"mainIdea":"What to Expect From HCA Healthcare's Next Quarterly Earnings Report","summary":"Barchart: What to Expect From HCA Healthcare's Next Quarterly Earnings Report. HCA Healthcare is all set to release its fiscal fourth-quarter earnings soon, and analysts project a double-digit earnings growth."},{"id":"37f26410-6871-3740-bc8a-a8130ed8604a","title":"1 Unpopular Stock That Deserves Some Love and 2 We Question","url":"https://finance.yahoo.com/news/1-unpopular-stock-deserves-love-043317151.html","publisher":"StockStory","publishedAt":"2025-12-23T04:33:17.000Z","relatedTickers":["HSY","IHRT","IHRTB"],"mainIdea":"1 Unpopular Stock That Deserves Some Love and 2 We Question","summary":"StockStory: 1 Unpopular Stock That Deserves Some Love and 2 We Question. Wall Street’s bearish price targets for the stocks in this article signal serious concerns. Such forecasts are uncommon in an industry where maintaining cordial corporate relationships often trumps delivering the hard truth. Related tickers mentioned: HSY, IHRT, IHRTB."}]}
