{"symbol":"MRK","provider":"yahoo-finance","fetchedAt":"2025-12-24T18:21:43.117Z","asOfDate":"2025-12-24","articles":[{"id":"a89a21b0-4158-368a-8375-a69745a3275a","title":"PFE's Oncology & Obesity Pipeline Position It for Post-LOE Growth","url":"https://finance.yahoo.com/news/pfes-oncology-obesity-pipeline-position-162000310.html","publisher":"Zacks","publishedAt":"2025-12-24T16:20:00.000Z","relatedTickers":["JNJ","PFE"],"mainIdea":"PFE's Oncology & Obesity Pipeline Position It for Post-LOE Growth","summary":"Zacks: PFE's Oncology & Obesity Pipeline Position It for Post-LOE Growth. Pfizer faces revenue pressure from 2026-2030 LOEs but is betting on a strengthened oncology and obesity pipeline to fuel sustainable post-LOE growth. Related tickers mentioned: JNJ, PFE."},{"id":"b24a246a-6397-39aa-9b8e-de96f1593f9d","title":"Amgen Strikes Drug Pricing Deal With Trump: What Investors Should Know","url":"https://finance.yahoo.com/news/amgen-strikes-drug-pricing-deal-153300363.html","publisher":"Zacks","publishedAt":"2025-12-24T15:33:00.000Z","relatedTickers":["AMGN","BMY","GLAXF","GSK"],"mainIdea":"Amgen Strikes Drug Pricing Deal With Trump: What Investors Should Know","summary":"Zacks: Amgen Strikes Drug Pricing Deal With Trump: What Investors Should Know. AMGN signs a pricing deal with the Trump administration, cutting U.S. drug costs, expanding DTC access and securing tariff relief tied to domestic investment. Related tickers mentioned: AMGN, BMY, GLAXF, GSK."},{"id":"c3618b22-c259-3b5d-8c97-07b84b79431b","title":"Will the Recent Pricing Deal With the Government Impact BMY's Sales?","url":"https://finance.yahoo.com/news/recent-pricing-deal-government-impact-190900119.html","publisher":"Zacks","publishedAt":"2025-12-23T19:09:00.000Z","relatedTickers":["BMY","JNJ","PFE"],"mainIdea":"Will the Recent Pricing Deal With the Government Impact BMY's Sales?","summary":"Zacks: Will the Recent Pricing Deal With the Government Impact BMY's Sales?. BMY has agreed to supply Eliquis free of charge to Medicaid starting in 2026 and will also donate seven tons of the active pharmaceutical ingredient used in Eliquis. Related tickers mentioned: BMY, JNJ, PFE."},{"id":"8da82c68-9ff0-3427-9e31-bf8f3472e95b","title":"Wall Street Analysts Think Merck (MRK) Is a Good Investment: Is It?","url":"https://finance.yahoo.com/news/wall-street-analysts-think-merck-143004805.html","publisher":"Zacks","publishedAt":"2025-12-23T14:30:04.000Z","relatedTickers":[],"mainIdea":"Wall Street Analysts Think Merck (MRK) Is a Good Investment: Is It?","summary":"Zacks: Wall Street Analysts Think Merck (MRK) Is a Good Investment: Is It?. Based on the average brokerage recommendation (ABR), Merck (MRK) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?"},{"id":"69a3fc90-5c9a-3f39-ba20-b0a55ac4346e","title":"Dogs of the Dow Enhanced Income Strategy with Covered Calls","url":"https://finance.yahoo.com/m/69a3fc90-5c9a-3f39-ba20-b0a55ac4346e/dogs-of-the-dow-enhanced.html","publisher":"Barchart","publishedAt":"2025-12-23T12:00:02.000Z","relatedTickers":["^DJI"],"mainIdea":"Dogs of the Dow Enhanced Income Strategy with Covered Calls","summary":"Barchart: Dogs of the Dow Enhanced Income Strategy with Covered Calls. The Dogs of the Dow has long been a simple, rules-based approach to equity investing, built around owning the highest-yielding stocks in the Dow Jones Industrial Average. Each year, investors rotate into the 10 Dow components with the highest dividend yields, based on the assumption that these stocks are temporarily out of favor and may rebound over time. Related tickers mentioned: ^DJI."}]}
